TI ARM Assembler PC v18.12.2 Sat Dec 14 17:40:32 2019

Copyright (c) 1996-2018 Texas Instruments Incorporated
BL_Master.asm                                                        PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM G3 C/C++ Codegen                                            PC v18.12.2.LTS *
       3                    ;* Date/Time created: Sat Dec 14 17:40:31 2019                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --embed
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../BL_Master.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM G3 C/C++ Codegen PC v18.12.2.LTS Copyright (c) 199
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\Hp\workspace_v9_TIMSP432\BL_MASTER\Debug")
      13                            .global sanity_check
      14 00000000                   .sect   ".data:sanity_check", RW
      15                            .align  1

    1533                            .dwattr $C$DW$56, DW_AT_decl_file("..\state_machine.h")
    1534                            .dwattr $C$DW$56, DW_AT_decl_line(0x1d)
    1535                            .dwattr $C$DW$56, DW_AT_decl_column(0x05)
    1536                    
    1537                    $C$DW$57        .dwtag  DW_TAG_enumerator
    1538                            .dwattr $C$DW$57, DW_AT_name("ePROGRAMMING_DONE")
    1539                            .dwattr $C$DW$57, DW_AT_const_value(0x09)
    1540                            .dwattr $C$DW$57, DW_AT_decl_file("..\state_machine.h")
    1541                            .dwattr $C$DW$57, DW_AT_decl_line(0x1e)
    1542                            .dwattr $C$DW$57, DW_AT_decl_column(0x05)
    1543                    
    1544                    $C$DW$58        .dwtag  DW_TAG_enumerator
    1545                            .dwattr $C$DW$58, DW_AT_name("eChecksum_Error")
    1546                            .dwattr $C$DW$58, DW_AT_const_value(0x0a)
    1547                            .dwattr $C$DW$58, DW_AT_decl_file("..\state_machine.h")
    1548                            .dwattr $C$DW$58, DW_AT_decl_line(0x1f)
    1549                            .dwattr $C$DW$58, DW_AT_decl_column(0x05)
    1550                    
    1551                    $C$DW$59        .dwtag  DW_TAG_enumerator
    1552                            .dwattr $C$DW$59, DW_AT_name("eError")
    1553                            .dwattr $C$DW$59, DW_AT_const_value(0x0b)
    1554                            .dwattr $C$DW$59, DW_AT_decl_file("..\state_machine.h")
    1555                            .dwattr $C$DW$59, DW_AT_decl_line(0x20)
    1556                            .dwattr $C$DW$59, DW_AT_decl_column(0x05)
    1557                    
    1558                            .dwattr $C$DW$T$23, DW_AT_decl_file("..\state_machine.h")
    1559                            .dwattr $C$DW$T$23, DW_AT_decl_line(0x14)
    1560                            .dwattr $C$DW$T$23, DW_AT_decl_column(0x0e)
    1561                            .dwendtag $C$DW$T$23
    1562                    
    1563                    $C$DW$T$24      .dwtag  DW_TAG_typedef
    1564                            .dwattr $C$DW$T$24, DW_AT_name("event_t")
    1565                            .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$T$23)
    1566                            .dwattr $C$DW$T$24, DW_AT_language(DW_LANG_C)
    1567                            .dwattr $C$DW$T$24, DW_AT_decl_file("..\state_machine.h")
    1568                            .dwattr $C$DW$T$24, DW_AT_decl_line(0x21)
    1569                            .dwattr $C$DW$T$24, DW_AT_decl_column(0x03)
    1570                    
    1571                    
    1572                    $C$DW$T$28      .dwtag  DW_TAG_enumeration_type
    1573                            .dwattr $C$DW$T$28, DW_AT_byte_size(0x01)
TI ARM Assembler PC v18.12.2 Sat Dec 14 17:40:32 2019

Copyright (c) 1996-2018 Texas Instruments Incorporated
BL_Master.asm                                                        PAGE   30

    1574                    $C$DW$60        .dwtag  DW_TAG_enumerator
    1575                            .dwattr $C$DW$60, DW_AT_name("errNO_Error")
    1576                            .dwattr $C$DW$60, DW_AT_const_value(0x00)
    1577                            .dwattr $C$DW$60, DW_AT_decl_file("..\common.h")
    1578                            .dwattr $C$DW$60, DW_AT_decl_line(0x13)
    1579                            .dwattr $C$DW$60, DW_AT_decl_column(0x05)
    1580                    
    1581                    $C$DW$61        .dwtag  DW_TAG_enumerator
    1582                            .dwattr $C$DW$61, DW_AT_name("errSM_Error")
    1583                            .dwattr $C$DW$61, DW_AT_const_value(0x01)
    1584                            .dwattr $C$DW$61, DW_AT_decl_file("..\common.h")
    1585                            .dwattr $C$DW$61, DW_AT_decl_line(0x14)
    1586                            .dwattr $C$DW$61, DW_AT_decl_column(0x05)
    1587                    
    1588                    $C$DW$62        .dwtag  DW_TAG_enumerator
    1589                            .dwattr $C$DW$62, DW_AT_name("errDisconnect")
    1590                            .dwattr $C$DW$62, DW_AT_const_value(0x02)
    1591                            .dwattr $C$DW$62, DW_AT_decl_file("..\common.h")
    1592                            .dwattr $C$DW$62, DW_AT_decl_line(0x15)
    1593                            .dwattr $C$DW$62, DW_AT_decl_column(0x05)
    1594                    
    1595                            .dwattr $C$DW$T$28, DW_AT_decl_file("..\common.h")
    1596                            .dwattr $C$DW$T$28, DW_AT_decl_line(0x12)
    1597                            .dwattr $C$DW$T$28, DW_AT_decl_column(0x0e)
    1598                            .dwendtag $C$DW$T$28
    1599                    
    1600                    $C$DW$T$29      .dwtag  DW_TAG_typedef
    1601                            .dwattr $C$DW$T$29, DW_AT_name("error_t")
    1602                            .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$28)
    1603                            .dwattr $C$DW$T$29, DW_AT_language(DW_LANG_C)
    1604                            .dwattr $C$DW$T$29, DW_AT_decl_file("..\common.h")
    1605                            .dwattr $C$DW$T$29, DW_AT_decl_line(0x16)
    1606                            .dwattr $C$DW$T$29, DW_AT_decl_column(0x03)
    1607                    
    1608                    
    1609                    $C$DW$T$25      .dwtag  DW_TAG_structure_type
    1610                            .dwattr $C$DW$T$25, DW_AT_byte_size(0x02)
    1611                    $C$DW$63        .dwtag  DW_TAG_member
    1612                            .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$22)
    1613                            .dwattr $C$DW$63, DW_AT_name("state")
    1614                            .dwattr $C$DW$63, DW_AT_TI_symbol_name("state")
    1615                            .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1616                            .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
    1617                            .dwattr $C$DW$63, DW_AT_decl_file("..\state_machine.h")
    1618                            .dwattr $C$DW$63, DW_AT_decl_line(0x2f)
    1619                            .dwattr $C$DW$63, DW_AT_decl_column(0x0d)
    1620                    
    1621                    $C$DW$64        .dwtag  DW_TAG_member
    1622                            .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$24)
    1623                            .dwattr $C$DW$64, DW_AT_name("event")
    1624                            .dwattr $C$DW$64, DW_AT_TI_symbol_name("event")
    1625                            .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1626                            .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
    1627                            .dwattr $C$DW$64, DW_AT_decl_file("..\state_machine.h")
    1628                            .dwattr $C$DW$64, DW_AT_decl_line(0x30)
TI ARM Assembler PC v18.12.2 Sat Dec 14 17:40:32 2019

Copyright (c) 1996-2018 Texas Instruments Incorporated
BL_Master.asm                                                        PAGE   31

    1629                            .dwattr $C$DW$64, DW_AT_decl_column(0x0d)
    1630                    
    1631                            .dwattr $C$DW$T$25, DW_AT_decl_file("..\state_machine.h")
    1632                            .dwattr $C$DW$T$25, DW_AT_decl_line(0x2e)
    1633                            .dwattr $C$DW$T$25, DW_AT_decl_column(0x10)
    1634                            .dwendtag $C$DW$T$25
    1635                    
    1636                    $C$DW$T$195     .dwtag  DW_TAG_typedef
    1637                            .dwattr $C$DW$T$195, DW_AT_name("state_machine_t")
    1638                            .dwattr $C$DW$T$195, DW_AT_type(*$C$DW$T$25)
    1639                            .dwattr $C$DW$T$195, DW_AT_language(DW_LANG_C)
    1640                            .dwattr $C$DW$T$195, DW_AT_decl_file("..\state_machine.h")
    1641                            .dwattr $C$DW$T$195, DW_AT_decl_line(0x31)
    1642                            .dwattr $C$DW$T$195, DW_AT_decl_column(0x03)
    1643                    
    1644                    $C$DW$T$196     .dwtag  DW_TAG_pointer_type
    1645                            .dwattr $C$DW$T$196, DW_AT_type(*$C$DW$T$195)
    1646                            .dwattr $C$DW$T$196, DW_AT_address_class(0x20)
    1647                    
    1648                    
    1649                    $C$DW$T$30      .dwtag  DW_TAG_structure_type
    1650                            .dwattr $C$DW$T$30, DW_AT_byte_size(0x0b)
    1651                    $C$DW$65        .dwtag  DW_TAG_member
    1652                            .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$27)
    1653                            .dwattr $C$DW$65, DW_AT_name("reception_ready")
    1654                            .dwattr $C$DW$65, DW_AT_TI_symbol_name("reception_ready")
    1655                            .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1656                            .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
    1657                            .dwattr $C$DW$65, DW_AT_decl_file("..\common.h")
    1658                            .dwattr $C$DW$65, DW_AT_decl_line(0x1a)
    1659                            .dwattr $C$DW$65, DW_AT_decl_column(0x0d)
    1660                    
    1661                    $C$DW$66        .dwtag  DW_TAG_member
    1662                            .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$29)
    1663                            .dwattr $C$DW$66, DW_AT_name("error_flag")
    1664                            .dwattr $C$DW$66, DW_AT_TI_symbol_name("error_flag")
    1665                            .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1666                            .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
    1667                            .dwattr $C$DW$66, DW_AT_decl_file("..\common.h")
    1668                            .dwattr $C$DW$66, DW_AT_decl_line(0x1b)
    1669                            .dwattr $C$DW$66, DW_AT_decl_column(0x0d)
    1670                    
    1671                    $C$DW$67        .dwtag  DW_TAG_member
    1672                            .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$27)
    1673                            .dwattr $C$DW$67, DW_AT_name("button_pressed")
    1674                            .dwattr $C$DW$67, DW_AT_TI_symbol_name("button_pressed")
    1675                            .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1676                            .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
    1677                            .dwattr $C$DW$67, DW_AT_decl_file("..\common.h")
    1678                            .dwattr $C$DW$67, DW_AT_decl_line(0x1c)
    1679                            .dwattr $C$DW$67, DW_AT_decl_column(0x0d)
    1680                    
    1681                    $C$DW$68        .dwtag  DW_TAG_member
    1682                            .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$27)
    1683                            .dwattr $C$DW$68, DW_AT_name("PC_RX_Flag")
TI ARM Assembler PC v18.12.2 Sat Dec 14 17:40:32 2019

Copyright (c) 1996-2018 Texas Instruments Incorporated
BL_Master.asm                                                        PAGE   32

    1684                            .dwattr $C$DW$68, DW_AT_TI_symbol_name("PC_RX_Flag")
    1685                            .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1686                            .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
    1687                            .dwattr $C$DW$68, DW_AT_decl_file("..\common.h")
    1688                            .dwattr $C$DW$68, DW_AT_decl_line(0x1d)
    1689                            .dwattr $C$DW$68, DW_AT_decl_column(0x0d)
    1690                    
    1691                    $C$DW$69        .dwtag  DW_TAG_member
    1692                            .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$27)
    1693                            .dwattr $C$DW$69, DW_AT_name("Checksum_Failure")
    1694                            .dwattr $C$DW$69, DW_AT_TI_symbol_name("Checksum_Failure")
    1695                            .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1696                            .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
    1697                            .dwattr $C$DW$69, DW_AT_decl_file("..\common.h")
    1698                            .dwattr $C$DW$69, DW_AT_decl_line(0x1e)
    1699                            .dwattr $C$DW$69, DW_AT_decl_column(0x0d)
    1700                    
    1701                    $C$DW$70        .dwtag  DW_TAG_member
    1702                            .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$27)
    1703                            .dwattr $C$DW$70, DW_AT_name("CRC_Failure")
    1704                            .dwattr $C$DW$70, DW_AT_TI_symbol_name("CRC_Failure")
    1705                            .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1706                            .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
    1707                            .dwattr $C$DW$70, DW_AT_decl_file("..\common.h")
    1708                            .dwattr $C$DW$70, DW_AT_decl_line(0x1f)
    1709                            .dwattr $C$DW$70, DW_AT_decl_column(0x0d)
    1710                    
    1711                    $C$DW$71        .dwtag  DW_TAG_member
    1712                            .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$27)
    1713                            .dwattr $C$DW$71, DW_AT_name("RX_Complete")
    1714                            .dwattr $C$DW$71, DW_AT_TI_symbol_name("RX_Complete")
    1715                            .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1716                            .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
    1717                            .dwattr $C$DW$71, DW_AT_decl_file("..\common.h")
    1718                            .dwattr $C$DW$71, DW_AT_decl_line(0x20)
    1719                            .dwattr $C$DW$71, DW_AT_decl_column(0x0d)
    1720                    
    1721                    $C$DW$72        .dwtag  DW_TAG_member
    1722                            .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$27)
    1723                            .dwattr $C$DW$72, DW_AT_name("response")
    1724                            .dwattr $C$DW$72, DW_AT_TI_symbol_name("response")
    1725                            .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    1726                            .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
    1727                            .dwattr $C$DW$72, DW_AT_decl_file("..\common.h")
    1728                            .dwattr $C$DW$72, DW_AT_decl_line(0x21)
    1729                            .dwattr $C$DW$72, DW_AT_decl_column(0x0d)
    1730                    
    1731                    $C$DW$73        .dwtag  DW_TAG_member
    1732                            .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$27)
    1733                            .dwattr $C$DW$73, DW_AT_name("RX_Response")
    1734                            .dwattr $C$DW$73, DW_AT_TI_symbol_name("RX_Response")
    1735                            .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1736                            .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
    1737                            .dwattr $C$DW$73, DW_AT_decl_file("..\common.h")
    1738                            .dwattr $C$DW$73, DW_AT_decl_line(0x22)
TI ARM Assembler PC v18.12.2 Sat Dec 14 17:40:32 2019

Copyright (c) 1996-2018 Texas Instruments Incorporated
BL_Master.asm                                                        PAGE   33

    1739                            .dwattr $C$DW$73, DW_AT_decl_column(0x0d)
    1740                    
    1741                    $C$DW$74        .dwtag  DW_TAG_member
    1742                            .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$27)
    1743                            .dwattr $C$DW$74, DW_AT_name("TX_Flag")
    1744                            .dwattr $C$DW$74, DW_AT_TI_symbol_name("TX_Flag")
    1745                            .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    1746                            .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
    1747                            .dwattr $C$DW$74, DW_AT_decl_file("..\common.h")
    1748                            .dwattr $C$DW$74, DW_AT_decl_line(0x23)
    1749                            .dwattr $C$DW$74, DW_AT_decl_column(0x0d)
    1750                    
    1751                    $C$DW$75        .dwtag  DW_TAG_member
    1752                            .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$27)
    1753                            .dwattr $C$DW$75, DW_AT_name("All_Ok")
    1754                            .dwattr $C$DW$75, DW_AT_TI_symbol_name("All_Ok")
    1755                            .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1756                            .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
    1757                            .dwattr $C$DW$75, DW_AT_decl_file("..\common.h")
    1758                            .dwattr $C$DW$75, DW_AT_decl_line(0x24)
    1759                            .dwattr $C$DW$75, DW_AT_decl_column(0x0d)
    1760                    
    1761                            .dwattr $C$DW$T$30, DW_AT_decl_file("..\common.h")
    1762                            .dwattr $C$DW$T$30, DW_AT_decl_line(0x19)
    1763                            .dwattr $C$DW$T$30, DW_AT_decl_column(0x10)
    1764                            .dwendtag $C$DW$T$30
    1765                    
    1766                    $C$DW$T$199     .dwtag  DW_TAG_typedef
    1767                            .dwattr $C$DW$T$199, DW_AT_name("full_system_state_t")
    1768                            .dwattr $C$DW$T$199, DW_AT_type(*$C$DW$T$30)
    1769                            .dwattr $C$DW$T$199, DW_AT_language(DW_LANG_C)
    1770                            .dwattr $C$DW$T$199, DW_AT_decl_file("..\common.h")
    1771                            .dwattr $C$DW$T$199, DW_AT_decl_line(0x26)
    1772                            .dwattr $C$DW$T$199, DW_AT_decl_column(0x03)
    1773                    
    1774                    $C$DW$T$200     .dwtag  DW_TAG_pointer_type
    1775                            .dwattr $C$DW$T$200, DW_AT_type(*$C$DW$T$199)
    1776                            .dwattr $C$DW$T$200, DW_AT_address_class(0x20)
    1777                    
    1778                    
    1779                    $C$DW$T$35      .dwtag  DW_TAG_structure_type
    1780                            .dwattr $C$DW$T$35, DW_AT_byte_size(0x0e)
    1781                    $C$DW$76        .dwtag  DW_TAG_member
    1782                            .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$33)
    1783                            .dwattr $C$DW$76, DW_AT_name("RESERVED0")
    1784                            .dwattr $C$DW$76, DW_AT_TI_symbol_name("RESERVED0")
    1785                            .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1786                            .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
    1787                            .dwattr $C$DW$76, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices\
    1788                            .dwattr $C$DW$76, DW_AT_decl_line(0x523)
    1789                            .dwattr $C$DW$76, DW_AT_decl_column(0x11)
    1790                    
    1791                    $C$DW$77        .dwtag  DW_TAG_member
    1792                            .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$34)
    1793                            .dwattr $C$DW$77, DW_AT_name("CTL")
TI ARM Assembler PC v18.12.2 Sat Dec 14 17:40:32 2019

Copyright (c) 1996-2018 Texas Instruments Incorporated
BL_Master.asm                                                        PAGE   34

    1794                            .dwattr $C$DW$77, DW_AT_TI_symbol_name("CTL")
    1795                            .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1796                            .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
    1797                            .dwattr $C$DW$77, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices\
    1798                            .dwattr $C$DW$77, DW_AT_decl_line(0x524)
    1799                            .dwattr $C$DW$77, DW_AT_decl_column(0x11)
    1800                    
    1801                            .dwattr $C$DW$T$35, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\device
    1802                            .dwattr $C$DW$T$35, DW_AT_decl_line(0x522)
    1803                            .dwattr $C$DW$T$35, DW_AT_decl_column(0x10)
    1804                            .dwendtag $C$DW$T$35
    1805                    
    1806                    $C$DW$T$201     .dwtag  DW_TAG_typedef
    1807                            .dwattr $C$DW$T$201, DW_AT_name("WDT_A_Type")
    1808                            .dwattr $C$DW$T$201, DW_AT_type(*$C$DW$T$35)
    1809                            .dwattr $C$DW$T$201, DW_AT_language(DW_LANG_C)
    1810                            .dwattr $C$DW$T$201, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devic
    1811                            .dwattr $C$DW$T$201, DW_AT_decl_line(0x525)
    1812                            .dwattr $C$DW$T$201, DW_AT_decl_column(0x03)
    1813                    
    1814                    
    1815                    $C$DW$T$42      .dwtag  DW_TAG_structure_type
    1816                            .dwattr $C$DW$T$42, DW_AT_byte_size(0x68)
    1817                    $C$DW$78        .dwtag  DW_TAG_member
    1818                            .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$38)
    1819                            .dwattr $C$DW$78, DW_AT_name("KEY")
    1820                            .dwattr $C$DW$78, DW_AT_TI_symbol_name("KEY")
    1821                            .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1822                            .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
    1823                            .dwattr $C$DW$78, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices\
    1824                            .dwattr $C$DW$78, DW_AT_decl_line(0x1d9)
    1825                            .dwattr $C$DW$78, DW_AT_decl_column(0x11)
    1826                    
    1827                    $C$DW$79        .dwtag  DW_TAG_member
    1828                            .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$38)
    1829                            .dwattr $C$DW$79, DW_AT_name("CTL0")
    1830                            .dwattr $C$DW$79, DW_AT_TI_symbol_name("CTL0")
    1831                            .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1832                            .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
    1833                            .dwattr $C$DW$79, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices\
    1834                            .dwattr $C$DW$79, DW_AT_decl_line(0x1da)
    1835                            .dwattr $C$DW$79, DW_AT_decl_column(0x11)
    1836                    
    1837                    $C$DW$80        .dwtag  DW_TAG_member
    1838                            .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$38)
    1839                            .dwattr $C$DW$80, DW_AT_name("CTL1")
    1840                            .dwattr $C$DW$80, DW_AT_TI_symbol_name("CTL1")
    1841                            .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1842                            .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
    1843                            .dwattr $C$DW$80, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices\
    1844                            .dwattr $C$DW$80, DW_AT_decl_line(0x1db)
    1845                            .dwattr $C$DW$80, DW_AT_decl_column(0x11)
    1846                    
    1847                    $C$DW$81        .dwtag  DW_TAG_member
    1848                            .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$38)
TI ARM Assembler PC v18.12.2 Sat Dec 14 17:40:32 2019

Copyright (c) 1996-2018 Texas Instruments Incorporated
BL_Master.asm                                                        PAGE   35

    1849                            .dwattr $C$DW$81, DW_AT_name("CTL2")
    1850                            .dwattr $C$DW$81, DW_AT_TI_symbol_name("CTL2")
    1851                            .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1852                            .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
    1853                            .dwattr $C$DW$81, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices\
    1854                            .dwattr $C$DW$81, DW_AT_decl_line(0x1dc)
    1855                            .dwattr $C$DW$81, DW_AT_decl_column(0x11)
    1856                    
    1857                    $C$DW$82        .dwtag  DW_TAG_member
    1858                            .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$38)
    1859                            .dwattr $C$DW$82, DW_AT_name("CTL3")
    1860                            .dwattr $C$DW$82, DW_AT_TI_symbol_name("CTL3")
    1861                            .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1862                            .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
    1863                            .dwattr $C$DW$82, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices\
    1864                            .dwattr $C$DW$82, DW_AT_decl_line(0x1dd)
    1865                            .dwattr $C$DW$82, DW_AT_decl_column(0x11)
    1866                    
    1867                    $C$DW$83        .dwtag  DW_TAG_member
    1868                            .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$39)
    1869                            .dwattr $C$DW$83, DW_AT_name("RESERVED0")
    1870                            .dwattr $C$DW$83, DW_AT_TI_symbol_name("RESERVED0")
    1871                            .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1872                            .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    1873                            .dwattr $C$DW$83, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices\
    1874                            .dwattr $C$DW$83, DW_AT_decl_line(0x1de)
    1875                            .dwattr $C$DW$83, DW_AT_decl_column(0x11)
    1876                    
    1877                    $C$DW$84        .dwtag  DW_TAG_member
    1878                            .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$38)
    1879                            .dwattr $C$DW$84, DW_AT_name("CLKEN")
    1880                            .dwattr $C$DW$84, DW_AT_TI_symbol_name("CLKEN")
    1881                            .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    1882                            .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    1883                            .dwattr $C$DW$84, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices\
    1884                            .dwattr $C$DW$84, DW_AT_decl_line(0x1df)
    1885                            .dwattr $C$DW$84, DW_AT_decl_column(0x11)
    1886                    
    1887                    $C$DW$85        .dwtag  DW_TAG_member
    1888                            .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$40)
    1889                            .dwattr $C$DW$85, DW_AT_name("STAT")
    1890                            .dwattr $C$DW$85, DW_AT_TI_symbol_name("STAT")
    1891                            .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    1892                            .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    1893                            .dwattr $C$DW$85, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices\
    1894                            .dwattr $C$DW$85, DW_AT_decl_line(0x1e0)
    1895                            .dwattr $C$DW$85, DW_AT_decl_column(0x11)
    1896                    
    1897                    $C$DW$86        .dwtag  DW_TAG_member
    1898                            .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$41)
    1899                            .dwattr $C$DW$86, DW_AT_name("RESERVED1")
    1900                            .dwattr $C$DW$86, DW_AT_TI_symbol_name("RESERVED1")
    1901                            .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    1902                            .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1903                            .dwattr $C$DW$86, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices\
TI ARM Assembler PC v18.12.2 Sat Dec 14 17:40:32 2019

Copyright (c) 1996-2018 Texas Instruments Incorporated
BL_Master.asm                                                        PAGE   36

    1904                            .dwattr $C$DW$86, DW_AT_decl_line(0x1e1)
    1905                            .dwattr $C$DW$86, DW_AT_decl_column(0x11)
    1906                    
    1907                    $C$DW$87        .dwtag  DW_TAG_member
    1908                            .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$38)
    1909                            .dwattr $C$DW$87, DW_AT_name("IE")
    1910                            .dwattr $C$DW$87, DW_AT_TI_symbol_name("IE")
    1911                            .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    1912                            .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1913                            .dwattr $C$DW$87, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices\
    1914                            .dwattr $C$DW$87, DW_AT_decl_line(0x1e2)
    1915                            .dwattr $C$DW$87, DW_AT_decl_column(0x11)
    1916                    
    1917                    $C$DW$88        .dwtag  DW_TAG_member
    1918                            .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$37)
    1919                            .dwattr $C$DW$88, DW_AT_name("RESERVED2")
    1920                            .dwattr $C$DW$88, DW_AT_TI_symbol_name("RESERVED2")
    1921                            .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    1922                            .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1923                            .dwattr $C$DW$88, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices\
    1924                            .dwattr $C$DW$88, DW_AT_decl_line(0x1e3)
    1925                            .dwattr $C$DW$88, DW_AT_decl_column(0x11)
    1926                    
    1927                    $C$DW$89        .dwtag  DW_TAG_member
    1928                            .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$40)
    1929                            .dwattr $C$DW$89, DW_AT_name("IFG")
    1930                            .dwattr $C$DW$89, DW_AT_TI_symbol_name("IFG")
    1931                            .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    1932                            .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1933                            .dwattr $C$DW$89, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices\
    1934                            .dwattr $C$DW$89, DW_AT_decl_line(0x1e4)
    1935                            .dwattr $C$DW$89, DW_AT_decl_column(0x11)
    1936                    
    1937                    $C$DW$90        .dwtag  DW_TAG_member
    1938                            .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$37)
    1939                            .dwattr $C$DW$90, DW_AT_name("RESERVED3")
    1940                            .dwattr $C$DW$90, DW_AT_TI_symbol_name("RESERVED3")
    1941                            .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
    1942                            .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1943                            .dwattr $C$DW$90, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices\
    1944                            .dwattr $C$DW$90, DW_AT_decl_line(0x1e5)
    1945                            .dwattr $C$DW$90, DW_AT_decl_column(0x11)
    1946                    
    1947                    $C$DW$91        .dwtag  DW_TAG_member
    1948                            .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$38)
    1949                            .dwattr $C$DW$91, DW_AT_name("CLRIFG")
    1950                            .dwattr $C$DW$91, DW_AT_TI_symbol_name("CLRIFG")
    1951                            .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    1952                            .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1953                            .dwattr $C$DW$91, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices\
    1954                            .dwattr $C$DW$91, DW_AT_decl_line(0x1e6)
    1955                            .dwattr $C$DW$91, DW_AT_decl_column(0x11)
    1956                    
    1957                    $C$DW$92        .dwtag  DW_TAG_member
    1958                            .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$37)
TI ARM Assembler PC v18.12.2 Sat Dec 14 17:40:32 2019

Copyright (c) 1996-2018 Texas Instruments Incorporated
BL_Master.asm                                                        PAGE   37

    1959                            .dwattr $C$DW$92, DW_AT_name("RESERVED4")
    1960                            .dwattr $C$DW$92, DW_AT_TI_symbol_name("RESERVED4")
    1961                            .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
    1962                            .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1963                            .dwattr $C$DW$92, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices\
    1964                            .dwattr $C$DW$92, DW_AT_decl_line(0x1e7)
    1965                            .dwattr $C$DW$92, DW_AT_decl_column(0x11)
    1966                    
    1967                    $C$DW$93        .dwtag  DW_TAG_member
    1968                            .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$38)
    1969                            .dwattr $C$DW$93, DW_AT_name("SETIFG")
    1970                            .dwattr $C$DW$93, DW_AT_TI_symbol_name("SETIFG")
    1971                            .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    1972                            .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1973                            .dwattr $C$DW$93, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices\
    1974                            .dwattr $C$DW$93, DW_AT_decl_line(0x1e8)
    1975                            .dwattr $C$DW$93, DW_AT_decl_column(0x11)
    1976                    
    1977                    $C$DW$94        .dwtag  DW_TAG_member
    1978                            .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$37)
    1979                            .dwattr $C$DW$94, DW_AT_name("RESERVED5")
    1980                            .dwattr $C$DW$94, DW_AT_TI_symbol_name("RESERVED5")
    1981                            .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    1982                            .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1983                            .dwattr $C$DW$94, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices\
    1984                            .dwattr $C$DW$94, DW_AT_decl_line(0x1e9)
    1985                            .dwattr $C$DW$94, DW_AT_decl_column(0x11)
    1986                    
    1987                    $C$DW$95        .dwtag  DW_TAG_member
    1988                            .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$38)
    1989                            .dwattr $C$DW$95, DW_AT_name("DCOERCAL0")
    1990                            .dwattr $C$DW$95, DW_AT_TI_symbol_name("DCOERCAL0")
    1991                            .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    1992                            .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1993                            .dwattr $C$DW$95, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices\
    1994                            .dwattr $C$DW$95, DW_AT_decl_line(0x1ea)
    1995                            .dwattr $C$DW$95, DW_AT_decl_column(0x11)
    1996                    
    1997                    $C$DW$96        .dwtag  DW_TAG_member
    1998                            .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$38)
    1999                            .dwattr $C$DW$96, DW_AT_name("DCOERCAL1")
    2000                            .dwattr $C$DW$96, DW_AT_TI_symbol_name("DCOERCAL1")
    2001                            .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x64]
    2002                            .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    2003                            .dwattr $C$DW$96, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices\
    2004                            .dwattr $C$DW$96, DW_AT_decl_line(0x1eb)
    2005                            .dwattr $C$DW$96, DW_AT_decl_column(0x11)
    2006                    
    2007                            .dwattr $C$DW$T$42, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\device
    2008                            .dwattr $C$DW$T$42, DW_AT_decl_line(0x1d8)
    2009                            .dwattr $C$DW$T$42, DW_AT_decl_column(0x10)
    2010                            .dwendtag $C$DW$T$42
    2011                    
    2012                    $C$DW$T$203     .dwtag  DW_TAG_typedef
    2013                            .dwattr $C$DW$T$203, DW_AT_name("CS_Type")
TI ARM Assembler PC v18.12.2 Sat Dec 14 17:40:32 2019

Copyright (c) 1996-2018 Texas Instruments Incorporated
BL_Master.asm                                                        PAGE   38

    2014                            .dwattr $C$DW$T$203, DW_AT_type(*$C$DW$T$42)
    2015                            .dwattr $C$DW$T$203, DW_AT_language(DW_LANG_C)
    2016                            .dwattr $C$DW$T$203, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devic
    2017                            .dwattr $C$DW$T$203, DW_AT_decl_line(0x1ec)
    2018                            .dwattr $C$DW$T$203, DW_AT_decl_column(0x03)
    2019                    
    2020                    
    2021                    $C$DW$T$47      .dwtag  DW_TAG_structure_type
    2022                            .dwattr $C$DW$T$47, DW_AT_byte_size(0x1e)
    2023                    $C$DW$97        .dwtag  DW_TAG_member
    2024                            .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$43)
    2025                            .dwattr $C$DW$97, DW_AT_name("IN")
    2026                            .dwattr $C$DW$97, DW_AT_TI_symbol_name("IN")
    2027                            .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2028                            .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    2029                            .dwattr $C$DW$97, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices\
    2030                            .dwattr $C$DW$97, DW_AT_decl_line(0x288)
    2031                            .dwattr $C$DW$97, DW_AT_decl_column(0x0f)
    2032                    
    2033                    $C$DW$98        .dwtag  DW_TAG_member
    2034                            .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$27)
    2035                            .dwattr $C$DW$98, DW_AT_name("RESERVED0")
    2036                            .dwattr $C$DW$98, DW_AT_TI_symbol_name("RESERVED0")
    2037                            .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2038                            .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    2039                            .dwattr $C$DW$98, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices\
    2040                            .dwattr $C$DW$98, DW_AT_decl_line(0x289)
    2041                            .dwattr $C$DW$98, DW_AT_decl_column(0x0b)
    2042                    
    2043                    $C$DW$99        .dwtag  DW_TAG_member
    2044                            .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$44)
    2045                            .dwattr $C$DW$99, DW_AT_name("OUT")
    2046                            .dwattr $C$DW$99, DW_AT_TI_symbol_name("OUT")
    2047                            .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2048                            .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    2049                            .dwattr $C$DW$99, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices\
    2050                            .dwattr $C$DW$99, DW_AT_decl_line(0x28a)
    2051                            .dwattr $C$DW$99, DW_AT_decl_column(0x10)
    2052                    
    2053                    $C$DW$100       .dwtag  DW_TAG_member
    2054                            .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$27)
    2055                            .dwattr $C$DW$100, DW_AT_name("RESERVED1")
    2056                            .dwattr $C$DW$100, DW_AT_TI_symbol_name("RESERVED1")
    2057                            .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2058                            .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    2059                            .dwattr $C$DW$100, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices
    2060                            .dwattr $C$DW$100, DW_AT_decl_line(0x28b)
    2061                            .dwattr $C$DW$100, DW_AT_decl_column(0x0b)
    2062                    
    2063                    $C$DW$101       .dwtag  DW_TAG_member
    2064                            .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$44)
    2065                            .dwattr $C$DW$101, DW_AT_name("DIR")
    2066                            .dwattr $C$DW$101, DW_AT_TI_symbol_name("DIR")
    2067                            .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2068                            .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v18.12.2 Sat Dec 14 17:40:32 2019

Copyright (c) 1996-2018 Texas Instruments Incorporated
BL_Master.asm                                                        PAGE   39

    2069                            .dwattr $C$DW$101, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices
    2070                            .dwattr $C$DW$101, DW_AT_decl_line(0x28c)
    2071                            .dwattr $C$DW$101, DW_AT_decl_column(0x10)
    2072                    
    2073                    $C$DW$102       .dwtag  DW_TAG_member
    2074                            .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$27)
    2075                            .dwattr $C$DW$102, DW_AT_name("RESERVED2")
    2076                            .dwattr $C$DW$102, DW_AT_TI_symbol_name("RESERVED2")
    2077                            .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2078                            .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    2079                            .dwattr $C$DW$102, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices
    2080                            .dwattr $C$DW$102, DW_AT_decl_line(0x28d)
    2081                            .dwattr $C$DW$102, DW_AT_decl_column(0x0b)
    2082                    
    2083                    $C$DW$103       .dwtag  DW_TAG_member
    2084                            .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$44)
    2085                            .dwattr $C$DW$103, DW_AT_name("REN")
    2086                            .dwattr $C$DW$103, DW_AT_TI_symbol_name("REN")
    2087                            .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2088                            .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    2089                            .dwattr $C$DW$103, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices
    2090                            .dwattr $C$DW$103, DW_AT_decl_line(0x28e)
    2091                            .dwattr $C$DW$103, DW_AT_decl_column(0x10)
    2092                    
    2093                    $C$DW$104       .dwtag  DW_TAG_member
    2094                            .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$27)
    2095                            .dwattr $C$DW$104, DW_AT_name("RESERVED3")
    2096                            .dwattr $C$DW$104, DW_AT_TI_symbol_name("RESERVED3")
    2097                            .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    2098                            .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    2099                            .dwattr $C$DW$104, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices
    2100                            .dwattr $C$DW$104, DW_AT_decl_line(0x28f)
    2101                            .dwattr $C$DW$104, DW_AT_decl_column(0x0b)
    2102                    
    2103                    $C$DW$105       .dwtag  DW_TAG_member
    2104                            .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$44)
    2105                            .dwattr $C$DW$105, DW_AT_name("DS")
    2106                            .dwattr $C$DW$105, DW_AT_TI_symbol_name("DS")
    2107                            .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2108                            .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    2109                            .dwattr $C$DW$105, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices
    2110                            .dwattr $C$DW$105, DW_AT_decl_line(0x290)
    2111                            .dwattr $C$DW$105, DW_AT_decl_column(0x10)
    2112                    
    2113                    $C$DW$106       .dwtag  DW_TAG_member
    2114                            .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$27)
    2115                            .dwattr $C$DW$106, DW_AT_name("RESERVED4")
    2116                            .dwattr $C$DW$106, DW_AT_TI_symbol_name("RESERVED4")
    2117                            .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    2118                            .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    2119                            .dwattr $C$DW$106, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices
    2120                            .dwattr $C$DW$106, DW_AT_decl_line(0x291)
    2121                            .dwattr $C$DW$106, DW_AT_decl_column(0x0b)
    2122                    
    2123                    $C$DW$107       .dwtag  DW_TAG_member
TI ARM Assembler PC v18.12.2 Sat Dec 14 17:40:32 2019

Copyright (c) 1996-2018 Texas Instruments Incorporated
BL_Master.asm                                                        PAGE   40

    2124                            .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$44)
    2125                            .dwattr $C$DW$107, DW_AT_name("SEL0")
    2126                            .dwattr $C$DW$107, DW_AT_TI_symbol_name("SEL0")
    2127                            .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2128                            .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    2129                            .dwattr $C$DW$107, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices
    2130                            .dwattr $C$DW$107, DW_AT_decl_line(0x292)
    2131                            .dwattr $C$DW$107, DW_AT_decl_column(0x10)
    2132                    
    2133                    $C$DW$108       .dwtag  DW_TAG_member
    2134                            .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$27)
    2135                            .dwattr $C$DW$108, DW_AT_name("RESERVED5")
    2136                            .dwattr $C$DW$108, DW_AT_TI_symbol_name("RESERVED5")
    2137                            .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    2138                            .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    2139                            .dwattr $C$DW$108, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices
    2140                            .dwattr $C$DW$108, DW_AT_decl_line(0x293)
    2141                            .dwattr $C$DW$108, DW_AT_decl_column(0x0b)
    2142                    
    2143                    $C$DW$109       .dwtag  DW_TAG_member
    2144                            .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$44)
    2145                            .dwattr $C$DW$109, DW_AT_name("SEL1")
    2146                            .dwattr $C$DW$109, DW_AT_TI_symbol_name("SEL1")
    2147                            .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2148                            .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    2149                            .dwattr $C$DW$109, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices
    2150                            .dwattr $C$DW$109, DW_AT_decl_line(0x294)
    2151                            .dwattr $C$DW$109, DW_AT_decl_column(0x10)
    2152                    
    2153                    $C$DW$110       .dwtag  DW_TAG_member
    2154                            .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$27)
    2155                            .dwattr $C$DW$110, DW_AT_name("RESERVED6")
    2156                            .dwattr $C$DW$110, DW_AT_TI_symbol_name("RESERVED6")
    2157                            .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    2158                            .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    2159                            .dwattr $C$DW$110, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices
    2160                            .dwattr $C$DW$110, DW_AT_decl_line(0x295)
    2161                            .dwattr $C$DW$110, DW_AT_decl_column(0x0b)
    2162                    
    2163                    $C$DW$111       .dwtag  DW_TAG_member
    2164                            .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$45)
    2165                            .dwattr $C$DW$111, DW_AT_name("IV")
    2166                            .dwattr $C$DW$111, DW_AT_TI_symbol_name("IV")
    2167                            .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    2168                            .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    2169                            .dwattr $C$DW$111, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices
    2170                            .dwattr $C$DW$111, DW_AT_decl_line(0x296)
    2171                            .dwattr $C$DW$111, DW_AT_decl_column(0x11)
    2172                    
    2173                    $C$DW$112       .dwtag  DW_TAG_member
    2174                            .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$46)
    2175                            .dwattr $C$DW$112, DW_AT_name("RESERVED7")
    2176                            .dwattr $C$DW$112, DW_AT_TI_symbol_name("RESERVED7")
    2177                            .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2178                            .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v18.12.2 Sat Dec 14 17:40:32 2019

Copyright (c) 1996-2018 Texas Instruments Incorporated
BL_Master.asm                                                        PAGE   41

    2179                            .dwattr $C$DW$112, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices
    2180                            .dwattr $C$DW$112, DW_AT_decl_line(0x297)
    2181                            .dwattr $C$DW$112, DW_AT_decl_column(0x0b)
    2182                    
    2183                    $C$DW$113       .dwtag  DW_TAG_member
    2184                            .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$44)
    2185                            .dwattr $C$DW$113, DW_AT_name("SELC")
    2186                            .dwattr $C$DW$113, DW_AT_TI_symbol_name("SELC")
    2187                            .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    2188                            .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    2189                            .dwattr $C$DW$113, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices
    2190                            .dwattr $C$DW$113, DW_AT_decl_line(0x298)
    2191                            .dwattr $C$DW$113, DW_AT_decl_column(0x10)
    2192                    
    2193                    $C$DW$114       .dwtag  DW_TAG_member
    2194                            .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$27)
    2195                            .dwattr $C$DW$114, DW_AT_name("RESERVED8")
    2196                            .dwattr $C$DW$114, DW_AT_TI_symbol_name("RESERVED8")
    2197                            .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    2198                            .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    2199                            .dwattr $C$DW$114, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices
    2200                            .dwattr $C$DW$114, DW_AT_decl_line(0x299)
    2201                            .dwattr $C$DW$114, DW_AT_decl_column(0x0b)
    2202                    
    2203                    $C$DW$115       .dwtag  DW_TAG_member
    2204                            .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$44)
    2205                            .dwattr $C$DW$115, DW_AT_name("IES")
    2206                            .dwattr $C$DW$115, DW_AT_TI_symbol_name("IES")
    2207                            .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2208                            .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    2209                            .dwattr $C$DW$115, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices
    2210                            .dwattr $C$DW$115, DW_AT_decl_line(0x29a)
    2211                            .dwattr $C$DW$115, DW_AT_decl_column(0x10)
    2212                    
    2213                    $C$DW$116       .dwtag  DW_TAG_member
    2214                            .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$27)
    2215                            .dwattr $C$DW$116, DW_AT_name("RESERVED9")
    2216                            .dwattr $C$DW$116, DW_AT_TI_symbol_name("RESERVED9")
    2217                            .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    2218                            .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    2219                            .dwattr $C$DW$116, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices
    2220                            .dwattr $C$DW$116, DW_AT_decl_line(0x29b)
    2221                            .dwattr $C$DW$116, DW_AT_decl_column(0x0b)
    2222                    
    2223                    $C$DW$117       .dwtag  DW_TAG_member
    2224                            .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$44)
    2225                            .dwattr $C$DW$117, DW_AT_name("IE")
    2226                            .dwattr $C$DW$117, DW_AT_TI_symbol_name("IE")
    2227                            .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    2228                            .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    2229                            .dwattr $C$DW$117, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices
    2230                            .dwattr $C$DW$117, DW_AT_decl_line(0x29c)
    2231                            .dwattr $C$DW$117, DW_AT_decl_column(0x10)
    2232                    
    2233                    $C$DW$118       .dwtag  DW_TAG_member
TI ARM Assembler PC v18.12.2 Sat Dec 14 17:40:32 2019

Copyright (c) 1996-2018 Texas Instruments Incorporated
BL_Master.asm                                                        PAGE   42

    2234                            .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$27)
    2235                            .dwattr $C$DW$118, DW_AT_name("RESERVED10")
    2236                            .dwattr $C$DW$118, DW_AT_TI_symbol_name("RESERVED10")
    2237                            .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    2238                            .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    2239                            .dwattr $C$DW$118, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices
    2240                            .dwattr $C$DW$118, DW_AT_decl_line(0x29d)
    2241                            .dwattr $C$DW$118, DW_AT_decl_column(0x0b)
    2242                    
    2243                    $C$DW$119       .dwtag  DW_TAG_member
    2244                            .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$44)
    2245                            .dwattr $C$DW$119, DW_AT_name("IFG")
    2246                            .dwattr $C$DW$119, DW_AT_TI_symbol_name("IFG")
    2247                            .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    2248                            .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    2249                            .dwattr $C$DW$119, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices
    2250                            .dwattr $C$DW$119, DW_AT_decl_line(0x29e)
    2251                            .dwattr $C$DW$119, DW_AT_decl_column(0x10)
    2252                    
    2253                    $C$DW$120       .dwtag  DW_TAG_member
    2254                            .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$27)
    2255                            .dwattr $C$DW$120, DW_AT_name("RESERVED11")
    2256                            .dwattr $C$DW$120, DW_AT_TI_symbol_name("RESERVED11")
    2257                            .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    2258                            .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    2259                            .dwattr $C$DW$120, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices
    2260                            .dwattr $C$DW$120, DW_AT_decl_line(0x29f)
    2261                            .dwattr $C$DW$120, DW_AT_decl_column(0x0b)
    2262                    
    2263                            .dwattr $C$DW$T$47, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\device
    2264                            .dwattr $C$DW$T$47, DW_AT_decl_line(0x287)
    2265                            .dwattr $C$DW$T$47, DW_AT_decl_column(0x10)
    2266                            .dwendtag $C$DW$T$47
    2267                    
    2268                    $C$DW$T$205     .dwtag  DW_TAG_typedef
    2269                            .dwattr $C$DW$T$205, DW_AT_name("DIO_PORT_Odd_Interruptable_Type")
    2270                            .dwattr $C$DW$T$205, DW_AT_type(*$C$DW$T$47)
    2271                            .dwattr $C$DW$T$205, DW_AT_language(DW_LANG_C)
    2272                            .dwattr $C$DW$T$205, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devic
    2273                            .dwattr $C$DW$T$205, DW_AT_decl_line(0x2a0)
    2274                            .dwattr $C$DW$T$205, DW_AT_decl_column(0x03)
    2275                    
    2276                    
    2277                    $C$DW$T$49      .dwtag  DW_TAG_structure_type
    2278                            .dwattr $C$DW$T$49, DW_AT_byte_size(0x20)
    2279                    $C$DW$121       .dwtag  DW_TAG_member
    2280                            .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$27)
    2281                            .dwattr $C$DW$121, DW_AT_name("RESERVED0")
    2282                            .dwattr $C$DW$121, DW_AT_TI_symbol_name("RESERVED0")
    2283                            .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2284                            .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    2285                            .dwattr $C$DW$121, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices
    2286                            .dwattr $C$DW$121, DW_AT_decl_line(0x2a3)
    2287                            .dwattr $C$DW$121, DW_AT_decl_column(0x0b)
    2288                    
TI ARM Assembler PC v18.12.2 Sat Dec 14 17:40:32 2019

Copyright (c) 1996-2018 Texas Instruments Incorporated
BL_Master.asm                                                        PAGE   43

    2289                    $C$DW$122       .dwtag  DW_TAG_member
    2290                            .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$43)
    2291                            .dwattr $C$DW$122, DW_AT_name("IN")
    2292                            .dwattr $C$DW$122, DW_AT_TI_symbol_name("IN")
    2293                            .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2294                            .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    2295                            .dwattr $C$DW$122, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices
    2296                            .dwattr $C$DW$122, DW_AT_decl_line(0x2a4)
    2297                            .dwattr $C$DW$122, DW_AT_decl_column(0x0f)
    2298                    
    2299                    $C$DW$123       .dwtag  DW_TAG_member
    2300                            .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$27)
    2301                            .dwattr $C$DW$123, DW_AT_name("RESERVED1")
    2302                            .dwattr $C$DW$123, DW_AT_TI_symbol_name("RESERVED1")
    2303                            .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2304                            .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    2305                            .dwattr $C$DW$123, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices
    2306                            .dwattr $C$DW$123, DW_AT_decl_line(0x2a5)
    2307                            .dwattr $C$DW$123, DW_AT_decl_column(0x0b)
    2308                    
    2309                    $C$DW$124       .dwtag  DW_TAG_member
    2310                            .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$44)
    2311                            .dwattr $C$DW$124, DW_AT_name("OUT")
    2312                            .dwattr $C$DW$124, DW_AT_TI_symbol_name("OUT")
    2313                            .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2314                            .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    2315                            .dwattr $C$DW$124, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices
    2316                            .dwattr $C$DW$124, DW_AT_decl_line(0x2a6)
    2317                            .dwattr $C$DW$124, DW_AT_decl_column(0x10)
    2318                    
    2319                    $C$DW$125       .dwtag  DW_TAG_member
    2320                            .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$27)
    2321                            .dwattr $C$DW$125, DW_AT_name("RESERVED2")
    2322                            .dwattr $C$DW$125, DW_AT_TI_symbol_name("RESERVED2")
    2323                            .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2324                            .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    2325                            .dwattr $C$DW$125, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices
    2326                            .dwattr $C$DW$125, DW_AT_decl_line(0x2a7)
    2327                            .dwattr $C$DW$125, DW_AT_decl_column(0x0b)
    2328                    
    2329                    $C$DW$126       .dwtag  DW_TAG_member
    2330                            .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$44)
    2331                            .dwattr $C$DW$126, DW_AT_name("DIR")
    2332                            .dwattr $C$DW$126, DW_AT_TI_symbol_name("DIR")
    2333                            .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2334                            .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    2335                            .dwattr $C$DW$126, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices
    2336                            .dwattr $C$DW$126, DW_AT_decl_line(0x2a8)
    2337                            .dwattr $C$DW$126, DW_AT_decl_column(0x10)
    2338                    
    2339                    $C$DW$127       .dwtag  DW_TAG_member
    2340                            .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$27)
    2341                            .dwattr $C$DW$127, DW_AT_name("RESERVED3")
    2342                            .dwattr $C$DW$127, DW_AT_TI_symbol_name("RESERVED3")
    2343                            .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
TI ARM Assembler PC v18.12.2 Sat Dec 14 17:40:32 2019

Copyright (c) 1996-2018 Texas Instruments Incorporated
BL_Master.asm                                                        PAGE   44

    2344                            .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    2345                            .dwattr $C$DW$127, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices
    2346                            .dwattr $C$DW$127, DW_AT_decl_line(0x2a9)
    2347                            .dwattr $C$DW$127, DW_AT_decl_column(0x0b)
    2348                    
    2349                    $C$DW$128       .dwtag  DW_TAG_member
    2350                            .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$44)
    2351                            .dwattr $C$DW$128, DW_AT_name("REN")
    2352                            .dwattr $C$DW$128, DW_AT_TI_symbol_name("REN")
    2353                            .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    2354                            .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    2355                            .dwattr $C$DW$128, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices
    2356                            .dwattr $C$DW$128, DW_AT_decl_line(0x2aa)
    2357                            .dwattr $C$DW$128, DW_AT_decl_column(0x10)
    2358                    
    2359                    $C$DW$129       .dwtag  DW_TAG_member
    2360                            .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$27)
    2361                            .dwattr $C$DW$129, DW_AT_name("RESERVED4")
    2362                            .dwattr $C$DW$129, DW_AT_TI_symbol_name("RESERVED4")
    2363                            .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2364                            .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    2365                            .dwattr $C$DW$129, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices
    2366                            .dwattr $C$DW$129, DW_AT_decl_line(0x2ab)
    2367                            .dwattr $C$DW$129, DW_AT_decl_column(0x0b)
    2368                    
    2369                    $C$DW$130       .dwtag  DW_TAG_member
    2370                            .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$44)
    2371                            .dwattr $C$DW$130, DW_AT_name("DS")
    2372                            .dwattr $C$DW$130, DW_AT_TI_symbol_name("DS")
    2373                            .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    2374                            .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    2375                            .dwattr $C$DW$130, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices
    2376                            .dwattr $C$DW$130, DW_AT_decl_line(0x2ac)
    2377                            .dwattr $C$DW$130, DW_AT_decl_column(0x10)
    2378                    
    2379                    $C$DW$131       .dwtag  DW_TAG_member
    2380                            .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$27)
    2381                            .dwattr $C$DW$131, DW_AT_name("RESERVED5")
    2382                            .dwattr $C$DW$131, DW_AT_TI_symbol_name("RESERVED5")
    2383                            .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2384                            .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    2385                            .dwattr $C$DW$131, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices
    2386                            .dwattr $C$DW$131, DW_AT_decl_line(0x2ad)
    2387                            .dwattr $C$DW$131, DW_AT_decl_column(0x0b)
    2388                    
    2389                    $C$DW$132       .dwtag  DW_TAG_member
    2390                            .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$44)
    2391                            .dwattr $C$DW$132, DW_AT_name("SEL0")
    2392                            .dwattr $C$DW$132, DW_AT_TI_symbol_name("SEL0")
    2393                            .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    2394                            .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    2395                            .dwattr $C$DW$132, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices
    2396                            .dwattr $C$DW$132, DW_AT_decl_line(0x2ae)
    2397                            .dwattr $C$DW$132, DW_AT_decl_column(0x10)
    2398                    
TI ARM Assembler PC v18.12.2 Sat Dec 14 17:40:32 2019

Copyright (c) 1996-2018 Texas Instruments Incorporated
BL_Master.asm                                                        PAGE   45

    2399                    $C$DW$133       .dwtag  DW_TAG_member
    2400                            .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$27)
    2401                            .dwattr $C$DW$133, DW_AT_name("RESERVED6")
    2402                            .dwattr $C$DW$133, DW_AT_TI_symbol_name("RESERVED6")
    2403                            .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2404                            .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    2405                            .dwattr $C$DW$133, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices
    2406                            .dwattr $C$DW$133, DW_AT_decl_line(0x2af)
    2407                            .dwattr $C$DW$133, DW_AT_decl_column(0x0b)
    2408                    
    2409                    $C$DW$134       .dwtag  DW_TAG_member
    2410                            .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$44)
    2411                            .dwattr $C$DW$134, DW_AT_name("SEL1")
    2412                            .dwattr $C$DW$134, DW_AT_TI_symbol_name("SEL1")
    2413                            .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    2414                            .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    2415                            .dwattr $C$DW$134, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices
    2416                            .dwattr $C$DW$134, DW_AT_decl_line(0x2b0)
    2417                            .dwattr $C$DW$134, DW_AT_decl_column(0x10)
    2418                    
    2419                    $C$DW$135       .dwtag  DW_TAG_member
    2420                            .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$48)
    2421                            .dwattr $C$DW$135, DW_AT_name("RESERVED7")
    2422                            .dwattr $C$DW$135, DW_AT_TI_symbol_name("RESERVED7")
    2423                            .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    2424                            .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    2425                            .dwattr $C$DW$135, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices
    2426                            .dwattr $C$DW$135, DW_AT_decl_line(0x2b1)
    2427                            .dwattr $C$DW$135, DW_AT_decl_column(0x0b)
    2428                    
    2429                    $C$DW$136       .dwtag  DW_TAG_member
    2430                            .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$44)
    2431                            .dwattr $C$DW$136, DW_AT_name("SELC")
    2432                            .dwattr $C$DW$136, DW_AT_TI_symbol_name("SELC")
    2433                            .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    2434                            .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    2435                            .dwattr $C$DW$136, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices
    2436                            .dwattr $C$DW$136, DW_AT_decl_line(0x2b2)
    2437                            .dwattr $C$DW$136, DW_AT_decl_column(0x10)
    2438                    
    2439                    $C$DW$137       .dwtag  DW_TAG_member
    2440                            .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$27)
    2441                            .dwattr $C$DW$137, DW_AT_name("RESERVED8")
    2442                            .dwattr $C$DW$137, DW_AT_TI_symbol_name("RESERVED8")
    2443                            .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2444                            .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    2445                            .dwattr $C$DW$137, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices
    2446                            .dwattr $C$DW$137, DW_AT_decl_line(0x2b3)
    2447                            .dwattr $C$DW$137, DW_AT_decl_column(0x0b)
    2448                    
    2449                    $C$DW$138       .dwtag  DW_TAG_member
    2450                            .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$44)
    2451                            .dwattr $C$DW$138, DW_AT_name("IES")
    2452                            .dwattr $C$DW$138, DW_AT_TI_symbol_name("IES")
    2453                            .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
TI ARM Assembler PC v18.12.2 Sat Dec 14 17:40:32 2019

Copyright (c) 1996-2018 Texas Instruments Incorporated
BL_Master.asm                                                        PAGE   46

    2454                            .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    2455                            .dwattr $C$DW$138, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices
    2456                            .dwattr $C$DW$138, DW_AT_decl_line(0x2b4)
    2457                            .dwattr $C$DW$138, DW_AT_decl_column(0x10)
    2458                    
    2459                    $C$DW$139       .dwtag  DW_TAG_member
    2460                            .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$27)
    2461                            .dwattr $C$DW$139, DW_AT_name("RESERVED9")
    2462                            .dwattr $C$DW$139, DW_AT_TI_symbol_name("RESERVED9")
    2463                            .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    2464                            .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    2465                            .dwattr $C$DW$139, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices
    2466                            .dwattr $C$DW$139, DW_AT_decl_line(0x2b5)
    2467                            .dwattr $C$DW$139, DW_AT_decl_column(0x0b)
    2468                    
    2469                    $C$DW$140       .dwtag  DW_TAG_member
    2470                            .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$44)
    2471                            .dwattr $C$DW$140, DW_AT_name("IE")
    2472                            .dwattr $C$DW$140, DW_AT_TI_symbol_name("IE")
    2473                            .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    2474                            .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    2475                            .dwattr $C$DW$140, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices
    2476                            .dwattr $C$DW$140, DW_AT_decl_line(0x2b6)
    2477                            .dwattr $C$DW$140, DW_AT_decl_column(0x10)
    2478                    
    2479                    $C$DW$141       .dwtag  DW_TAG_member
    2480                            .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$27)
    2481                            .dwattr $C$DW$141, DW_AT_name("RESERVED10")
    2482                            .dwattr $C$DW$141, DW_AT_TI_symbol_name("RESERVED10")
    2483                            .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    2484                            .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    2485                            .dwattr $C$DW$141, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices
    2486                            .dwattr $C$DW$141, DW_AT_decl_line(0x2b7)
    2487                            .dwattr $C$DW$141, DW_AT_decl_column(0x0b)
    2488                    
    2489                    $C$DW$142       .dwtag  DW_TAG_member
    2490                            .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$44)
    2491                            .dwattr $C$DW$142, DW_AT_name("IFG")
    2492                            .dwattr $C$DW$142, DW_AT_TI_symbol_name("IFG")
    2493                            .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    2494                            .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    2495                            .dwattr $C$DW$142, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices
    2496                            .dwattr $C$DW$142, DW_AT_decl_line(0x2b8)
    2497                            .dwattr $C$DW$142, DW_AT_decl_column(0x10)
    2498                    
    2499                    $C$DW$143       .dwtag  DW_TAG_member
    2500                            .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$45)
    2501                            .dwattr $C$DW$143, DW_AT_name("IV")
    2502                            .dwattr $C$DW$143, DW_AT_TI_symbol_name("IV")
    2503                            .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    2504                            .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    2505                            .dwattr $C$DW$143, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices
    2506                            .dwattr $C$DW$143, DW_AT_decl_line(0x2b9)
    2507                            .dwattr $C$DW$143, DW_AT_decl_column(0x10)
    2508                    
TI ARM Assembler PC v18.12.2 Sat Dec 14 17:40:32 2019

Copyright (c) 1996-2018 Texas Instruments Incorporated
BL_Master.asm                                                        PAGE   47

    2509                            .dwattr $C$DW$T$49, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\device
    2510                            .dwattr $C$DW$T$49, DW_AT_decl_line(0x2a2)
    2511                            .dwattr $C$DW$T$49, DW_AT_decl_column(0x10)
    2512                            .dwendtag $C$DW$T$49
    2513                    
    2514                    $C$DW$T$207     .dwtag  DW_TAG_typedef
    2515                            .dwattr $C$DW$T$207, DW_AT_name("DIO_PORT_Even_Interruptable_Type")
    2516                            .dwattr $C$DW$T$207, DW_AT_type(*$C$DW$T$49)
    2517                            .dwattr $C$DW$T$207, DW_AT_language(DW_LANG_C)
    2518                            .dwattr $C$DW$T$207, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devic
    2519                            .dwattr $C$DW$T$207, DW_AT_decl_line(0x2ba)
    2520                            .dwattr $C$DW$T$207, DW_AT_decl_column(0x03)
    2521                    
    2522                    
    2523                    $C$DW$T$55      .dwtag  DW_TAG_structure_type
    2524                            .dwattr $C$DW$T$55, DW_AT_byte_size(0xe04)
    2525                    $C$DW$144       .dwtag  DW_TAG_member
    2526                            .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$50)
    2527                            .dwattr $C$DW$144, DW_AT_name("ISER")
    2528                            .dwattr $C$DW$144, DW_AT_TI_symbol_name("ISER")
    2529                            .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2530                            .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    2531                            .dwattr $C$DW$144, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_part
    2532                            .dwattr $C$DW$144, DW_AT_decl_line(0x198)
    2533                            .dwattr $C$DW$144, DW_AT_decl_column(0x12)
    2534                    
    2535                    $C$DW$145       .dwtag  DW_TAG_member
    2536                            .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$51)
    2537                            .dwattr $C$DW$145, DW_AT_name("RESERVED0")
    2538                            .dwattr $C$DW$145, DW_AT_TI_symbol_name("RESERVED0")
    2539                            .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    2540                            .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    2541                            .dwattr $C$DW$145, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_part
    2542                            .dwattr $C$DW$145, DW_AT_decl_line(0x199)
    2543                            .dwattr $C$DW$145, DW_AT_decl_column(0x12)
    2544                    
    2545                    $C$DW$146       .dwtag  DW_TAG_member
    2546                            .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$50)
    2547                            .dwattr $C$DW$146, DW_AT_name("ICER")
    2548                            .dwattr $C$DW$146, DW_AT_TI_symbol_name("ICER")
    2549                            .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x80]
    2550                            .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    2551                            .dwattr $C$DW$146, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_part
    2552                            .dwattr $C$DW$146, DW_AT_decl_line(0x19a)
    2553                            .dwattr $C$DW$146, DW_AT_decl_column(0x12)
    2554                    
    2555                    $C$DW$147       .dwtag  DW_TAG_member
    2556                            .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$51)
    2557                            .dwattr $C$DW$147, DW_AT_name("RESERVED1")
    2558                            .dwattr $C$DW$147, DW_AT_TI_symbol_name("RESERVED1")
    2559                            .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    2560                            .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    2561                            .dwattr $C$DW$147, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_part
    2562                            .dwattr $C$DW$147, DW_AT_decl_line(0x19b)
    2563                            .dwattr $C$DW$147, DW_AT_decl_column(0x12)
TI ARM Assembler PC v18.12.2 Sat Dec 14 17:40:32 2019

Copyright (c) 1996-2018 Texas Instruments Incorporated
BL_Master.asm                                                        PAGE   48

    2564                    
    2565                    $C$DW$148       .dwtag  DW_TAG_member
    2566                            .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$50)
    2567                            .dwattr $C$DW$148, DW_AT_name("ISPR")
    2568                            .dwattr $C$DW$148, DW_AT_TI_symbol_name("ISPR")
    2569                            .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x100]
    2570                            .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    2571                            .dwattr $C$DW$148, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_part
    2572                            .dwattr $C$DW$148, DW_AT_decl_line(0x19c)
    2573                            .dwattr $C$DW$148, DW_AT_decl_column(0x12)
    2574                    
    2575                    $C$DW$149       .dwtag  DW_TAG_member
    2576                            .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$51)
    2577                            .dwattr $C$DW$149, DW_AT_name("RESERVED2")
    2578                            .dwattr $C$DW$149, DW_AT_TI_symbol_name("RESERVED2")
    2579                            .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x120]
    2580                            .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    2581                            .dwattr $C$DW$149, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_part
    2582                            .dwattr $C$DW$149, DW_AT_decl_line(0x19d)
    2583                            .dwattr $C$DW$149, DW_AT_decl_column(0x12)
    2584                    
    2585                    $C$DW$150       .dwtag  DW_TAG_member
    2586                            .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$50)
    2587                            .dwattr $C$DW$150, DW_AT_name("ICPR")
    2588                            .dwattr $C$DW$150, DW_AT_TI_symbol_name("ICPR")
    2589                            .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x180]
    2590                            .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    2591                            .dwattr $C$DW$150, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_part
    2592                            .dwattr $C$DW$150, DW_AT_decl_line(0x19e)
    2593                            .dwattr $C$DW$150, DW_AT_decl_column(0x12)
    2594                    
    2595                    $C$DW$151       .dwtag  DW_TAG_member
    2596                            .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$51)
    2597                            .dwattr $C$DW$151, DW_AT_name("RESERVED3")
    2598                            .dwattr $C$DW$151, DW_AT_TI_symbol_name("RESERVED3")
    2599                            .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a0]
    2600                            .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    2601                            .dwattr $C$DW$151, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_part
    2602                            .dwattr $C$DW$151, DW_AT_decl_line(0x19f)
    2603                            .dwattr $C$DW$151, DW_AT_decl_column(0x12)
    2604                    
    2605                    $C$DW$152       .dwtag  DW_TAG_member
    2606                            .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$50)
    2607                            .dwattr $C$DW$152, DW_AT_name("IABR")
    2608                            .dwattr $C$DW$152, DW_AT_TI_symbol_name("IABR")
    2609                            .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x200]
    2610                            .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    2611                            .dwattr $C$DW$152, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_part
    2612                            .dwattr $C$DW$152, DW_AT_decl_line(0x1a0)
    2613                            .dwattr $C$DW$152, DW_AT_decl_column(0x12)
    2614                    
    2615                    $C$DW$153       .dwtag  DW_TAG_member
    2616                            .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$52)
    2617                            .dwattr $C$DW$153, DW_AT_name("RESERVED4")
    2618                            .dwattr $C$DW$153, DW_AT_TI_symbol_name("RESERVED4")
TI ARM Assembler PC v18.12.2 Sat Dec 14 17:40:32 2019

Copyright (c) 1996-2018 Texas Instruments Incorporated
BL_Master.asm                                                        PAGE   49

    2619                            .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x220]
    2620                            .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    2621                            .dwattr $C$DW$153, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_part
    2622                            .dwattr $C$DW$153, DW_AT_decl_line(0x1a1)
    2623                            .dwattr $C$DW$153, DW_AT_decl_column(0x12)
    2624                    
    2625                    $C$DW$154       .dwtag  DW_TAG_member
    2626                            .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$53)
    2627                            .dwattr $C$DW$154, DW_AT_name("IP")
    2628                            .dwattr $C$DW$154, DW_AT_TI_symbol_name("IP")
    2629                            .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x300]
    2630                            .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    2631                            .dwattr $C$DW$154, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_part
    2632                            .dwattr $C$DW$154, DW_AT_decl_line(0x1a2)
    2633                            .dwattr $C$DW$154, DW_AT_decl_column(0x12)
    2634                    
    2635                    $C$DW$155       .dwtag  DW_TAG_member
    2636                            .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$54)
    2637                            .dwattr $C$DW$155, DW_AT_name("RESERVED5")
    2638                            .dwattr $C$DW$155, DW_AT_TI_symbol_name("RESERVED5")
    2639                            .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x3f0]
    2640                            .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    2641                            .dwattr $C$DW$155, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_part
    2642                            .dwattr $C$DW$155, DW_AT_decl_line(0x1a3)
    2643                            .dwattr $C$DW$155, DW_AT_decl_column(0x12)
    2644                    
    2645                    $C$DW$156       .dwtag  DW_TAG_member
    2646                            .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$38)
    2647                            .dwattr $C$DW$156, DW_AT_name("STIR")
    2648                            .dwattr $C$DW$156, DW_AT_TI_symbol_name("STIR")
    2649                            .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0xe00]
    2650                            .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    2651                            .dwattr $C$DW$156, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_part
    2652                            .dwattr $C$DW$156, DW_AT_decl_line(0x1a4)
    2653                            .dwattr $C$DW$156, DW_AT_decl_column(0x12)
    2654                    
    2655                            .dwattr $C$DW$T$55, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_par
    2656                            .dwattr $C$DW$T$55, DW_AT_decl_line(0x197)
    2657                            .dwattr $C$DW$T$55, DW_AT_decl_column(0x01)
    2658                            .dwendtag $C$DW$T$55
    2659                    
    2660                    $C$DW$T$209     .dwtag  DW_TAG_typedef
    2661                            .dwattr $C$DW$T$209, DW_AT_name("NVIC_Type")
    2662                            .dwattr $C$DW$T$209, DW_AT_type(*$C$DW$T$55)
    2663                            .dwattr $C$DW$T$209, DW_AT_language(DW_LANG_C)
    2664                            .dwattr $C$DW$T$209, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_pa
    2665                            .dwattr $C$DW$T$209, DW_AT_decl_line(0x1a5)
    2666                            .dwattr $C$DW$T$209, DW_AT_decl_column(0x04)
    2667                    
    2668                    
    2669                    $C$DW$T$57      .dwtag  DW_TAG_structure_type
    2670                            .dwattr $C$DW$T$57, DW_AT_byte_size(0x20)
    2671                    $C$DW$157       .dwtag  DW_TAG_member
    2672                            .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$34)
    2673                            .dwattr $C$DW$157, DW_AT_name("CTLW0")
TI ARM Assembler PC v18.12.2 Sat Dec 14 17:40:32 2019

Copyright (c) 1996-2018 Texas Instruments Incorporated
BL_Master.asm                                                        PAGE   50

    2674                            .dwattr $C$DW$157, DW_AT_TI_symbol_name("CTLW0")
    2675                            .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2676                            .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    2677                            .dwattr $C$DW$157, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices
    2678                            .dwattr $C$DW$157, DW_AT_decl_line(0x2f2)
    2679                            .dwattr $C$DW$157, DW_AT_decl_column(0x11)
    2680                    
    2681                    $C$DW$158       .dwtag  DW_TAG_member
    2682                            .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$34)
    2683                            .dwattr $C$DW$158, DW_AT_name("CTLW1")
    2684                            .dwattr $C$DW$158, DW_AT_TI_symbol_name("CTLW1")
    2685                            .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2686                            .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    2687                            .dwattr $C$DW$158, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices
    2688                            .dwattr $C$DW$158, DW_AT_decl_line(0x2f3)
    2689                            .dwattr $C$DW$158, DW_AT_decl_column(0x11)
    2690                    
    2691                    $C$DW$159       .dwtag  DW_TAG_member
    2692                            .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$32)
    2693                            .dwattr $C$DW$159, DW_AT_name("RESERVED0")
    2694                            .dwattr $C$DW$159, DW_AT_TI_symbol_name("RESERVED0")
    2695                            .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2696                            .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    2697                            .dwattr $C$DW$159, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices
    2698                            .dwattr $C$DW$159, DW_AT_decl_line(0x2f4)
    2699                            .dwattr $C$DW$159, DW_AT_decl_column(0x11)
    2700                    
    2701                    $C$DW$160       .dwtag  DW_TAG_member
    2702                            .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$34)
    2703                            .dwattr $C$DW$160, DW_AT_name("BRW")
    2704                            .dwattr $C$DW$160, DW_AT_TI_symbol_name("BRW")
    2705                            .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2706                            .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    2707                            .dwattr $C$DW$160, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices
    2708                            .dwattr $C$DW$160, DW_AT_decl_line(0x2f5)
    2709                            .dwattr $C$DW$160, DW_AT_decl_column(0x11)
    2710                    
    2711                    $C$DW$161       .dwtag  DW_TAG_member
    2712                            .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$34)
    2713                            .dwattr $C$DW$161, DW_AT_name("MCTLW")
    2714                            .dwattr $C$DW$161, DW_AT_TI_symbol_name("MCTLW")
