TI ARM Assembler PC v18.12.2 Sat Dec 14 17:40:32 2019

Copyright (c) 1996-2018 Texas Instruments Incorporated
CRC.asm                                                              PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM G3 C/C++ Codegen                                            PC v18.12.2.LTS *
       3                    ;* Date/Time created: Sat Dec 14 17:40:31 2019                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --embed
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../CRC.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM G3 C/C++ Codegen PC v18.12.2.LTS Copyright (c) 199
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\Hp\workspace_v9_TIMSP432\BL_MASTER\Debug")
      13                    ;       C:\ti\ccs910\ccs\tools\compiler\ti-cgt-arm_18.12.2.LTS\bin\armacpia.exe -@C:\\Users\\Hp\\AppDa

     341                            .dwattr $C$DW$21, DW_AT_TI_call
     342                    
     343 00000044 FFFEF7FF!         BL        CRC_Result_master     ; [DPU_V7M3_PIPE] |73|  ; [KEEP 32-BIT INS]
     344                            ; CALL OCCURS {CRC_Result_master }  ; [] |73| 
     345                            .dwpsn  file "../CRC.c",line 74,column 9,is_stmt,isa 1
     346 00000048 2004F8BD          LDRH      A3, [SP, #4]          ; [DPU_V7M3_PIPE] |74|  ; [KEEP 32-BIT INS]
     347 0000004c 9900              LDR       A2, [SP, #0]          ; [DPU_V7M3_PIPE] |74|  ; [ORIG 16-BIT INS]
     348 0000004e 0008F89D          LDRB      A1, [SP, #8]          ; [DPU_V7M3_PIPE] |74|  ; [KEEP 32-BIT INS]
     349 00000052 5450              STRB      A1, [A3, +A2]         ; [DPU_V7M3_PIPE] |74|  ; [ORIG 16-BIT INS]
     350                            .dwpsn  file "../CRC.c",line 75,column 1,is_stmt,isa 1
     351                    $C$DW$22        .dwtag  DW_TAG_TI_branch
     352                            .dwattr $C$DW$22, DW_AT_low_pc(0x00)
     353                            .dwattr $C$DW$22, DW_AT_TI_return
     354                    
     355 00000054 BD0E              POP       {A2, A3, A4, PC}      ; [DPU_V7M3_PIPE]  ; [ORIG 16-BIT INS]
     356                            .dwcfi  cfa_offset, 0
     357                            .dwcfi  restore_reg, 3
     358                            .dwcfi  restore_reg, 2
     359                            .dwcfi  restore_reg, 1
     360                            ; BRANCH OCCURS                  ; [] 
     361                            .dwattr $C$DW$12, DW_AT_TI_end_file("../CRC.c")
     362                            .dwattr $C$DW$12, DW_AT_TI_end_line(0x4b)
     363                            .dwattr $C$DW$12, DW_AT_TI_end_column(0x01)
     364                            .dwendentry
     365                            .dwendtag $C$DW$12
     366                    
     367                    ;******************************************************************************
     368                    ;* CONSTANT TABLE                                                             *
     369                    ;******************************************************************************
     370 00000018                   .sect   ".text:CRC_Init"
     371                            .align  4
     372 00000018 40004018  ||$C$CON1||:    .bits           0x40004018,32
     373                    
     374                    ;******************************************************************************
     375                    ;* CONSTANT TABLE                                                             *
     376                    ;******************************************************************************
     377 00000014                   .sect   ".text:CRC_calculation"
     378                            .align  4
     379 00000014 40004014  ||$C$CON2||:    .bits           0x40004014,32
     380                    
     381                    ;******************************************************************************
     382                    ;* CONSTANT TABLE                                                             *
     383                    ;******************************************************************************
     384 00000012                   .sect   ".text:CRC_Result_master"
     385                            .align  4
TI ARM Assembler PC v18.12.2 Sat Dec 14 17:40:32 2019

Copyright (c) 1996-2018 Texas Instruments Incorporated
CRC.asm                                                              PAGE    8

     386 00000012 401846C0  ||$C$CON3||:    .bits           0x40004018,32
         00000016 00004000 
     387                    
     388                    
     389                    ;******************************************************************************
     390                    ;* BUILD ATTRIBUTES                                                           *
     391                    ;******************************************************************************
     392                            .battr "aeabi", Tag_File, 1, Tag_ABI_PCS_wchar_t(2)
     393                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_rounding(0)
     394                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_denormal(0)
     395                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_exceptions(0)
     396                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_number_model(1)
     397                            .battr "aeabi", Tag_File, 1, Tag_ABI_enum_size(1)
     398                            .battr "aeabi", Tag_File, 1, Tag_ABI_optimization_goals(5)
     399                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_optimization_goals(0)
     400                            .battr "TI", Tag_File, 1, Tag_Bitfield_layout(0)
     401                            .battr "aeabi", Tag_File, 1, Tag_ABI_VFP_args(3)
     402                            .battr "TI", Tag_File, 1, Tag_FP_interface(1)
     403                    
     404                    ;******************************************************************************
     405                    ;* TYPE INFORMATION                                                           *
     406                    ;******************************************************************************
     407                    
     408                    $C$DW$T$25      .dwtag  DW_TAG_structure_type
     409                            .dwattr $C$DW$T$25, DW_AT_byte_size(0x20)
     410                    $C$DW$23        .dwtag  DW_TAG_member
     411                            .dwattr $C$DW$23, DW_AT_type(*$C$DW$T$23)
     412                            .dwattr $C$DW$23, DW_AT_name("DI32")
     413                            .dwattr $C$DW$23, DW_AT_TI_symbol_name("DI32")
     414                            .dwattr $C$DW$23, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     415                            .dwattr $C$DW$23, DW_AT_accessibility(DW_ACCESS_public)
     416                            .dwattr $C$DW$23, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices\
     417                            .dwattr $C$DW$23, DW_AT_decl_line(0x1be)
     418                            .dwattr $C$DW$23, DW_AT_decl_column(0x11)
     419                    
     420                    $C$DW$24        .dwtag  DW_TAG_member
     421                            .dwattr $C$DW$24, DW_AT_type(*$C$DW$T$22)
     422                            .dwattr $C$DW$24, DW_AT_name("RESERVED0")
     423                            .dwattr $C$DW$24, DW_AT_TI_symbol_name("RESERVED0")
     424                            .dwattr $C$DW$24, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     425                            .dwattr $C$DW$24, DW_AT_accessibility(DW_ACCESS_public)
     426                            .dwattr $C$DW$24, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices\
     427                            .dwattr $C$DW$24, DW_AT_decl_line(0x1bf)
     428                            .dwattr $C$DW$24, DW_AT_decl_column(0x11)
     429                    
     430                    $C$DW$25        .dwtag  DW_TAG_member
     431                            .dwattr $C$DW$25, DW_AT_type(*$C$DW$T$23)
     432                            .dwattr $C$DW$25, DW_AT_name("DIRB32")
     433                            .dwattr $C$DW$25, DW_AT_TI_symbol_name("DIRB32")
     434                            .dwattr $C$DW$25, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     435                            .dwattr $C$DW$25, DW_AT_accessibility(DW_ACCESS_public)
     436                            .dwattr $C$DW$25, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices\
     437                            .dwattr $C$DW$25, DW_AT_decl_line(0x1c0)
     438                            .dwattr $C$DW$25, DW_AT_decl_column(0x11)
     439                    
TI ARM Assembler PC v18.12.2 Sat Dec 14 17:40:32 2019

Copyright (c) 1996-2018 Texas Instruments Incorporated
CRC.asm                                                              PAGE    9

     440                    $C$DW$26        .dwtag  DW_TAG_member
     441                            .dwattr $C$DW$26, DW_AT_type(*$C$DW$T$22)
     442                            .dwattr $C$DW$26, DW_AT_name("RESERVED1")
     443                            .dwattr $C$DW$26, DW_AT_TI_symbol_name("RESERVED1")
     444                            .dwattr $C$DW$26, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     445                            .dwattr $C$DW$26, DW_AT_accessibility(DW_ACCESS_public)
     446                            .dwattr $C$DW$26, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices\
     447                            .dwattr $C$DW$26, DW_AT_decl_line(0x1c1)
     448                            .dwattr $C$DW$26, DW_AT_decl_column(0x11)
     449                    
     450                    $C$DW$27        .dwtag  DW_TAG_member
     451                            .dwattr $C$DW$27, DW_AT_type(*$C$DW$T$23)
     452                            .dwattr $C$DW$27, DW_AT_name("INIRES32_LO")
     453                            .dwattr $C$DW$27, DW_AT_TI_symbol_name("INIRES32_LO")
     454                            .dwattr $C$DW$27, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     455                            .dwattr $C$DW$27, DW_AT_accessibility(DW_ACCESS_public)
     456                            .dwattr $C$DW$27, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices\
     457                            .dwattr $C$DW$27, DW_AT_decl_line(0x1c2)
     458                            .dwattr $C$DW$27, DW_AT_decl_column(0x11)
     459                    
     460                    $C$DW$28        .dwtag  DW_TAG_member
     461                            .dwattr $C$DW$28, DW_AT_type(*$C$DW$T$23)
     462                            .dwattr $C$DW$28, DW_AT_name("INIRES32_HI")
     463                            .dwattr $C$DW$28, DW_AT_TI_symbol_name("INIRES32_HI")
     464                            .dwattr $C$DW$28, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     465                            .dwattr $C$DW$28, DW_AT_accessibility(DW_ACCESS_public)
     466                            .dwattr $C$DW$28, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices\
     467                            .dwattr $C$DW$28, DW_AT_decl_line(0x1c3)
     468                            .dwattr $C$DW$28, DW_AT_decl_column(0x11)
     469                    
     470                    $C$DW$29        .dwtag  DW_TAG_member
     471                            .dwattr $C$DW$29, DW_AT_type(*$C$DW$T$23)
     472                            .dwattr $C$DW$29, DW_AT_name("RESR32_LO")
     473                            .dwattr $C$DW$29, DW_AT_TI_symbol_name("RESR32_LO")
     474                            .dwattr $C$DW$29, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     475                            .dwattr $C$DW$29, DW_AT_accessibility(DW_ACCESS_public)
     476                            .dwattr $C$DW$29, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices\
     477                            .dwattr $C$DW$29, DW_AT_decl_line(0x1c4)
     478                            .dwattr $C$DW$29, DW_AT_decl_column(0x11)
     479                    
     480                    $C$DW$30        .dwtag  DW_TAG_member
     481                            .dwattr $C$DW$30, DW_AT_type(*$C$DW$T$23)
     482                            .dwattr $C$DW$30, DW_AT_name("RESR32_HI")
     483                            .dwattr $C$DW$30, DW_AT_TI_symbol_name("RESR32_HI")
     484                            .dwattr $C$DW$30, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
     485                            .dwattr $C$DW$30, DW_AT_accessibility(DW_ACCESS_public)
     486                            .dwattr $C$DW$30, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices\
     487                            .dwattr $C$DW$30, DW_AT_decl_line(0x1c5)
     488                            .dwattr $C$DW$30, DW_AT_decl_column(0x11)
     489                    
     490                    $C$DW$31        .dwtag  DW_TAG_member
     491                            .dwattr $C$DW$31, DW_AT_type(*$C$DW$T$23)
     492                            .dwattr $C$DW$31, DW_AT_name("DI16")
     493                            .dwattr $C$DW$31, DW_AT_TI_symbol_name("DI16")
     494                            .dwattr $C$DW$31, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
TI ARM Assembler PC v18.12.2 Sat Dec 14 17:40:32 2019

Copyright (c) 1996-2018 Texas Instruments Incorporated
CRC.asm                                                              PAGE   10

     495                            .dwattr $C$DW$31, DW_AT_accessibility(DW_ACCESS_public)
     496                            .dwattr $C$DW$31, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices\
     497                            .dwattr $C$DW$31, DW_AT_decl_line(0x1c6)
     498                            .dwattr $C$DW$31, DW_AT_decl_column(0x11)
     499                    
     500                    $C$DW$32        .dwtag  DW_TAG_member
     501                            .dwattr $C$DW$32, DW_AT_type(*$C$DW$T$22)
     502                            .dwattr $C$DW$32, DW_AT_name("RESERVED2")
     503                            .dwattr $C$DW$32, DW_AT_TI_symbol_name("RESERVED2")
     504                            .dwattr $C$DW$32, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
     505                            .dwattr $C$DW$32, DW_AT_accessibility(DW_ACCESS_public)
     506                            .dwattr $C$DW$32, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices\
     507                            .dwattr $C$DW$32, DW_AT_decl_line(0x1c7)
     508                            .dwattr $C$DW$32, DW_AT_decl_column(0x11)
     509                    
     510                    $C$DW$33        .dwtag  DW_TAG_member
     511                            .dwattr $C$DW$33, DW_AT_type(*$C$DW$T$23)
     512                            .dwattr $C$DW$33, DW_AT_name("DIRB16")
     513                            .dwattr $C$DW$33, DW_AT_TI_symbol_name("DIRB16")
     514                            .dwattr $C$DW$33, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
     515                            .dwattr $C$DW$33, DW_AT_accessibility(DW_ACCESS_public)
     516                            .dwattr $C$DW$33, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices\
     517                            .dwattr $C$DW$33, DW_AT_decl_line(0x1c8)
     518                            .dwattr $C$DW$33, DW_AT_decl_column(0x11)
     519                    
     520                    $C$DW$34        .dwtag  DW_TAG_member
     521                            .dwattr $C$DW$34, DW_AT_type(*$C$DW$T$22)
     522                            .dwattr $C$DW$34, DW_AT_name("RESERVED3")
     523                            .dwattr $C$DW$34, DW_AT_TI_symbol_name("RESERVED3")
     524                            .dwattr $C$DW$34, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
     525                            .dwattr $C$DW$34, DW_AT_accessibility(DW_ACCESS_public)
     526                            .dwattr $C$DW$34, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices\
     527                            .dwattr $C$DW$34, DW_AT_decl_line(0x1c9)
     528                            .dwattr $C$DW$34, DW_AT_decl_column(0x11)
     529                    
     530                    $C$DW$35        .dwtag  DW_TAG_member
     531                            .dwattr $C$DW$35, DW_AT_type(*$C$DW$T$23)
     532                            .dwattr $C$DW$35, DW_AT_name("INIRES16")
     533                            .dwattr $C$DW$35, DW_AT_TI_symbol_name("INIRES16")
     534                            .dwattr $C$DW$35, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
     535                            .dwattr $C$DW$35, DW_AT_accessibility(DW_ACCESS_public)
     536                            .dwattr $C$DW$35, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices\
     537                            .dwattr $C$DW$35, DW_AT_decl_line(0x1ca)
     538                            .dwattr $C$DW$35, DW_AT_decl_column(0x11)
     539                    
     540                    $C$DW$36        .dwtag  DW_TAG_member
     541                            .dwattr $C$DW$36, DW_AT_type(*$C$DW$T$24)
     542                            .dwattr $C$DW$36, DW_AT_name("RESERVED4")
     543                            .dwattr $C$DW$36, DW_AT_TI_symbol_name("RESERVED4")
     544                            .dwattr $C$DW$36, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
     545                            .dwattr $C$DW$36, DW_AT_accessibility(DW_ACCESS_public)
     546                            .dwattr $C$DW$36, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices\
     547                            .dwattr $C$DW$36, DW_AT_decl_line(0x1cb)
     548                            .dwattr $C$DW$36, DW_AT_decl_column(0x11)
     549                    
TI ARM Assembler PC v18.12.2 Sat Dec 14 17:40:32 2019

Copyright (c) 1996-2018 Texas Instruments Incorporated
CRC.asm                                                              PAGE   11

     550                    $C$DW$37        .dwtag  DW_TAG_member
     551                            .dwattr $C$DW$37, DW_AT_type(*$C$DW$T$23)
     552                            .dwattr $C$DW$37, DW_AT_name("RESR16")
     553                            .dwattr $C$DW$37, DW_AT_TI_symbol_name("RESR16")
     554                            .dwattr $C$DW$37, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
     555                            .dwattr $C$DW$37, DW_AT_accessibility(DW_ACCESS_public)
     556                            .dwattr $C$DW$37, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices\
     557                            .dwattr $C$DW$37, DW_AT_decl_line(0x1cc)
     558                            .dwattr $C$DW$37, DW_AT_decl_column(0x11)
     559                    
     560                            .dwattr $C$DW$T$25, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\device
     561                            .dwattr $C$DW$T$25, DW_AT_decl_line(0x1bd)
     562                            .dwattr $C$DW$T$25, DW_AT_decl_column(0x10)
     563                            .dwendtag $C$DW$T$25
     564                    
     565                    $C$DW$T$184     .dwtag  DW_TAG_typedef
     566                            .dwattr $C$DW$T$184, DW_AT_name("CRC32_Type")
     567                            .dwattr $C$DW$T$184, DW_AT_type(*$C$DW$T$25)
     568                            .dwattr $C$DW$T$184, DW_AT_language(DW_LANG_C)
     569                            .dwattr $C$DW$T$184, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devic
     570                            .dwattr $C$DW$T$184, DW_AT_decl_line(0x1cd)
     571                            .dwattr $C$DW$T$184, DW_AT_decl_column(0x03)
     572                    
     573                    
     574                    $C$DW$T$26      .dwtag  DW_TAG_structure_type
     575                            .dwattr $C$DW$T$26, DW_AT_byte_size(0x10)
     576                    $C$DW$38        .dwtag  DW_TAG_member
     577                            .dwattr $C$DW$38, DW_AT_type(*$C$DW$T$14)
     578                            .dwattr $C$DW$38, DW_AT_name("__max_align1")
     579                            .dwattr $C$DW$38, DW_AT_TI_symbol_name("__max_align1")
     580                            .dwattr $C$DW$38, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     581                            .dwattr $C$DW$38, DW_AT_accessibility(DW_ACCESS_public)
     582                            .dwattr $C$DW$38, DW_AT_decl_file("C:/ti/ccs910/ccs/tools/compiler/ti-cgt-arm_18.12.2.LTS/incl
     583                            .dwattr $C$DW$38, DW_AT_decl_line(0x7a)
     584                            .dwattr $C$DW$38, DW_AT_decl_column(0x0c)
     585                    
     586                    $C$DW$39        .dwtag  DW_TAG_member
     587                            .dwattr $C$DW$39, DW_AT_type(*$C$DW$T$18)
     588                            .dwattr $C$DW$39, DW_AT_name("__max_align2")
     589                            .dwattr $C$DW$39, DW_AT_TI_symbol_name("__max_align2")
     590                            .dwattr $C$DW$39, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     591                            .dwattr $C$DW$39, DW_AT_accessibility(DW_ACCESS_public)
     592                            .dwattr $C$DW$39, DW_AT_decl_file("C:/ti/ccs910/ccs/tools/compiler/ti-cgt-arm_18.12.2.LTS/incl
     593                            .dwattr $C$DW$39, DW_AT_decl_line(0x7b)
     594                            .dwattr $C$DW$39, DW_AT_decl_column(0x0e)
     595                    
     596                            .dwattr $C$DW$T$26, DW_AT_decl_file("C:/ti/ccs910/ccs/tools/compiler/ti-cgt-arm_18.12.2.LTS/in
     597                            .dwattr $C$DW$T$26, DW_AT_decl_line(0x79)
     598                            .dwattr $C$DW$T$26, DW_AT_decl_column(0x10)
     599                            .dwendtag $C$DW$T$26
     600                    
     601                    $C$DW$T$186     .dwtag  DW_TAG_typedef
     602                            .dwattr $C$DW$T$186, DW_AT_name("__max_align_t")
     603                            .dwattr $C$DW$T$186, DW_AT_type(*$C$DW$T$26)
     604                            .dwattr $C$DW$T$186, DW_AT_language(DW_LANG_C)
TI ARM Assembler PC v18.12.2 Sat Dec 14 17:40:32 2019

Copyright (c) 1996-2018 Texas Instruments Incorporated
CRC.asm                                                              PAGE   12

     605                            .dwattr $C$DW$T$186, DW_AT_decl_file("C:/ti/ccs910/ccs/tools/compiler/ti-cgt-arm_18.12.2.LTS/i
     606                            .dwattr $C$DW$T$186, DW_AT_decl_line(0x7c)
     607                            .dwattr $C$DW$T$186, DW_AT_decl_column(0x03)
     608                    
     609                    
     610                    $C$DW$T$29      .dwtag  DW_TAG_structure_type
     611                            .dwattr $C$DW$T$29, DW_AT_byte_size(0x04)
     612                    $C$DW$40        .dwtag  DW_TAG_member
     613                            .dwattr $C$DW$40, DW_AT_type(*$C$DW$T$28)
     614                            .dwattr $C$DW$40, DW_AT_name("_reserved0")
     615                            .dwattr $C$DW$40, DW_AT_TI_symbol_name("_reserved0")
     616                            .dwattr $C$DW$40, DW_AT_bit_offset(0x10)
     617                            .dwattr $C$DW$40, DW_AT_bit_size(0x10)
     618                            .dwattr $C$DW$40, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     619                            .dwattr $C$DW$40, DW_AT_accessibility(DW_ACCESS_public)
     620                            .dwattr $C$DW$40, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_party
     621                            .dwattr $C$DW$40, DW_AT_decl_line(0x107)
     622                            .dwattr $C$DW$40, DW_AT_decl_column(0x0e)
     623                    
     624                    $C$DW$41        .dwtag  DW_TAG_member
     625                            .dwattr $C$DW$41, DW_AT_type(*$C$DW$T$28)
     626                            .dwattr $C$DW$41, DW_AT_name("GE")
     627                            .dwattr $C$DW$41, DW_AT_TI_symbol_name("GE")
     628                            .dwattr $C$DW$41, DW_AT_bit_offset(0x0c)
     629                            .dwattr $C$DW$41, DW_AT_bit_size(0x04)
     630                            .dwattr $C$DW$41, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     631                            .dwattr $C$DW$41, DW_AT_accessibility(DW_ACCESS_public)
     632                            .dwattr $C$DW$41, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_party
     633                            .dwattr $C$DW$41, DW_AT_decl_line(0x108)
     634                            .dwattr $C$DW$41, DW_AT_decl_column(0x0e)
     635                    
     636                    $C$DW$42        .dwtag  DW_TAG_member
     637                            .dwattr $C$DW$42, DW_AT_type(*$C$DW$T$28)
     638                            .dwattr $C$DW$42, DW_AT_name("_reserved1")
     639                            .dwattr $C$DW$42, DW_AT_TI_symbol_name("_reserved1")
     640                            .dwattr $C$DW$42, DW_AT_bit_offset(0x05)
     641                            .dwattr $C$DW$42, DW_AT_bit_size(0x07)
     642                            .dwattr $C$DW$42, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     643                            .dwattr $C$DW$42, DW_AT_accessibility(DW_ACCESS_public)
     644                            .dwattr $C$DW$42, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_party
     645                            .dwattr $C$DW$42, DW_AT_decl_line(0x109)
     646                            .dwattr $C$DW$42, DW_AT_decl_column(0x0e)
     647                    
     648                    $C$DW$43        .dwtag  DW_TAG_member
     649                            .dwattr $C$DW$43, DW_AT_type(*$C$DW$T$28)
     650                            .dwattr $C$DW$43, DW_AT_name("Q")
     651                            .dwattr $C$DW$43, DW_AT_TI_symbol_name("Q")
     652                            .dwattr $C$DW$43, DW_AT_bit_offset(0x04)
     653                            .dwattr $C$DW$43, DW_AT_bit_size(0x01)
     654                            .dwattr $C$DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     655                            .dwattr $C$DW$43, DW_AT_accessibility(DW_ACCESS_public)
     656                            .dwattr $C$DW$43, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_party
     657                            .dwattr $C$DW$43, DW_AT_decl_line(0x10a)
     658                            .dwattr $C$DW$43, DW_AT_decl_column(0x0e)
     659                    
TI ARM Assembler PC v18.12.2 Sat Dec 14 17:40:32 2019

Copyright (c) 1996-2018 Texas Instruments Incorporated
CRC.asm                                                              PAGE   13

     660                    $C$DW$44        .dwtag  DW_TAG_member
     661                            .dwattr $C$DW$44, DW_AT_type(*$C$DW$T$28)
     662                            .dwattr $C$DW$44, DW_AT_name("V")
     663                            .dwattr $C$DW$44, DW_AT_TI_symbol_name("V")
     664                            .dwattr $C$DW$44, DW_AT_bit_offset(0x03)
     665                            .dwattr $C$DW$44, DW_AT_bit_size(0x01)
     666                            .dwattr $C$DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     667                            .dwattr $C$DW$44, DW_AT_accessibility(DW_ACCESS_public)
     668                            .dwattr $C$DW$44, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_party
     669                            .dwattr $C$DW$44, DW_AT_decl_line(0x10b)
     670                            .dwattr $C$DW$44, DW_AT_decl_column(0x0e)
     671                    
     672                    $C$DW$45        .dwtag  DW_TAG_member
     673                            .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$28)
     674                            .dwattr $C$DW$45, DW_AT_name("C")
     675                            .dwattr $C$DW$45, DW_AT_TI_symbol_name("C")
     676                            .dwattr $C$DW$45, DW_AT_bit_offset(0x02)
     677                            .dwattr $C$DW$45, DW_AT_bit_size(0x01)
     678                            .dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     679                            .dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)
     680                            .dwattr $C$DW$45, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_party
     681                            .dwattr $C$DW$45, DW_AT_decl_line(0x10c)
     682                            .dwattr $C$DW$45, DW_AT_decl_column(0x0e)
     683                    
     684                    $C$DW$46        .dwtag  DW_TAG_member
     685                            .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$28)
     686                            .dwattr $C$DW$46, DW_AT_name("Z")
     687                            .dwattr $C$DW$46, DW_AT_TI_symbol_name("Z")
     688                            .dwattr $C$DW$46, DW_AT_bit_offset(0x01)
     689                            .dwattr $C$DW$46, DW_AT_bit_size(0x01)
     690                            .dwattr $C$DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     691                            .dwattr $C$DW$46, DW_AT_accessibility(DW_ACCESS_public)
     692                            .dwattr $C$DW$46, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_party
     693                            .dwattr $C$DW$46, DW_AT_decl_line(0x10d)
     694                            .dwattr $C$DW$46, DW_AT_decl_column(0x0e)
     695                    
     696                    $C$DW$47        .dwtag  DW_TAG_member
     697                            .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$28)
     698                            .dwattr $C$DW$47, DW_AT_name("N")
     699                            .dwattr $C$DW$47, DW_AT_TI_symbol_name("N")
     700                            .dwattr $C$DW$47, DW_AT_bit_offset(0x00)
     701                            .dwattr $C$DW$47, DW_AT_bit_size(0x01)
     702                            .dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     703                            .dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
     704                            .dwattr $C$DW$47, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_party
     705                            .dwattr $C$DW$47, DW_AT_decl_line(0x10e)
     706                            .dwattr $C$DW$47, DW_AT_decl_column(0x0e)
     707                    
     708                            .dwattr $C$DW$T$29, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_par
     709                            .dwattr $C$DW$T$29, DW_AT_decl_line(0x106)
     710                            .dwattr $C$DW$T$29, DW_AT_decl_column(0x03)
     711                            .dwendtag $C$DW$T$29
     712                    
     713                    
     714                    $C$DW$T$30      .dwtag  DW_TAG_structure_type
TI ARM Assembler PC v18.12.2 Sat Dec 14 17:40:32 2019

Copyright (c) 1996-2018 Texas Instruments Incorporated
CRC.asm                                                              PAGE   14

     715                            .dwattr $C$DW$T$30, DW_AT_byte_size(0x04)
     716                    $C$DW$48        .dwtag  DW_TAG_member
     717                            .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$28)
     718                            .dwattr $C$DW$48, DW_AT_name("ISR")
     719                            .dwattr $C$DW$48, DW_AT_TI_symbol_name("ISR")
     720                            .dwattr $C$DW$48, DW_AT_bit_offset(0x17)
     721                            .dwattr $C$DW$48, DW_AT_bit_size(0x09)
     722                            .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     723                            .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
     724                            .dwattr $C$DW$48, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_party
     725                            .dwattr $C$DW$48, DW_AT_decl_line(0x12e)
     726                            .dwattr $C$DW$48, DW_AT_decl_column(0x0e)
     727                    
     728                    $C$DW$49        .dwtag  DW_TAG_member
     729                            .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$28)
     730                            .dwattr $C$DW$49, DW_AT_name("_reserved0")
     731                            .dwattr $C$DW$49, DW_AT_TI_symbol_name("_reserved0")
     732                            .dwattr $C$DW$49, DW_AT_bit_offset(0x00)
     733                            .dwattr $C$DW$49, DW_AT_bit_size(0x17)
     734                            .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     735                            .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
     736                            .dwattr $C$DW$49, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_party
     737                            .dwattr $C$DW$49, DW_AT_decl_line(0x12f)
     738                            .dwattr $C$DW$49, DW_AT_decl_column(0x0e)
     739                    
     740                            .dwattr $C$DW$T$30, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_par
     741                            .dwattr $C$DW$T$30, DW_AT_decl_line(0x12d)
     742                            .dwattr $C$DW$T$30, DW_AT_decl_column(0x03)
     743                            .dwendtag $C$DW$T$30
     744                    
     745                    
     746                    $C$DW$T$31      .dwtag  DW_TAG_structure_type
     747                            .dwattr $C$DW$T$31, DW_AT_byte_size(0x04)
     748                    $C$DW$50        .dwtag  DW_TAG_member
     749                            .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$28)
     750                            .dwattr $C$DW$50, DW_AT_name("ISR")
     751                            .dwattr $C$DW$50, DW_AT_TI_symbol_name("ISR")
     752                            .dwattr $C$DW$50, DW_AT_bit_offset(0x17)
     753                            .dwattr $C$DW$50, DW_AT_bit_size(0x09)
     754                            .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     755                            .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
     756                            .dwattr $C$DW$50, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_party
     757                            .dwattr $C$DW$50, DW_AT_decl_line(0x140)
     758                            .dwattr $C$DW$50, DW_AT_decl_column(0x0e)
     759                    
     760                    $C$DW$51        .dwtag  DW_TAG_member
     761                            .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$28)
     762                            .dwattr $C$DW$51, DW_AT_name("_reserved0")
     763                            .dwattr $C$DW$51, DW_AT_TI_symbol_name("_reserved0")
     764                            .dwattr $C$DW$51, DW_AT_bit_offset(0x16)
     765                            .dwattr $C$DW$51, DW_AT_bit_size(0x01)
     766                            .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     767                            .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
     768                            .dwattr $C$DW$51, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_party
     769                            .dwattr $C$DW$51, DW_AT_decl_line(0x141)
TI ARM Assembler PC v18.12.2 Sat Dec 14 17:40:32 2019

Copyright (c) 1996-2018 Texas Instruments Incorporated
CRC.asm                                                              PAGE   15

     770                            .dwattr $C$DW$51, DW_AT_decl_column(0x0e)
     771                    
     772                    $C$DW$52        .dwtag  DW_TAG_member
     773                            .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$28)
     774                            .dwattr $C$DW$52, DW_AT_name("ICI_IT_1")
     775                            .dwattr $C$DW$52, DW_AT_TI_symbol_name("ICI_IT_1")
     776                            .dwattr $C$DW$52, DW_AT_bit_offset(0x10)
     777                            .dwattr $C$DW$52, DW_AT_bit_size(0x06)
     778                            .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     779                            .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
     780                            .dwattr $C$DW$52, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_party
     781                            .dwattr $C$DW$52, DW_AT_decl_line(0x142)
     782                            .dwattr $C$DW$52, DW_AT_decl_column(0x0e)
     783                    
     784                    $C$DW$53        .dwtag  DW_TAG_member
     785                            .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$28)
     786                            .dwattr $C$DW$53, DW_AT_name("GE")
     787                            .dwattr $C$DW$53, DW_AT_TI_symbol_name("GE")
     788                            .dwattr $C$DW$53, DW_AT_bit_offset(0x0c)
     789                            .dwattr $C$DW$53, DW_AT_bit_size(0x04)
     790                            .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     791                            .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
     792                            .dwattr $C$DW$53, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_party
     793                            .dwattr $C$DW$53, DW_AT_decl_line(0x143)
     794                            .dwattr $C$DW$53, DW_AT_decl_column(0x0e)
     795                    
     796                    $C$DW$54        .dwtag  DW_TAG_member
     797                            .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$28)
     798                            .dwattr $C$DW$54, DW_AT_name("_reserved1")
     799                            .dwattr $C$DW$54, DW_AT_TI_symbol_name("_reserved1")
     800                            .dwattr $C$DW$54, DW_AT_bit_offset(0x08)
     801                            .dwattr $C$DW$54, DW_AT_bit_size(0x04)
     802                            .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     803                            .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
     804                            .dwattr $C$DW$54, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_party
     805                            .dwattr $C$DW$54, DW_AT_decl_line(0x144)
     806                            .dwattr $C$DW$54, DW_AT_decl_column(0x0e)
     807                    
     808                    $C$DW$55        .dwtag  DW_TAG_member
     809                            .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$28)
     810                            .dwattr $C$DW$55, DW_AT_name("T")
     811                            .dwattr $C$DW$55, DW_AT_TI_symbol_name("T")
     812                            .dwattr $C$DW$55, DW_AT_bit_offset(0x07)
     813                            .dwattr $C$DW$55, DW_AT_bit_size(0x01)
     814                            .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     815                            .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
     816                            .dwattr $C$DW$55, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_party
     817                            .dwattr $C$DW$55, DW_AT_decl_line(0x145)
     818                            .dwattr $C$DW$55, DW_AT_decl_column(0x0e)
     819                    
     820                    $C$DW$56        .dwtag  DW_TAG_member
     821                            .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$28)
     822                            .dwattr $C$DW$56, DW_AT_name("ICI_IT_2")
     823                            .dwattr $C$DW$56, DW_AT_TI_symbol_name("ICI_IT_2")
     824                            .dwattr $C$DW$56, DW_AT_bit_offset(0x05)
TI ARM Assembler PC v18.12.2 Sat Dec 14 17:40:32 2019

Copyright (c) 1996-2018 Texas Instruments Incorporated
CRC.asm                                                              PAGE   16

     825                            .dwattr $C$DW$56, DW_AT_bit_size(0x02)
     826                            .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     827                            .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
     828                            .dwattr $C$DW$56, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_party
     829                            .dwattr $C$DW$56, DW_AT_decl_line(0x146)
     830                            .dwattr $C$DW$56, DW_AT_decl_column(0x0e)
     831                    
     832                    $C$DW$57        .dwtag  DW_TAG_member
     833                            .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$28)
     834                            .dwattr $C$DW$57, DW_AT_name("Q")
     835                            .dwattr $C$DW$57, DW_AT_TI_symbol_name("Q")
     836                            .dwattr $C$DW$57, DW_AT_bit_offset(0x04)
     837                            .dwattr $C$DW$57, DW_AT_bit_size(0x01)
     838                            .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     839                            .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
     840                            .dwattr $C$DW$57, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_party
     841                            .dwattr $C$DW$57, DW_AT_decl_line(0x147)
     842                            .dwattr $C$DW$57, DW_AT_decl_column(0x0e)
     843                    
     844                    $C$DW$58        .dwtag  DW_TAG_member
     845                            .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$28)
     846                            .dwattr $C$DW$58, DW_AT_name("V")
     847                            .dwattr $C$DW$58, DW_AT_TI_symbol_name("V")
     848                            .dwattr $C$DW$58, DW_AT_bit_offset(0x03)
     849                            .dwattr $C$DW$58, DW_AT_bit_size(0x01)
     850                            .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     851                            .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
     852                            .dwattr $C$DW$58, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_party
     853                            .dwattr $C$DW$58, DW_AT_decl_line(0x148)
     854                            .dwattr $C$DW$58, DW_AT_decl_column(0x0e)
     855                    
     856                    $C$DW$59        .dwtag  DW_TAG_member
     857                            .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$28)
     858                            .dwattr $C$DW$59, DW_AT_name("C")
     859                            .dwattr $C$DW$59, DW_AT_TI_symbol_name("C")
     860                            .dwattr $C$DW$59, DW_AT_bit_offset(0x02)
     861                            .dwattr $C$DW$59, DW_AT_bit_size(0x01)
     862                            .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     863                            .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
     864                            .dwattr $C$DW$59, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_party
     865                            .dwattr $C$DW$59, DW_AT_decl_line(0x149)
     866                            .dwattr $C$DW$59, DW_AT_decl_column(0x0e)
     867                    
     868                    $C$DW$60        .dwtag  DW_TAG_member
     869                            .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$28)
     870                            .dwattr $C$DW$60, DW_AT_name("Z")
     871                            .dwattr $C$DW$60, DW_AT_TI_symbol_name("Z")
     872                            .dwattr $C$DW$60, DW_AT_bit_offset(0x01)
     873                            .dwattr $C$DW$60, DW_AT_bit_size(0x01)
     874                            .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     875                            .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
     876                            .dwattr $C$DW$60, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_party
     877                            .dwattr $C$DW$60, DW_AT_decl_line(0x14a)
     878                            .dwattr $C$DW$60, DW_AT_decl_column(0x0e)
     879                    
TI ARM Assembler PC v18.12.2 Sat Dec 14 17:40:32 2019

Copyright (c) 1996-2018 Texas Instruments Incorporated
CRC.asm                                                              PAGE   17

     880                    $C$DW$61        .dwtag  DW_TAG_member
     881                            .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$28)
     882                            .dwattr $C$DW$61, DW_AT_name("N")
     883                            .dwattr $C$DW$61, DW_AT_TI_symbol_name("N")
     884                            .dwattr $C$DW$61, DW_AT_bit_offset(0x00)
     885                            .dwattr $C$DW$61, DW_AT_bit_size(0x01)
     886                            .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     887                            .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
     888                            .dwattr $C$DW$61, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_party
     889                            .dwattr $C$DW$61, DW_AT_decl_line(0x14b)
     890                            .dwattr $C$DW$61, DW_AT_decl_column(0x0e)
     891                    
     892                            .dwattr $C$DW$T$31, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_par
     893                            .dwattr $C$DW$T$31, DW_AT_decl_line(0x13f)
     894                            .dwattr $C$DW$T$31, DW_AT_decl_column(0x03)
     895                            .dwendtag $C$DW$T$31
     896                    
     897                    
     898                    $C$DW$T$32      .dwtag  DW_TAG_structure_type
     899                            .dwattr $C$DW$T$32, DW_AT_byte_size(0x04)
     900                    $C$DW$62        .dwtag  DW_TAG_member
     901                            .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$28)
     902                            .dwattr $C$DW$62, DW_AT_name("nPRIV")
     903                            .dwattr $C$DW$62, DW_AT_TI_symbol_name("nPRIV")
     904                            .dwattr $C$DW$62, DW_AT_bit_offset(0x1f)
     905                            .dwattr $C$DW$62, DW_AT_bit_size(0x01)
     906                            .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     907                            .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
     908                            .dwattr $C$DW$62, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_party
     909                            .dwattr $C$DW$62, DW_AT_decl_line(0x177)
     910                            .dwattr $C$DW$62, DW_AT_decl_column(0x0e)
     911                    
     912                    $C$DW$63        .dwtag  DW_TAG_member
     913                            .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$28)
     914                            .dwattr $C$DW$63, DW_AT_name("SPSEL")
     915                            .dwattr $C$DW$63, DW_AT_TI_symbol_name("SPSEL")
     916                            .dwattr $C$DW$63, DW_AT_bit_offset(0x1e)
     917                            .dwattr $C$DW$63, DW_AT_bit_size(0x01)
     918                            .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     919                            .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
     920                            .dwattr $C$DW$63, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_party
     921                            .dwattr $C$DW$63, DW_AT_decl_line(0x178)
     922                            .dwattr $C$DW$63, DW_AT_decl_column(0x0e)
     923                    
     924                    $C$DW$64        .dwtag  DW_TAG_member
     925                            .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$28)
     926                            .dwattr $C$DW$64, DW_AT_name("FPCA")
     927                            .dwattr $C$DW$64, DW_AT_TI_symbol_name("FPCA")
     928                            .dwattr $C$DW$64, DW_AT_bit_offset(0x1d)
     929                            .dwattr $C$DW$64, DW_AT_bit_size(0x01)
     930                            .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     931                            .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
     932                            .dwattr $C$DW$64, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_party
     933                            .dwattr $C$DW$64, DW_AT_decl_line(0x179)
     934                            .dwattr $C$DW$64, DW_AT_decl_column(0x0e)
TI ARM Assembler PC v18.12.2 Sat Dec 14 17:40:32 2019

Copyright (c) 1996-2018 Texas Instruments Incorporated
CRC.asm                                                              PAGE   18

     935                    
     936                    $C$DW$65        .dwtag  DW_TAG_member
     937                            .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$28)
     938                            .dwattr $C$DW$65, DW_AT_name("_reserved0")
     939                            .dwattr $C$DW$65, DW_AT_TI_symbol_name("_reserved0")
     940                            .dwattr $C$DW$65, DW_AT_bit_offset(0x00)
     941                            .dwattr $C$DW$65, DW_AT_bit_size(0x1d)
     942                            .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     943                            .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
     944                            .dwattr $C$DW$65, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_party
     945                            .dwattr $C$DW$65, DW_AT_decl_line(0x17a)
     946                            .dwattr $C$DW$65, DW_AT_decl_column(0x0e)
     947                    
     948                            .dwattr $C$DW$T$32, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_par
     949                            .dwattr $C$DW$T$32, DW_AT_decl_line(0x176)
     950                            .dwattr $C$DW$T$32, DW_AT_decl_column(0x03)
     951                            .dwendtag $C$DW$T$32
     952                    
     953                    
     954                    $C$DW$T$42      .dwtag  DW_TAG_structure_type
     955                            .dwattr $C$DW$T$42, DW_AT_byte_size(0xe04)
     956                    $C$DW$66        .dwtag  DW_TAG_member
     957                            .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$34)
     958                            .dwattr $C$DW$66, DW_AT_name("ISER")
     959                            .dwattr $C$DW$66, DW_AT_TI_symbol_name("ISER")
     960                            .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     961                            .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
     962                            .dwattr $C$DW$66, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_party
     963                            .dwattr $C$DW$66, DW_AT_decl_line(0x198)
     964                            .dwattr $C$DW$66, DW_AT_decl_column(0x12)
     965                    
     966                    $C$DW$67        .dwtag  DW_TAG_member
     967                            .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$35)
     968                            .dwattr $C$DW$67, DW_AT_name("RESERVED0")
     969                            .dwattr $C$DW$67, DW_AT_TI_symbol_name("RESERVED0")
     970                            .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
     971                            .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
     972                            .dwattr $C$DW$67, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_party
     973                            .dwattr $C$DW$67, DW_AT_decl_line(0x199)
     974                            .dwattr $C$DW$67, DW_AT_decl_column(0x12)
     975                    
     976                    $C$DW$68        .dwtag  DW_TAG_member
     977                            .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$34)
     978                            .dwattr $C$DW$68, DW_AT_name("ICER")
     979                            .dwattr $C$DW$68, DW_AT_TI_symbol_name("ICER")
     980                            .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x80]
     981                            .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
     982                            .dwattr $C$DW$68, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_party
     983                            .dwattr $C$DW$68, DW_AT_decl_line(0x19a)
     984                            .dwattr $C$DW$68, DW_AT_decl_column(0x12)
     985                    
     986                    $C$DW$69        .dwtag  DW_TAG_member
     987                            .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$35)
     988                            .dwattr $C$DW$69, DW_AT_name("RESERVED1")
     989                            .dwattr $C$DW$69, DW_AT_TI_symbol_name("RESERVED1")
TI ARM Assembler PC v18.12.2 Sat Dec 14 17:40:32 2019

Copyright (c) 1996-2018 Texas Instruments Incorporated
CRC.asm                                                              PAGE   19

     990                            .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
     991                            .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
     992                            .dwattr $C$DW$69, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_party
     993                            .dwattr $C$DW$69, DW_AT_decl_line(0x19b)
     994                            .dwattr $C$DW$69, DW_AT_decl_column(0x12)
     995                    
     996                    $C$DW$70        .dwtag  DW_TAG_member
     997                            .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$34)
     998                            .dwattr $C$DW$70, DW_AT_name("ISPR")
     999                            .dwattr $C$DW$70, DW_AT_TI_symbol_name("ISPR")
    1000                            .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x100]
    1001                            .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
    1002                            .dwattr $C$DW$70, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_party
    1003                            .dwattr $C$DW$70, DW_AT_decl_line(0x19c)
    1004                            .dwattr $C$DW$70, DW_AT_decl_column(0x12)
    1005                    
    1006                    $C$DW$71        .dwtag  DW_TAG_member
    1007                            .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$35)
    1008                            .dwattr $C$DW$71, DW_AT_name("RESERVED2")
    1009                            .dwattr $C$DW$71, DW_AT_TI_symbol_name("RESERVED2")
    1010                            .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x120]
    1011                            .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
    1012                            .dwattr $C$DW$71, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_party
    1013                            .dwattr $C$DW$71, DW_AT_decl_line(0x19d)
    1014                            .dwattr $C$DW$71, DW_AT_decl_column(0x12)
    1015                    
    1016                    $C$DW$72        .dwtag  DW_TAG_member
    1017                            .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$34)
    1018                            .dwattr $C$DW$72, DW_AT_name("ICPR")
    1019                            .dwattr $C$DW$72, DW_AT_TI_symbol_name("ICPR")
    1020                            .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x180]
    1021                            .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
    1022                            .dwattr $C$DW$72, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_party
    1023                            .dwattr $C$DW$72, DW_AT_decl_line(0x19e)
    1024                            .dwattr $C$DW$72, DW_AT_decl_column(0x12)
    1025                    
    1026                    $C$DW$73        .dwtag  DW_TAG_member
    1027                            .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$35)
    1028                            .dwattr $C$DW$73, DW_AT_name("RESERVED3")
    1029                            .dwattr $C$DW$73, DW_AT_TI_symbol_name("RESERVED3")
    1030                            .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a0]
    1031                            .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
    1032                            .dwattr $C$DW$73, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_party
    1033                            .dwattr $C$DW$73, DW_AT_decl_line(0x19f)
    1034                            .dwattr $C$DW$73, DW_AT_decl_column(0x12)
    1035                    
    1036                    $C$DW$74        .dwtag  DW_TAG_member
    1037                            .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$34)
    1038                            .dwattr $C$DW$74, DW_AT_name("IABR")
    1039                            .dwattr $C$DW$74, DW_AT_TI_symbol_name("IABR")
    1040                            .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x200]
    1041                            .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
    1042                            .dwattr $C$DW$74, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_party
    1043                            .dwattr $C$DW$74, DW_AT_decl_line(0x1a0)
    1044                            .dwattr $C$DW$74, DW_AT_decl_column(0x12)
TI ARM Assembler PC v18.12.2 Sat Dec 14 17:40:32 2019

Copyright (c) 1996-2018 Texas Instruments Incorporated
CRC.asm                                                              PAGE   20

    1045                    
    1046                    $C$DW$75        .dwtag  DW_TAG_member
    1047                            .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$36)
    1048                            .dwattr $C$DW$75, DW_AT_name("RESERVED4")
    1049                            .dwattr $C$DW$75, DW_AT_TI_symbol_name("RESERVED4")
    1050                            .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x220]
    1051                            .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
    1052                            .dwattr $C$DW$75, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_party
    1053                            .dwattr $C$DW$75, DW_AT_decl_line(0x1a1)
    1054                            .dwattr $C$DW$75, DW_AT_decl_column(0x12)
    1055                    
    1056                    $C$DW$76        .dwtag  DW_TAG_member
    1057                            .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$40)
    1058                            .dwattr $C$DW$76, DW_AT_name("IP")
    1059                            .dwattr $C$DW$76, DW_AT_TI_symbol_name("IP")
    1060                            .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x300]
    1061                            .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
    1062                            .dwattr $C$DW$76, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_party
    1063                            .dwattr $C$DW$76, DW_AT_decl_line(0x1a2)
    1064                            .dwattr $C$DW$76, DW_AT_decl_column(0x12)
    1065                    
    1066                    $C$DW$77        .dwtag  DW_TAG_member
    1067                            .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$41)
    1068                            .dwattr $C$DW$77, DW_AT_name("RESERVED5")
    1069                            .dwattr $C$DW$77, DW_AT_TI_symbol_name("RESERVED5")
    1070                            .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x3f0]
    1071                            .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
    1072                            .dwattr $C$DW$77, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_party
    1073                            .dwattr $C$DW$77, DW_AT_decl_line(0x1a3)
    1074                            .dwattr $C$DW$77, DW_AT_decl_column(0x12)
    1075                    
    1076                    $C$DW$78        .dwtag  DW_TAG_member
    1077                            .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$33)
    1078                            .dwattr $C$DW$78, DW_AT_name("STIR")
    1079                            .dwattr $C$DW$78, DW_AT_TI_symbol_name("STIR")
    1080                            .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0xe00]
    1081                            .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
    1082                            .dwattr $C$DW$78, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_party
    1083                            .dwattr $C$DW$78, DW_AT_decl_line(0x1a4)
    1084                            .dwattr $C$DW$78, DW_AT_decl_column(0x12)
    1085                    
    1086                            .dwattr $C$DW$T$42, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_par
    1087                            .dwattr $C$DW$T$42, DW_AT_decl_line(0x197)
    1088                            .dwattr $C$DW$T$42, DW_AT_decl_column(0x01)
    1089                            .dwendtag $C$DW$T$42
    1090                    
    1091                    $C$DW$T$187     .dwtag  DW_TAG_typedef
    1092                            .dwattr $C$DW$T$187, DW_AT_name("NVIC_Type")
    1093                            .dwattr $C$DW$T$187, DW_AT_type(*$C$DW$T$42)
    1094                            .dwattr $C$DW$T$187, DW_AT_language(DW_LANG_C)
    1095                            .dwattr $C$DW$T$187, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_pa
    1096                            .dwattr $C$DW$T$187, DW_AT_decl_line(0x1a5)
    1097                            .dwattr $C$DW$T$187, DW_AT_decl_column(0x04)
    1098                    
    1099                    
TI ARM Assembler PC v18.12.2 Sat Dec 14 17:40:32 2019

Copyright (c) 1996-2018 Texas Instruments Incorporated
CRC.asm                                                              PAGE   21

    1100                    $C$DW$T$49      .dwtag  DW_TAG_structure_type
    1101                            .dwattr $C$DW$T$49, DW_AT_byte_size(0x8c)
    1102                    $C$DW$79        .dwtag  DW_TAG_member
    1103                            .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$43)
    1104                            .dwattr $C$DW$79, DW_AT_name("CPUID")
    1105                            .dwattr $C$DW$79, DW_AT_TI_symbol_name("CPUID")
    1106                            .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1107                            .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
    1108                            .dwattr $C$DW$79, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_party
    1109                            .dwattr $C$DW$79, DW_AT_decl_line(0x1ba)
    1110                            .dwattr $C$DW$79, DW_AT_decl_column(0x12)
    1111                    
    1112                    $C$DW$80        .dwtag  DW_TAG_member
    1113                            .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$33)
    1114                            .dwattr $C$DW$80, DW_AT_name("ICSR")
    1115                            .dwattr $C$DW$80, DW_AT_TI_symbol_name("ICSR")
    1116                            .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1117                            .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
    1118                            .dwattr $C$DW$80, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_party
    1119                            .dwattr $C$DW$80, DW_AT_decl_line(0x1bb)
    1120                            .dwattr $C$DW$80, DW_AT_decl_column(0x12)
    1121                    
    1122                    $C$DW$81        .dwtag  DW_TAG_member
    1123                            .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$33)
    1124                            .dwattr $C$DW$81, DW_AT_name("VTOR")
    1125                            .dwattr $C$DW$81, DW_AT_TI_symbol_name("VTOR")
    1126                            .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1127                            .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
    1128                            .dwattr $C$DW$81, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_party
    1129                            .dwattr $C$DW$81, DW_AT_decl_line(0x1bc)
    1130                            .dwattr $C$DW$81, DW_AT_decl_column(0x12)
    1131                    
    1132                    $C$DW$82        .dwtag  DW_TAG_member
    1133                            .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$33)
    1134                            .dwattr $C$DW$82, DW_AT_name("AIRCR")
    1135                            .dwattr $C$DW$82, DW_AT_TI_symbol_name("AIRCR")
    1136                            .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1137                            .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
    1138                            .dwattr $C$DW$82, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_party
    1139                            .dwattr $C$DW$82, DW_AT_decl_line(0x1bd)
    1140                            .dwattr $C$DW$82, DW_AT_decl_column(0x12)
    1141                    
    1142                    $C$DW$83        .dwtag  DW_TAG_member
    1143                            .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$33)
    1144                            .dwattr $C$DW$83, DW_AT_name("SCR")
    1145                            .dwattr $C$DW$83, DW_AT_TI_symbol_name("SCR")
    1146                            .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1147                            .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    1148                            .dwattr $C$DW$83, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_party
    1149                            .dwattr $C$DW$83, DW_AT_decl_line(0x1be)
    1150                            .dwattr $C$DW$83, DW_AT_decl_column(0x12)
    1151                    
    1152                    $C$DW$84        .dwtag  DW_TAG_member
    1153                            .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$33)
    1154                            .dwattr $C$DW$84, DW_AT_name("CCR")
TI ARM Assembler PC v18.12.2 Sat Dec 14 17:40:32 2019

Copyright (c) 1996-2018 Texas Instruments Incorporated
CRC.asm                                                              PAGE   22

    1155                            .dwattr $C$DW$84, DW_AT_TI_symbol_name("CCR")
    1156                            .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1157                            .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    1158                            .dwattr $C$DW$84, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_party
    1159                            .dwattr $C$DW$84, DW_AT_decl_line(0x1bf)
    1160                            .dwattr $C$DW$84, DW_AT_decl_column(0x12)
    1161                    
    1162                    $C$DW$85        .dwtag  DW_TAG_member
    1163                            .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$44)
    1164                            .dwattr $C$DW$85, DW_AT_name("SHP")
    1165                            .dwattr $C$DW$85, DW_AT_TI_symbol_name("SHP")
    1166                            .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1167                            .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    1168                            .dwattr $C$DW$85, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_party
    1169                            .dwattr $C$DW$85, DW_AT_decl_line(0x1c0)
    1170                            .dwattr $C$DW$85, DW_AT_decl_column(0x12)
    1171                    
    1172                    $C$DW$86        .dwtag  DW_TAG_member
    1173                            .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$33)
    1174                            .dwattr $C$DW$86, DW_AT_name("SHCSR")
    1175                            .dwattr $C$DW$86, DW_AT_TI_symbol_name("SHCSR")
    1176                            .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    1177                            .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1178                            .dwattr $C$DW$86, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_party
    1179                            .dwattr $C$DW$86, DW_AT_decl_line(0x1c1)
    1180                            .dwattr $C$DW$86, DW_AT_decl_column(0x12)
    1181                    
    1182                    $C$DW$87        .dwtag  DW_TAG_member
    1183                            .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$33)
    1184                            .dwattr $C$DW$87, DW_AT_name("CFSR")
    1185                            .dwattr $C$DW$87, DW_AT_TI_symbol_name("CFSR")
    1186                            .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    1187                            .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1188                            .dwattr $C$DW$87, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_party
    1189                            .dwattr $C$DW$87, DW_AT_decl_line(0x1c2)
    1190                            .dwattr $C$DW$87, DW_AT_decl_column(0x12)
    1191                    
    1192                    $C$DW$88        .dwtag  DW_TAG_member
    1193                            .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$33)
    1194                            .dwattr $C$DW$88, DW_AT_name("HFSR")
    1195                            .dwattr $C$DW$88, DW_AT_TI_symbol_name("HFSR")
    1196                            .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    1197                            .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1198                            .dwattr $C$DW$88, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_party
    1199                            .dwattr $C$DW$88, DW_AT_decl_line(0x1c3)
    1200                            .dwattr $C$DW$88, DW_AT_decl_column(0x12)
    1201                    
    1202                    $C$DW$89        .dwtag  DW_TAG_member
    1203                            .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$33)
    1204                            .dwattr $C$DW$89, DW_AT_name("DFSR")
    1205                            .dwattr $C$DW$89, DW_AT_TI_symbol_name("DFSR")
    1206                            .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    1207                            .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1208                            .dwattr $C$DW$89, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_party
    1209                            .dwattr $C$DW$89, DW_AT_decl_line(0x1c4)
TI ARM Assembler PC v18.12.2 Sat Dec 14 17:40:32 2019

Copyright (c) 1996-2018 Texas Instruments Incorporated
CRC.asm                                                              PAGE   23

    1210                            .dwattr $C$DW$89, DW_AT_decl_column(0x12)
    1211                    
    1212                    $C$DW$90        .dwtag  DW_TAG_member
    1213                            .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$33)
    1214                            .dwattr $C$DW$90, DW_AT_name("MMFAR")
    1215                            .dwattr $C$DW$90, DW_AT_TI_symbol_name("MMFAR")
    1216                            .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    1217                            .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1218                            .dwattr $C$DW$90, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_party
    1219                            .dwattr $C$DW$90, DW_AT_decl_line(0x1c5)
    1220                            .dwattr $C$DW$90, DW_AT_decl_column(0x12)
    1221                    
    1222                    $C$DW$91        .dwtag  DW_TAG_member
    1223                            .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$33)
    1224                            .dwattr $C$DW$91, DW_AT_name("BFAR")
    1225                            .dwattr $C$DW$91, DW_AT_TI_symbol_name("BFAR")
    1226                            .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    1227                            .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1228                            .dwattr $C$DW$91, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_party
    1229                            .dwattr $C$DW$91, DW_AT_decl_line(0x1c6)
    1230                            .dwattr $C$DW$91, DW_AT_decl_column(0x12)
    1231                    
    1232                    $C$DW$92        .dwtag  DW_TAG_member
    1233                            .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$33)
    1234                            .dwattr $C$DW$92, DW_AT_name("AFSR")
    1235                            .dwattr $C$DW$92, DW_AT_TI_symbol_name("AFSR")
    1236                            .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    1237                            .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1238                            .dwattr $C$DW$92, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_party
    1239                            .dwattr $C$DW$92, DW_AT_decl_line(0x1c7)
    1240                            .dwattr $C$DW$92, DW_AT_decl_column(0x12)
    1241                    
    1242                    $C$DW$93        .dwtag  DW_TAG_member
    1243                            .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$45)
    1244                            .dwattr $C$DW$93, DW_AT_name("PFR")
    1245                            .dwattr $C$DW$93, DW_AT_TI_symbol_name("PFR")
    1246                            .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    1247                            .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1248                            .dwattr $C$DW$93, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_party
    1249                            .dwattr $C$DW$93, DW_AT_decl_line(0x1c8)
    1250                            .dwattr $C$DW$93, DW_AT_decl_column(0x12)
    1251                    
    1252                    $C$DW$94        .dwtag  DW_TAG_member
    1253                            .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$43)
    1254                            .dwattr $C$DW$94, DW_AT_name("DFR")
    1255                            .dwattr $C$DW$94, DW_AT_TI_symbol_name("DFR")
    1256                            .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    1257                            .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1258                            .dwattr $C$DW$94, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_party
    1259                            .dwattr $C$DW$94, DW_AT_decl_line(0x1c9)
    1260                            .dwattr $C$DW$94, DW_AT_decl_column(0x12)
    1261                    
    1262                    $C$DW$95        .dwtag  DW_TAG_member
    1263                            .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$43)
    1264                            .dwattr $C$DW$95, DW_AT_name("ADR")
TI ARM Assembler PC v18.12.2 Sat Dec 14 17:40:32 2019

Copyright (c) 1996-2018 Texas Instruments Incorporated
CRC.asm                                                              PAGE   24

    1265                            .dwattr $C$DW$95, DW_AT_TI_symbol_name("ADR")
    1266                            .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
    1267                            .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1268                            .dwattr $C$DW$95, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_party
    1269                            .dwattr $C$DW$95, DW_AT_decl_line(0x1ca)
    1270                            .dwattr $C$DW$95, DW_AT_decl_column(0x12)
    1271                    
    1272                    $C$DW$96        .dwtag  DW_TAG_member
    1273                            .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$46)
    1274                            .dwattr $C$DW$96, DW_AT_name("MMFR")
    1275                            .dwattr $C$DW$96, DW_AT_TI_symbol_name("MMFR")
    1276                            .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    1277                            .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1278                            .dwattr $C$DW$96, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_party
    1279                            .dwattr $C$DW$96, DW_AT_decl_line(0x1cb)
    1280                            .dwattr $C$DW$96, DW_AT_decl_column(0x12)
    1281                    
    1282                    $C$DW$97        .dwtag  DW_TAG_member
    1283                            .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$47)
    1284                            .dwattr $C$DW$97, DW_AT_name("ISAR")
    1285                            .dwattr $C$DW$97, DW_AT_TI_symbol_name("ISAR")
    1286                            .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    1287                            .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1288                            .dwattr $C$DW$97, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_party
    1289                            .dwattr $C$DW$97, DW_AT_decl_line(0x1cc)
    1290                            .dwattr $C$DW$97, DW_AT_decl_column(0x12)
    1291                    
    1292                    $C$DW$98        .dwtag  DW_TAG_member
    1293                            .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$48)
    1294                            .dwattr $C$DW$98, DW_AT_name("RESERVED0")
    1295                            .dwattr $C$DW$98, DW_AT_TI_symbol_name("RESERVED0")
    1296                            .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x74]
    1297                            .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1298                            .dwattr $C$DW$98, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_party
    1299                            .dwattr $C$DW$98, DW_AT_decl_line(0x1cd)
    1300                            .dwattr $C$DW$98, DW_AT_decl_column(0x12)
    1301                    
    1302                    $C$DW$99        .dwtag  DW_TAG_member
    1303                            .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$33)
    1304                            .dwattr $C$DW$99, DW_AT_name("CPACR")
    1305                            .dwattr $C$DW$99, DW_AT_TI_symbol_name("CPACR")
    1306                            .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x88]
    1307                            .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1308                            .dwattr $C$DW$99, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_party
    1309                            .dwattr $C$DW$99, DW_AT_decl_line(0x1ce)
    1310                            .dwattr $C$DW$99, DW_AT_decl_column(0x12)
    1311                    
    1312                            .dwattr $C$DW$T$49, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_par
    1313                            .dwattr $C$DW$T$49, DW_AT_decl_line(0x1b9)
    1314                            .dwattr $C$DW$T$49, DW_AT_decl_column(0x01)
    1315                            .dwendtag $C$DW$T$49
    1316                    
    1317                    $C$DW$T$188     .dwtag  DW_TAG_typedef
    1318                            .dwattr $C$DW$T$188, DW_AT_name("SCB_Type")
    1319                            .dwattr $C$DW$T$188, DW_AT_type(*$C$DW$T$49)
TI ARM Assembler PC v18.12.2 Sat Dec 14 17:40:32 2019

Copyright (c) 1996-2018 Texas Instruments Incorporated
CRC.asm                                                              PAGE   25

    1320                            .dwattr $C$DW$T$188, DW_AT_language(DW_LANG_C)
    1321                            .dwattr $C$DW$T$188, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_pa
    1322                            .dwattr $C$DW$T$188, DW_AT_decl_line(0x1cf)
    1323                            .dwattr $C$DW$T$188, DW_AT_decl_column(0x03)
    1324                    
    1325                    
    1326                    $C$DW$T$51      .dwtag  DW_TAG_structure_type
    1327                            .dwattr $C$DW$T$51, DW_AT_byte_size(0x0c)
    1328                    $C$DW$100       .dwtag  DW_TAG_member
    1329                            .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$50)
    1330                            .dwattr $C$DW$100, DW_AT_name("RESERVED0")
    1331                            .dwattr $C$DW$100, DW_AT_TI_symbol_name("RESERVED0")
    1332                            .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1333                            .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1334                            .dwattr $C$DW$100, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_part
    1335                            .dwattr $C$DW$100, DW_AT_decl_line(0x2d1)
    1336                            .dwattr $C$DW$100, DW_AT_decl_column(0x12)
    1337                    
    1338                    $C$DW$101       .dwtag  DW_TAG_member
    1339                            .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$43)
    1340                            .dwattr $C$DW$101, DW_AT_name("ICTR")
    1341                            .dwattr $C$DW$101, DW_AT_TI_symbol_name("ICTR")
    1342                            .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1343                            .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1344                            .dwattr $C$DW$101, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_part
    1345                            .dwattr $C$DW$101, DW_AT_decl_line(0x2d2)
    1346                            .dwattr $C$DW$101, DW_AT_decl_column(0x12)
    1347                    
    1348                    $C$DW$102       .dwtag  DW_TAG_member
    1349                            .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$33)
    1350                            .dwattr $C$DW$102, DW_AT_name("ACTLR")
    1351                            .dwattr $C$DW$102, DW_AT_TI_symbol_name("ACTLR")
    1352                            .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1353                            .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1354                            .dwattr $C$DW$102, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_part
    1355                            .dwattr $C$DW$102, DW_AT_decl_line(0x2d3)
    1356                            .dwattr $C$DW$102, DW_AT_decl_column(0x12)
    1357                    
    1358                            .dwattr $C$DW$T$51, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_par
    1359                            .dwattr $C$DW$T$51, DW_AT_decl_line(0x2d0)
    1360                            .dwattr $C$DW$T$51, DW_AT_decl_column(0x01)
    1361                            .dwendtag $C$DW$T$51
    1362                    
    1363                    $C$DW$T$189     .dwtag  DW_TAG_typedef
    1364                            .dwattr $C$DW$T$189, DW_AT_name("SCnSCB_Type")
    1365                            .dwattr $C$DW$T$189, DW_AT_type(*$C$DW$T$51)
    1366                            .dwattr $C$DW$T$189, DW_AT_language(DW_LANG_C)
    1367                            .dwattr $C$DW$T$189, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_pa
    1368                            .dwattr $C$DW$T$189, DW_AT_decl_line(0x2d4)
    1369                            .dwattr $C$DW$T$189, DW_AT_decl_column(0x03)
    1370                    
    1371                    
    1372                    $C$DW$T$52      .dwtag  DW_TAG_structure_type
    1373                            .dwattr $C$DW$T$52, DW_AT_byte_size(0x10)
    1374                    $C$DW$103       .dwtag  DW_TAG_member
TI ARM Assembler PC v18.12.2 Sat Dec 14 17:40:32 2019

Copyright (c) 1996-2018 Texas Instruments Incorporated
CRC.asm                                                              PAGE   26

    1375                            .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$33)
    1376                            .dwattr $C$DW$103, DW_AT_name("CTRL")
    1377                            .dwattr $C$DW$103, DW_AT_TI_symbol_name("CTRL")
    1378                            .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1379                            .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1380                            .dwattr $C$DW$103, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_part
    1381                            .dwattr $C$DW$103, DW_AT_decl_line(0x2f9)
    1382                            .dwattr $C$DW$103, DW_AT_decl_column(0x12)
    1383                    
    1384                    $C$DW$104       .dwtag  DW_TAG_member
    1385                            .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$33)
    1386                            .dwattr $C$DW$104, DW_AT_name("LOAD")
    1387                            .dwattr $C$DW$104, DW_AT_TI_symbol_name("LOAD")
    1388                            .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1389                            .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1390                            .dwattr $C$DW$104, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_part
    1391                            .dwattr $C$DW$104, DW_AT_decl_line(0x2fa)
    1392                            .dwattr $C$DW$104, DW_AT_decl_column(0x12)
    1393                    
    1394                    $C$DW$105       .dwtag  DW_TAG_member
    1395                            .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$33)
    1396                            .dwattr $C$DW$105, DW_AT_name("VAL")
    1397                            .dwattr $C$DW$105, DW_AT_TI_symbol_name("VAL")
    1398                            .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1399                            .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1400                            .dwattr $C$DW$105, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_part
    1401                            .dwattr $C$DW$105, DW_AT_decl_line(0x2fb)
    1402                            .dwattr $C$DW$105, DW_AT_decl_column(0x12)
    1403                    
    1404                    $C$DW$106       .dwtag  DW_TAG_member
    1405                            .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$43)
    1406                            .dwattr $C$DW$106, DW_AT_name("CALIB")
    1407                            .dwattr $C$DW$106, DW_AT_TI_symbol_name("CALIB")
    1408                            .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1409                            .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1410                            .dwattr $C$DW$106, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_part
    1411                            .dwattr $C$DW$106, DW_AT_decl_line(0x2fc)
    1412                            .dwattr $C$DW$106, DW_AT_decl_column(0x12)
    1413                    
    1414                            .dwattr $C$DW$T$52, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_par
    1415                            .dwattr $C$DW$T$52, DW_AT_decl_line(0x2f8)
    1416                            .dwattr $C$DW$T$52, DW_AT_decl_column(0x01)
    1417                            .dwendtag $C$DW$T$52
    1418                    
    1419                    $C$DW$T$190     .dwtag  DW_TAG_typedef
    1420                            .dwattr $C$DW$T$190, DW_AT_name("SysTick_Type")
    1421                            .dwattr $C$DW$T$190, DW_AT_type(*$C$DW$T$52)
    1422                            .dwattr $C$DW$T$190, DW_AT_language(DW_LANG_C)
    1423                            .dwattr $C$DW$T$190, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_pa
    1424                            .dwattr $C$DW$T$190, DW_AT_decl_line(0x2fd)
    1425                            .dwattr $C$DW$T$190, DW_AT_decl_column(0x03)
    1426                    
    1427                    
    1428                    $C$DW$T$60      .dwtag  DW_TAG_structure_type
    1429                            .dwattr $C$DW$T$60, DW_AT_byte_size(0x1000)
TI ARM Assembler PC v18.12.2 Sat Dec 14 17:40:32 2019

Copyright (c) 1996-2018 Texas Instruments Incorporated
CRC.asm                                                              PAGE   27

    1430                    $C$DW$107       .dwtag  DW_TAG_member
    1431                            .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$54)
    1432                            .dwattr $C$DW$107, DW_AT_name("PORT")
    1433                            .dwattr $C$DW$107, DW_AT_TI_symbol_name("PORT")
    1434                            .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1435                            .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1436                            .dwattr $C$DW$107, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_part
    1437                            .dwattr $C$DW$107, DW_AT_decl_line(0x332)
    1438                            .dwattr $C$DW$107, DW_AT_decl_column(0x06)
    1439                    
    1440                    $C$DW$108       .dwtag  DW_TAG_member
    1441                            .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$55)
    1442                            .dwattr $C$DW$108, DW_AT_name("RESERVED0")
    1443                            .dwattr $C$DW$108, DW_AT_TI_symbol_name("RESERVED0")
    1444                            .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x80]
    1445                            .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1446                            .dwattr $C$DW$108, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_part
    1447                            .dwattr $C$DW$108, DW_AT_decl_line(0x333)
    1448                            .dwattr $C$DW$108, DW_AT_decl_column(0x12)
    1449                    
    1450                    $C$DW$109       .dwtag  DW_TAG_member
    1451                            .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$33)
    1452                            .dwattr $C$DW$109, DW_AT_name("TER")
    1453                            .dwattr $C$DW$109, DW_AT_TI_symbol_name("TER")
    1454                            .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0xe00]
    1455                            .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1456                            .dwattr $C$DW$109, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_part
    1457                            .dwattr $C$DW$109, DW_AT_decl_line(0x334)
    1458                            .dwattr $C$DW$109, DW_AT_decl_column(0x12)
    1459                    
    1460                    $C$DW$110       .dwtag  DW_TAG_member
    1461                            .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$56)
    1462                            .dwattr $C$DW$110, DW_AT_name("RESERVED1")
    1463                            .dwattr $C$DW$110, DW_AT_TI_symbol_name("RESERVED1")
    1464                            .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0xe04]
    1465                            .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1466                            .dwattr $C$DW$110, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_part
    1467                            .dwattr $C$DW$110, DW_AT_decl_line(0x335)
    1468                            .dwattr $C$DW$110, DW_AT_decl_column(0x12)
    1469                    
    1470                    $C$DW$111       .dwtag  DW_TAG_member
    1471                            .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$33)
    1472                            .dwattr $C$DW$111, DW_AT_name("TPR")
    1473                            .dwattr $C$DW$111, DW_AT_TI_symbol_name("TPR")
    1474                            .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0xe40]
    1475                            .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1476                            .dwattr $C$DW$111, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_part
    1477                            .dwattr $C$DW$111, DW_AT_decl_line(0x336)
    1478                            .dwattr $C$DW$111, DW_AT_decl_column(0x12)
    1479                    
    1480                    $C$DW$112       .dwtag  DW_TAG_member
    1481                            .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$56)
    1482                            .dwattr $C$DW$112, DW_AT_name("RESERVED2")
    1483                            .dwattr $C$DW$112, DW_AT_TI_symbol_name("RESERVED2")
    1484                            .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0xe44]
TI ARM Assembler PC v18.12.2 Sat Dec 14 17:40:32 2019

Copyright (c) 1996-2018 Texas Instruments Incorporated
CRC.asm                                                              PAGE   28

    1485                            .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1486                            .dwattr $C$DW$112, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_part
    1487                            .dwattr $C$DW$112, DW_AT_decl_line(0x337)
    1488                            .dwattr $C$DW$112, DW_AT_decl_column(0x12)
    1489                    
    1490                    $C$DW$113       .dwtag  DW_TAG_member
    1491                            .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$33)
    1492                            .dwattr $C$DW$113, DW_AT_name("TCR")
    1493                            .dwattr $C$DW$113, DW_AT_TI_symbol_name("TCR")
    1494                            .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0xe80]
    1495                            .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1496                            .dwattr $C$DW$113, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_part
    1497                            .dwattr $C$DW$113, DW_AT_decl_line(0x338)
    1498                            .dwattr $C$DW$113, DW_AT_decl_column(0x12)
    1499                    
    1500                    $C$DW$114       .dwtag  DW_TAG_member
    1501                            .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$57)
    1502                            .dwattr $C$DW$114, DW_AT_name("RESERVED3")
    1503                            .dwattr $C$DW$114, DW_AT_TI_symbol_name("RESERVED3")
    1504                            .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0xe84]
    1505                            .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1506                            .dwattr $C$DW$114, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_part
    1507                            .dwattr $C$DW$114, DW_AT_decl_line(0x339)
    1508                            .dwattr $C$DW$114, DW_AT_decl_column(0x12)
    1509                    
    1510                    $C$DW$115       .dwtag  DW_TAG_member
    1511                            .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$58)
    1512                            .dwattr $C$DW$115, DW_AT_name("RESERVED4")
    1513                            .dwattr $C$DW$115, DW_AT_TI_symbol_name("RESERVED4")
    1514                            .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0xf04]
    1515                            .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1516                            .dwattr $C$DW$115, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_part
