TI ARM Assembler PC v18.12.2 Sat Dec 14 17:40:32 2019

Copyright (c) 1996-2018 Texas Instruments Incorporated
state_machine.asm                                                    PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM G3 C/C++ Codegen                                            PC v18.12.2.LTS *
       3                    ;* Date/Time created: Sat Dec 14 17:40:31 2019                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --embed
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../state_machine.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM G3 C/C++ Codegen PC v18.12.2.LTS Copyright (c) 199
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\Hp\workspace_v9_TIMSP432\BL_MASTER\Debug")
      13                    $C$DW$1 .dwtag  DW_TAG_variable
      14                            .dwattr $C$DW$1, DW_AT_name("buffer")

    2427                    
    2428                    $C$DW$154       .dwtag  DW_TAG_enumerator
    2429                            .dwattr $C$DW$154, DW_AT_name("ePROGRAMMING_DONE")
    2430                            .dwattr $C$DW$154, DW_AT_const_value(0x09)
    2431                            .dwattr $C$DW$154, DW_AT_decl_file("..\state_machine.h")
    2432                            .dwattr $C$DW$154, DW_AT_decl_line(0x1e)
    2433                            .dwattr $C$DW$154, DW_AT_decl_column(0x05)
    2434                    
    2435                    $C$DW$155       .dwtag  DW_TAG_enumerator
    2436                            .dwattr $C$DW$155, DW_AT_name("eChecksum_Error")
    2437                            .dwattr $C$DW$155, DW_AT_const_value(0x0a)
    2438                            .dwattr $C$DW$155, DW_AT_decl_file("..\state_machine.h")
    2439                            .dwattr $C$DW$155, DW_AT_decl_line(0x1f)
    2440                            .dwattr $C$DW$155, DW_AT_decl_column(0x05)
    2441                    
    2442                    $C$DW$156       .dwtag  DW_TAG_enumerator
TI ARM Assembler PC v18.12.2 Sat Dec 14 17:40:32 2019

Copyright (c) 1996-2018 Texas Instruments Incorporated
state_machine.asm                                                    PAGE   56

    2443                            .dwattr $C$DW$156, DW_AT_name("eError")
    2444                            .dwattr $C$DW$156, DW_AT_const_value(0x0b)
    2445                            .dwattr $C$DW$156, DW_AT_decl_file("..\state_machine.h")
    2446                            .dwattr $C$DW$156, DW_AT_decl_line(0x20)
    2447                            .dwattr $C$DW$156, DW_AT_decl_column(0x05)
    2448                    
    2449                            .dwattr $C$DW$T$23, DW_AT_decl_file("..\state_machine.h")
    2450                            .dwattr $C$DW$T$23, DW_AT_decl_line(0x14)
    2451                            .dwattr $C$DW$T$23, DW_AT_decl_column(0x0e)
    2452                            .dwendtag $C$DW$T$23
    2453                    
    2454                    $C$DW$T$24      .dwtag  DW_TAG_typedef
    2455                            .dwattr $C$DW$T$24, DW_AT_name("event_t")
    2456                            .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$T$23)
    2457                            .dwattr $C$DW$T$24, DW_AT_language(DW_LANG_C)
    2458                            .dwattr $C$DW$T$24, DW_AT_decl_file("..\state_machine.h")
    2459                            .dwattr $C$DW$T$24, DW_AT_decl_line(0x21)
    2460                            .dwattr $C$DW$T$24, DW_AT_decl_column(0x03)
    2461                    
    2462                    
    2463                    $C$DW$T$28      .dwtag  DW_TAG_enumeration_type
    2464                            .dwattr $C$DW$T$28, DW_AT_byte_size(0x01)
    2465                    $C$DW$157       .dwtag  DW_TAG_enumerator
    2466                            .dwattr $C$DW$157, DW_AT_name("errNO_Error")
    2467                            .dwattr $C$DW$157, DW_AT_const_value(0x00)
    2468                            .dwattr $C$DW$157, DW_AT_decl_file("..\common.h")
    2469                            .dwattr $C$DW$157, DW_AT_decl_line(0x13)
    2470                            .dwattr $C$DW$157, DW_AT_decl_column(0x05)
    2471                    
    2472                    $C$DW$158       .dwtag  DW_TAG_enumerator
    2473                            .dwattr $C$DW$158, DW_AT_name("errSM_Error")
    2474                            .dwattr $C$DW$158, DW_AT_const_value(0x01)
    2475                            .dwattr $C$DW$158, DW_AT_decl_file("..\common.h")
    2476                            .dwattr $C$DW$158, DW_AT_decl_line(0x14)
    2477                            .dwattr $C$DW$158, DW_AT_decl_column(0x05)
    2478                    
    2479                    $C$DW$159       .dwtag  DW_TAG_enumerator
    2480                            .dwattr $C$DW$159, DW_AT_name("errDisconnect")
    2481                            .dwattr $C$DW$159, DW_AT_const_value(0x02)
    2482                            .dwattr $C$DW$159, DW_AT_decl_file("..\common.h")
    2483                            .dwattr $C$DW$159, DW_AT_decl_line(0x15)
    2484                            .dwattr $C$DW$159, DW_AT_decl_column(0x05)
    2485                    
    2486                            .dwattr $C$DW$T$28, DW_AT_decl_file("..\common.h")
    2487                            .dwattr $C$DW$T$28, DW_AT_decl_line(0x12)
    2488                            .dwattr $C$DW$T$28, DW_AT_decl_column(0x0e)
    2489                            .dwendtag $C$DW$T$28
    2490                    
    2491                    $C$DW$T$29      .dwtag  DW_TAG_typedef
    2492                            .dwattr $C$DW$T$29, DW_AT_name("error_t")
    2493                            .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$28)
    2494                            .dwattr $C$DW$T$29, DW_AT_language(DW_LANG_C)
    2495                            .dwattr $C$DW$T$29, DW_AT_decl_file("..\common.h")
    2496                            .dwattr $C$DW$T$29, DW_AT_decl_line(0x16)
    2497                            .dwattr $C$DW$T$29, DW_AT_decl_column(0x03)
TI ARM Assembler PC v18.12.2 Sat Dec 14 17:40:32 2019

Copyright (c) 1996-2018 Texas Instruments Incorporated
state_machine.asm                                                    PAGE   57

    2498                    
    2499                    
    2500                    $C$DW$T$25      .dwtag  DW_TAG_structure_type
    2501                            .dwattr $C$DW$T$25, DW_AT_byte_size(0x02)
    2502                    $C$DW$160       .dwtag  DW_TAG_member
    2503                            .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$22)
    2504                            .dwattr $C$DW$160, DW_AT_name("state")
    2505                            .dwattr $C$DW$160, DW_AT_TI_symbol_name("state")
    2506                            .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2507                            .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    2508                            .dwattr $C$DW$160, DW_AT_decl_file("..\state_machine.h")
    2509                            .dwattr $C$DW$160, DW_AT_decl_line(0x2f)
    2510                            .dwattr $C$DW$160, DW_AT_decl_column(0x0d)
    2511                    
    2512                    $C$DW$161       .dwtag  DW_TAG_member
    2513                            .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$24)
    2514                            .dwattr $C$DW$161, DW_AT_name("event")
    2515                            .dwattr $C$DW$161, DW_AT_TI_symbol_name("event")
    2516                            .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2517                            .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    2518                            .dwattr $C$DW$161, DW_AT_decl_file("..\state_machine.h")
    2519                            .dwattr $C$DW$161, DW_AT_decl_line(0x30)
    2520                            .dwattr $C$DW$161, DW_AT_decl_column(0x0d)
    2521                    
    2522                            .dwattr $C$DW$T$25, DW_AT_decl_file("..\state_machine.h")
    2523                            .dwattr $C$DW$T$25, DW_AT_decl_line(0x2e)
    2524                            .dwattr $C$DW$T$25, DW_AT_decl_column(0x10)
    2525                            .dwendtag $C$DW$T$25
    2526                    
    2527                    $C$DW$T$195     .dwtag  DW_TAG_typedef
    2528                            .dwattr $C$DW$T$195, DW_AT_name("state_machine_t")
    2529                            .dwattr $C$DW$T$195, DW_AT_type(*$C$DW$T$25)
    2530                            .dwattr $C$DW$T$195, DW_AT_language(DW_LANG_C)
    2531                            .dwattr $C$DW$T$195, DW_AT_decl_file("..\state_machine.h")
    2532                            .dwattr $C$DW$T$195, DW_AT_decl_line(0x31)
    2533                            .dwattr $C$DW$T$195, DW_AT_decl_column(0x03)
    2534                    
    2535                    $C$DW$T$196     .dwtag  DW_TAG_pointer_type
    2536                            .dwattr $C$DW$T$196, DW_AT_type(*$C$DW$T$195)
    2537                            .dwattr $C$DW$T$196, DW_AT_address_class(0x20)
    2538                    
    2539                    
    2540                    $C$DW$T$30      .dwtag  DW_TAG_structure_type
    2541                            .dwattr $C$DW$T$30, DW_AT_byte_size(0x0b)
    2542                    $C$DW$162       .dwtag  DW_TAG_member
    2543                            .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$27)
    2544                            .dwattr $C$DW$162, DW_AT_name("reception_ready")
    2545                            .dwattr $C$DW$162, DW_AT_TI_symbol_name("reception_ready")
    2546                            .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2547                            .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    2548                            .dwattr $C$DW$162, DW_AT_decl_file("..\common.h")
    2549                            .dwattr $C$DW$162, DW_AT_decl_line(0x1a)
    2550                            .dwattr $C$DW$162, DW_AT_decl_column(0x0d)
    2551                    
    2552                    $C$DW$163       .dwtag  DW_TAG_member
TI ARM Assembler PC v18.12.2 Sat Dec 14 17:40:32 2019

Copyright (c) 1996-2018 Texas Instruments Incorporated
state_machine.asm                                                    PAGE   58

    2553                            .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$29)
    2554                            .dwattr $C$DW$163, DW_AT_name("error_flag")
    2555                            .dwattr $C$DW$163, DW_AT_TI_symbol_name("error_flag")
    2556                            .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2557                            .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    2558                            .dwattr $C$DW$163, DW_AT_decl_file("..\common.h")
    2559                            .dwattr $C$DW$163, DW_AT_decl_line(0x1b)
    2560                            .dwattr $C$DW$163, DW_AT_decl_column(0x0d)
    2561                    
    2562                    $C$DW$164       .dwtag  DW_TAG_member
    2563                            .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$27)
    2564                            .dwattr $C$DW$164, DW_AT_name("button_pressed")
    2565                            .dwattr $C$DW$164, DW_AT_TI_symbol_name("button_pressed")
    2566                            .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2567                            .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    2568                            .dwattr $C$DW$164, DW_AT_decl_file("..\common.h")
    2569                            .dwattr $C$DW$164, DW_AT_decl_line(0x1c)
    2570                            .dwattr $C$DW$164, DW_AT_decl_column(0x0d)
    2571                    
    2572                    $C$DW$165       .dwtag  DW_TAG_member
    2573                            .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$27)
    2574                            .dwattr $C$DW$165, DW_AT_name("PC_RX_Flag")
    2575                            .dwattr $C$DW$165, DW_AT_TI_symbol_name("PC_RX_Flag")
    2576                            .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2577                            .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    2578                            .dwattr $C$DW$165, DW_AT_decl_file("..\common.h")
    2579                            .dwattr $C$DW$165, DW_AT_decl_line(0x1d)
    2580                            .dwattr $C$DW$165, DW_AT_decl_column(0x0d)
    2581                    
    2582                    $C$DW$166       .dwtag  DW_TAG_member
    2583                            .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$27)
    2584                            .dwattr $C$DW$166, DW_AT_name("Checksum_Failure")
    2585                            .dwattr $C$DW$166, DW_AT_TI_symbol_name("Checksum_Failure")
    2586                            .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2587                            .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    2588                            .dwattr $C$DW$166, DW_AT_decl_file("..\common.h")
    2589                            .dwattr $C$DW$166, DW_AT_decl_line(0x1e)
    2590                            .dwattr $C$DW$166, DW_AT_decl_column(0x0d)
    2591                    
    2592                    $C$DW$167       .dwtag  DW_TAG_member
    2593                            .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$27)
    2594                            .dwattr $C$DW$167, DW_AT_name("CRC_Failure")
    2595                            .dwattr $C$DW$167, DW_AT_TI_symbol_name("CRC_Failure")
    2596                            .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2597                            .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    2598                            .dwattr $C$DW$167, DW_AT_decl_file("..\common.h")
    2599                            .dwattr $C$DW$167, DW_AT_decl_line(0x1f)
    2600                            .dwattr $C$DW$167, DW_AT_decl_column(0x0d)
    2601                    
    2602                    $C$DW$168       .dwtag  DW_TAG_member
    2603                            .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$27)
    2604                            .dwattr $C$DW$168, DW_AT_name("RX_Complete")
    2605                            .dwattr $C$DW$168, DW_AT_TI_symbol_name("RX_Complete")
    2606                            .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2607                            .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v18.12.2 Sat Dec 14 17:40:32 2019

Copyright (c) 1996-2018 Texas Instruments Incorporated
state_machine.asm                                                    PAGE   59

    2608                            .dwattr $C$DW$168, DW_AT_decl_file("..\common.h")
    2609                            .dwattr $C$DW$168, DW_AT_decl_line(0x20)
    2610                            .dwattr $C$DW$168, DW_AT_decl_column(0x0d)
    2611                    
    2612                    $C$DW$169       .dwtag  DW_TAG_member
    2613                            .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$27)
    2614                            .dwattr $C$DW$169, DW_AT_name("response")
    2615                            .dwattr $C$DW$169, DW_AT_TI_symbol_name("response")
    2616                            .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    2617                            .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    2618                            .dwattr $C$DW$169, DW_AT_decl_file("..\common.h")
    2619                            .dwattr $C$DW$169, DW_AT_decl_line(0x21)
    2620                            .dwattr $C$DW$169, DW_AT_decl_column(0x0d)
    2621                    
    2622                    $C$DW$170       .dwtag  DW_TAG_member
    2623                            .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$27)
    2624                            .dwattr $C$DW$170, DW_AT_name("RX_Response")
    2625                            .dwattr $C$DW$170, DW_AT_TI_symbol_name("RX_Response")
    2626                            .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2627                            .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    2628                            .dwattr $C$DW$170, DW_AT_decl_file("..\common.h")
    2629                            .dwattr $C$DW$170, DW_AT_decl_line(0x22)
    2630                            .dwattr $C$DW$170, DW_AT_decl_column(0x0d)
    2631                    
    2632                    $C$DW$171       .dwtag  DW_TAG_member
    2633                            .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$27)
    2634                            .dwattr $C$DW$171, DW_AT_name("TX_Flag")
    2635                            .dwattr $C$DW$171, DW_AT_TI_symbol_name("TX_Flag")
    2636                            .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    2637                            .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    2638                            .dwattr $C$DW$171, DW_AT_decl_file("..\common.h")
    2639                            .dwattr $C$DW$171, DW_AT_decl_line(0x23)
    2640                            .dwattr $C$DW$171, DW_AT_decl_column(0x0d)
    2641                    
    2642                    $C$DW$172       .dwtag  DW_TAG_member
    2643                            .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$27)
    2644                            .dwattr $C$DW$172, DW_AT_name("All_Ok")
    2645                            .dwattr $C$DW$172, DW_AT_TI_symbol_name("All_Ok")
    2646                            .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2647                            .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    2648                            .dwattr $C$DW$172, DW_AT_decl_file("..\common.h")
    2649                            .dwattr $C$DW$172, DW_AT_decl_line(0x24)
    2650                            .dwattr $C$DW$172, DW_AT_decl_column(0x0d)
    2651                    
    2652                            .dwattr $C$DW$T$30, DW_AT_decl_file("..\common.h")
    2653                            .dwattr $C$DW$T$30, DW_AT_decl_line(0x19)
    2654                            .dwattr $C$DW$T$30, DW_AT_decl_column(0x10)
    2655                            .dwendtag $C$DW$T$30
    2656                    
    2657                    $C$DW$T$198     .dwtag  DW_TAG_typedef
    2658                            .dwattr $C$DW$T$198, DW_AT_name("full_system_state_t")
    2659                            .dwattr $C$DW$T$198, DW_AT_type(*$C$DW$T$30)
    2660                            .dwattr $C$DW$T$198, DW_AT_language(DW_LANG_C)
    2661                            .dwattr $C$DW$T$198, DW_AT_decl_file("..\common.h")
    2662                            .dwattr $C$DW$T$198, DW_AT_decl_line(0x26)
TI ARM Assembler PC v18.12.2 Sat Dec 14 17:40:32 2019

Copyright (c) 1996-2018 Texas Instruments Incorporated
state_machine.asm                                                    PAGE   60

    2663                            .dwattr $C$DW$T$198, DW_AT_decl_column(0x03)
    2664                    
    2665                    $C$DW$T$199     .dwtag  DW_TAG_pointer_type
    2666                            .dwattr $C$DW$T$199, DW_AT_type(*$C$DW$T$198)
    2667                            .dwattr $C$DW$T$199, DW_AT_address_class(0x20)
    2668                    
    2669                    
    2670                    $C$DW$T$36      .dwtag  DW_TAG_structure_type
    2671                            .dwattr $C$DW$T$36, DW_AT_byte_size(0x20)
    2672                    $C$DW$173       .dwtag  DW_TAG_member
    2673                            .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$33)
    2674                            .dwattr $C$DW$173, DW_AT_name("CTLW0")
    2675                            .dwattr $C$DW$173, DW_AT_TI_symbol_name("CTLW0")
    2676                            .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2677                            .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    2678                            .dwattr $C$DW$173, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices
    2679                            .dwattr $C$DW$173, DW_AT_decl_line(0x2f2)
    2680                            .dwattr $C$DW$173, DW_AT_decl_column(0x11)
    2681                    
    2682                    $C$DW$174       .dwtag  DW_TAG_member
    2683                            .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$33)
    2684                            .dwattr $C$DW$174, DW_AT_name("CTLW1")
    2685                            .dwattr $C$DW$174, DW_AT_TI_symbol_name("CTLW1")
    2686                            .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2687                            .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    2688                            .dwattr $C$DW$174, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices
    2689                            .dwattr $C$DW$174, DW_AT_decl_line(0x2f3)
    2690                            .dwattr $C$DW$174, DW_AT_decl_column(0x11)
    2691                    
    2692                    $C$DW$175       .dwtag  DW_TAG_member
    2693                            .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$32)
    2694                            .dwattr $C$DW$175, DW_AT_name("RESERVED0")
    2695                            .dwattr $C$DW$175, DW_AT_TI_symbol_name("RESERVED0")
    2696                            .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2697                            .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    2698                            .dwattr $C$DW$175, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices
    2699                            .dwattr $C$DW$175, DW_AT_decl_line(0x2f4)
    2700                            .dwattr $C$DW$175, DW_AT_decl_column(0x11)
    2701                    
    2702                    $C$DW$176       .dwtag  DW_TAG_member
    2703                            .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$33)
    2704                            .dwattr $C$DW$176, DW_AT_name("BRW")
    2705                            .dwattr $C$DW$176, DW_AT_TI_symbol_name("BRW")
    2706                            .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2707                            .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    2708                            .dwattr $C$DW$176, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices
    2709                            .dwattr $C$DW$176, DW_AT_decl_line(0x2f5)
    2710                            .dwattr $C$DW$176, DW_AT_decl_column(0x11)
    2711                    
    2712                    $C$DW$177       .dwtag  DW_TAG_member
    2713                            .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$33)
    2714                            .dwattr $C$DW$177, DW_AT_name("MCTLW")
    2715                            .dwattr $C$DW$177, DW_AT_TI_symbol_name("MCTLW")
    2716                            .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2717                            .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v18.12.2 Sat Dec 14 17:40:32 2019

Copyright (c) 1996-2018 Texas Instruments Incorporated
state_machine.asm                                                    PAGE   61

    2718                            .dwattr $C$DW$177, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices
    2719                            .dwattr $C$DW$177, DW_AT_decl_line(0x2f6)
    2720                            .dwattr $C$DW$177, DW_AT_decl_column(0x11)
    2721                    
    2722                    $C$DW$178       .dwtag  DW_TAG_member
    2723                            .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$33)
    2724                            .dwattr $C$DW$178, DW_AT_name("STATW")
    2725                            .dwattr $C$DW$178, DW_AT_TI_symbol_name("STATW")
    2726                            .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2727                            .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    2728                            .dwattr $C$DW$178, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices
    2729                            .dwattr $C$DW$178, DW_AT_decl_line(0x2f7)
    2730                            .dwattr $C$DW$178, DW_AT_decl_column(0x11)
    2731                    
    2732                    $C$DW$179       .dwtag  DW_TAG_member
    2733                            .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$34)
    2734                            .dwattr $C$DW$179, DW_AT_name("RXBUF")
    2735                            .dwattr $C$DW$179, DW_AT_TI_symbol_name("RXBUF")
    2736                            .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2737                            .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    2738                            .dwattr $C$DW$179, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices
    2739                            .dwattr $C$DW$179, DW_AT_decl_line(0x2f8)
    2740                            .dwattr $C$DW$179, DW_AT_decl_column(0x11)
    2741                    
    2742                    $C$DW$180       .dwtag  DW_TAG_member
    2743                            .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$33)
    2744                            .dwattr $C$DW$180, DW_AT_name("TXBUF")
    2745                            .dwattr $C$DW$180, DW_AT_TI_symbol_name("TXBUF")
    2746                            .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    2747                            .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    2748                            .dwattr $C$DW$180, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices
    2749                            .dwattr $C$DW$180, DW_AT_decl_line(0x2f9)
    2750                            .dwattr $C$DW$180, DW_AT_decl_column(0x11)
    2751                    
    2752                    $C$DW$181       .dwtag  DW_TAG_member
    2753                            .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$33)
    2754                            .dwattr $C$DW$181, DW_AT_name("ABCTL")
    2755                            .dwattr $C$DW$181, DW_AT_TI_symbol_name("ABCTL")
    2756                            .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2757                            .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    2758                            .dwattr $C$DW$181, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices
    2759                            .dwattr $C$DW$181, DW_AT_decl_line(0x2fa)
    2760                            .dwattr $C$DW$181, DW_AT_decl_column(0x11)
    2761                    
    2762                    $C$DW$182       .dwtag  DW_TAG_member
    2763                            .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$33)
    2764                            .dwattr $C$DW$182, DW_AT_name("IRCTL")
    2765                            .dwattr $C$DW$182, DW_AT_TI_symbol_name("IRCTL")
    2766                            .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    2767                            .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    2768                            .dwattr $C$DW$182, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices
    2769                            .dwattr $C$DW$182, DW_AT_decl_line(0x2fb)
    2770                            .dwattr $C$DW$182, DW_AT_decl_column(0x11)
    2771                    
    2772                    $C$DW$183       .dwtag  DW_TAG_member
TI ARM Assembler PC v18.12.2 Sat Dec 14 17:40:32 2019

Copyright (c) 1996-2018 Texas Instruments Incorporated
state_machine.asm                                                    PAGE   62

    2773                            .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$35)
    2774                            .dwattr $C$DW$183, DW_AT_name("RESERVED1")
    2775                            .dwattr $C$DW$183, DW_AT_TI_symbol_name("RESERVED1")
    2776                            .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2777                            .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    2778                            .dwattr $C$DW$183, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices
    2779                            .dwattr $C$DW$183, DW_AT_decl_line(0x2fc)
    2780                            .dwattr $C$DW$183, DW_AT_decl_column(0x11)
    2781                    
    2782                    $C$DW$184       .dwtag  DW_TAG_member
    2783                            .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$33)
    2784                            .dwattr $C$DW$184, DW_AT_name("IE")
    2785                            .dwattr $C$DW$184, DW_AT_TI_symbol_name("IE")
    2786                            .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    2787                            .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    2788                            .dwattr $C$DW$184, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices
    2789                            .dwattr $C$DW$184, DW_AT_decl_line(0x2fd)
    2790                            .dwattr $C$DW$184, DW_AT_decl_column(0x11)
    2791                    
    2792                    $C$DW$185       .dwtag  DW_TAG_member
    2793                            .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$33)
    2794                            .dwattr $C$DW$185, DW_AT_name("IFG")
    2795                            .dwattr $C$DW$185, DW_AT_TI_symbol_name("IFG")
    2796                            .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    2797                            .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    2798                            .dwattr $C$DW$185, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices
    2799                            .dwattr $C$DW$185, DW_AT_decl_line(0x2fe)
    2800                            .dwattr $C$DW$185, DW_AT_decl_column(0x11)
    2801                    
    2802                    $C$DW$186       .dwtag  DW_TAG_member
    2803                            .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$34)
    2804                            .dwattr $C$DW$186, DW_AT_name("IV")
    2805                            .dwattr $C$DW$186, DW_AT_TI_symbol_name("IV")
    2806                            .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    2807                            .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    2808                            .dwattr $C$DW$186, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices
    2809                            .dwattr $C$DW$186, DW_AT_decl_line(0x2ff)
    2810                            .dwattr $C$DW$186, DW_AT_decl_column(0x11)
    2811                    
    2812                            .dwattr $C$DW$T$36, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\device
    2813                            .dwattr $C$DW$T$36, DW_AT_decl_line(0x2f1)
    2814                            .dwattr $C$DW$T$36, DW_AT_decl_column(0x10)
    2815                            .dwendtag $C$DW$T$36
    2816                    
    2817                    $C$DW$T$200     .dwtag  DW_TAG_typedef
    2818                            .dwattr $C$DW$T$200, DW_AT_name("EUSCI_A_Type")
    2819                            .dwattr $C$DW$T$200, DW_AT_type(*$C$DW$T$36)
    2820                            .dwattr $C$DW$T$200, DW_AT_language(DW_LANG_C)
    2821                            .dwattr $C$DW$T$200, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devic
    2822                            .dwattr $C$DW$T$200, DW_AT_decl_line(0x300)
    2823                            .dwattr $C$DW$T$200, DW_AT_decl_column(0x03)
    2824                    
    2825                    
    2826                    $C$DW$T$40      .dwtag  DW_TAG_structure_type
    2827                            .dwattr $C$DW$T$40, DW_AT_byte_size(0x1e)
TI ARM Assembler PC v18.12.2 Sat Dec 14 17:40:32 2019

Copyright (c) 1996-2018 Texas Instruments Incorporated
state_machine.asm                                                    PAGE   63

    2828                    $C$DW$187       .dwtag  DW_TAG_member
    2829                            .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$37)
    2830                            .dwattr $C$DW$187, DW_AT_name("IN")
    2831                            .dwattr $C$DW$187, DW_AT_TI_symbol_name("IN")
    2832                            .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2833                            .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    2834                            .dwattr $C$DW$187, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices
    2835                            .dwattr $C$DW$187, DW_AT_decl_line(0x288)
    2836                            .dwattr $C$DW$187, DW_AT_decl_column(0x0f)
    2837                    
    2838                    $C$DW$188       .dwtag  DW_TAG_member
    2839                            .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$27)
    2840                            .dwattr $C$DW$188, DW_AT_name("RESERVED0")
    2841                            .dwattr $C$DW$188, DW_AT_TI_symbol_name("RESERVED0")
    2842                            .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2843                            .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    2844                            .dwattr $C$DW$188, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices
    2845                            .dwattr $C$DW$188, DW_AT_decl_line(0x289)
    2846                            .dwattr $C$DW$188, DW_AT_decl_column(0x0b)
    2847                    
    2848                    $C$DW$189       .dwtag  DW_TAG_member
    2849                            .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$38)
    2850                            .dwattr $C$DW$189, DW_AT_name("OUT")
    2851                            .dwattr $C$DW$189, DW_AT_TI_symbol_name("OUT")
    2852                            .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2853                            .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    2854                            .dwattr $C$DW$189, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices
    2855                            .dwattr $C$DW$189, DW_AT_decl_line(0x28a)
    2856                            .dwattr $C$DW$189, DW_AT_decl_column(0x10)
    2857                    
    2858                    $C$DW$190       .dwtag  DW_TAG_member
    2859                            .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$27)
    2860                            .dwattr $C$DW$190, DW_AT_name("RESERVED1")
    2861                            .dwattr $C$DW$190, DW_AT_TI_symbol_name("RESERVED1")
    2862                            .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2863                            .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    2864                            .dwattr $C$DW$190, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices
    2865                            .dwattr $C$DW$190, DW_AT_decl_line(0x28b)
    2866                            .dwattr $C$DW$190, DW_AT_decl_column(0x0b)
    2867                    
    2868                    $C$DW$191       .dwtag  DW_TAG_member
    2869                            .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$38)
    2870                            .dwattr $C$DW$191, DW_AT_name("DIR")
    2871                            .dwattr $C$DW$191, DW_AT_TI_symbol_name("DIR")
    2872                            .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2873                            .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    2874                            .dwattr $C$DW$191, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices
    2875                            .dwattr $C$DW$191, DW_AT_decl_line(0x28c)
    2876                            .dwattr $C$DW$191, DW_AT_decl_column(0x10)
    2877                    
    2878                    $C$DW$192       .dwtag  DW_TAG_member
    2879                            .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$27)
    2880                            .dwattr $C$DW$192, DW_AT_name("RESERVED2")
    2881                            .dwattr $C$DW$192, DW_AT_TI_symbol_name("RESERVED2")
    2882                            .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
TI ARM Assembler PC v18.12.2 Sat Dec 14 17:40:32 2019

Copyright (c) 1996-2018 Texas Instruments Incorporated
state_machine.asm                                                    PAGE   64

    2883                            .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    2884                            .dwattr $C$DW$192, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices
    2885                            .dwattr $C$DW$192, DW_AT_decl_line(0x28d)
    2886                            .dwattr $C$DW$192, DW_AT_decl_column(0x0b)
    2887                    
    2888                    $C$DW$193       .dwtag  DW_TAG_member
    2889                            .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$38)
    2890                            .dwattr $C$DW$193, DW_AT_name("REN")
    2891                            .dwattr $C$DW$193, DW_AT_TI_symbol_name("REN")
    2892                            .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2893                            .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    2894                            .dwattr $C$DW$193, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices
    2895                            .dwattr $C$DW$193, DW_AT_decl_line(0x28e)
    2896                            .dwattr $C$DW$193, DW_AT_decl_column(0x10)
    2897                    
    2898                    $C$DW$194       .dwtag  DW_TAG_member
    2899                            .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$27)
    2900                            .dwattr $C$DW$194, DW_AT_name("RESERVED3")
    2901                            .dwattr $C$DW$194, DW_AT_TI_symbol_name("RESERVED3")
    2902                            .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    2903                            .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    2904                            .dwattr $C$DW$194, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices
    2905                            .dwattr $C$DW$194, DW_AT_decl_line(0x28f)
    2906                            .dwattr $C$DW$194, DW_AT_decl_column(0x0b)
    2907                    
    2908                    $C$DW$195       .dwtag  DW_TAG_member
    2909                            .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$38)
    2910                            .dwattr $C$DW$195, DW_AT_name("DS")
    2911                            .dwattr $C$DW$195, DW_AT_TI_symbol_name("DS")
    2912                            .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2913                            .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    2914                            .dwattr $C$DW$195, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices
    2915                            .dwattr $C$DW$195, DW_AT_decl_line(0x290)
    2916                            .dwattr $C$DW$195, DW_AT_decl_column(0x10)
    2917                    
    2918                    $C$DW$196       .dwtag  DW_TAG_member
    2919                            .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$27)
    2920                            .dwattr $C$DW$196, DW_AT_name("RESERVED4")
    2921                            .dwattr $C$DW$196, DW_AT_TI_symbol_name("RESERVED4")
    2922                            .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    2923                            .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    2924                            .dwattr $C$DW$196, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices
    2925                            .dwattr $C$DW$196, DW_AT_decl_line(0x291)
    2926                            .dwattr $C$DW$196, DW_AT_decl_column(0x0b)
    2927                    
    2928                    $C$DW$197       .dwtag  DW_TAG_member
    2929                            .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$38)
    2930                            .dwattr $C$DW$197, DW_AT_name("SEL0")
    2931                            .dwattr $C$DW$197, DW_AT_TI_symbol_name("SEL0")
    2932                            .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2933                            .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    2934                            .dwattr $C$DW$197, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices
    2935                            .dwattr $C$DW$197, DW_AT_decl_line(0x292)
    2936                            .dwattr $C$DW$197, DW_AT_decl_column(0x10)
    2937                    
TI ARM Assembler PC v18.12.2 Sat Dec 14 17:40:32 2019

Copyright (c) 1996-2018 Texas Instruments Incorporated
state_machine.asm                                                    PAGE   65

    2938                    $C$DW$198       .dwtag  DW_TAG_member
    2939                            .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$27)
    2940                            .dwattr $C$DW$198, DW_AT_name("RESERVED5")
    2941                            .dwattr $C$DW$198, DW_AT_TI_symbol_name("RESERVED5")
    2942                            .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    2943                            .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    2944                            .dwattr $C$DW$198, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices
    2945                            .dwattr $C$DW$198, DW_AT_decl_line(0x293)
    2946                            .dwattr $C$DW$198, DW_AT_decl_column(0x0b)
    2947                    
    2948                    $C$DW$199       .dwtag  DW_TAG_member
    2949                            .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$38)
    2950                            .dwattr $C$DW$199, DW_AT_name("SEL1")
    2951                            .dwattr $C$DW$199, DW_AT_TI_symbol_name("SEL1")
    2952                            .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2953                            .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    2954                            .dwattr $C$DW$199, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices
    2955                            .dwattr $C$DW$199, DW_AT_decl_line(0x294)
    2956                            .dwattr $C$DW$199, DW_AT_decl_column(0x10)
    2957                    
    2958                    $C$DW$200       .dwtag  DW_TAG_member
    2959                            .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$27)
    2960                            .dwattr $C$DW$200, DW_AT_name("RESERVED6")
    2961                            .dwattr $C$DW$200, DW_AT_TI_symbol_name("RESERVED6")
    2962                            .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    2963                            .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    2964                            .dwattr $C$DW$200, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices
    2965                            .dwattr $C$DW$200, DW_AT_decl_line(0x295)
    2966                            .dwattr $C$DW$200, DW_AT_decl_column(0x0b)
    2967                    
    2968                    $C$DW$201       .dwtag  DW_TAG_member
    2969                            .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$34)
    2970                            .dwattr $C$DW$201, DW_AT_name("IV")
    2971                            .dwattr $C$DW$201, DW_AT_TI_symbol_name("IV")
    2972                            .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    2973                            .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    2974                            .dwattr $C$DW$201, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices
    2975                            .dwattr $C$DW$201, DW_AT_decl_line(0x296)
    2976                            .dwattr $C$DW$201, DW_AT_decl_column(0x11)
    2977                    
    2978                    $C$DW$202       .dwtag  DW_TAG_member
    2979                            .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$39)
    2980                            .dwattr $C$DW$202, DW_AT_name("RESERVED7")
    2981                            .dwattr $C$DW$202, DW_AT_TI_symbol_name("RESERVED7")
    2982                            .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2983                            .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    2984                            .dwattr $C$DW$202, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices
    2985                            .dwattr $C$DW$202, DW_AT_decl_line(0x297)
    2986                            .dwattr $C$DW$202, DW_AT_decl_column(0x0b)
    2987                    
    2988                    $C$DW$203       .dwtag  DW_TAG_member
    2989                            .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$38)
    2990                            .dwattr $C$DW$203, DW_AT_name("SELC")
    2991                            .dwattr $C$DW$203, DW_AT_TI_symbol_name("SELC")
    2992                            .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
TI ARM Assembler PC v18.12.2 Sat Dec 14 17:40:32 2019

Copyright (c) 1996-2018 Texas Instruments Incorporated
state_machine.asm                                                    PAGE   66

    2993                            .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    2994                            .dwattr $C$DW$203, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices
    2995                            .dwattr $C$DW$203, DW_AT_decl_line(0x298)
    2996                            .dwattr $C$DW$203, DW_AT_decl_column(0x10)
    2997                    
    2998                    $C$DW$204       .dwtag  DW_TAG_member
    2999                            .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$27)
    3000                            .dwattr $C$DW$204, DW_AT_name("RESERVED8")
    3001                            .dwattr $C$DW$204, DW_AT_TI_symbol_name("RESERVED8")
    3002                            .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    3003                            .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    3004                            .dwattr $C$DW$204, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices
    3005                            .dwattr $C$DW$204, DW_AT_decl_line(0x299)
    3006                            .dwattr $C$DW$204, DW_AT_decl_column(0x0b)
    3007                    
    3008                    $C$DW$205       .dwtag  DW_TAG_member
    3009                            .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$38)
    3010                            .dwattr $C$DW$205, DW_AT_name("IES")
    3011                            .dwattr $C$DW$205, DW_AT_TI_symbol_name("IES")
    3012                            .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3013                            .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    3014                            .dwattr $C$DW$205, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices
    3015                            .dwattr $C$DW$205, DW_AT_decl_line(0x29a)
    3016                            .dwattr $C$DW$205, DW_AT_decl_column(0x10)
    3017                    
    3018                    $C$DW$206       .dwtag  DW_TAG_member
    3019                            .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$27)
    3020                            .dwattr $C$DW$206, DW_AT_name("RESERVED9")
    3021                            .dwattr $C$DW$206, DW_AT_TI_symbol_name("RESERVED9")
    3022                            .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    3023                            .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    3024                            .dwattr $C$DW$206, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices
    3025                            .dwattr $C$DW$206, DW_AT_decl_line(0x29b)
    3026                            .dwattr $C$DW$206, DW_AT_decl_column(0x0b)
    3027                    
    3028                    $C$DW$207       .dwtag  DW_TAG_member
    3029                            .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$38)
    3030                            .dwattr $C$DW$207, DW_AT_name("IE")
    3031                            .dwattr $C$DW$207, DW_AT_TI_symbol_name("IE")
    3032                            .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    3033                            .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    3034                            .dwattr $C$DW$207, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices
    3035                            .dwattr $C$DW$207, DW_AT_decl_line(0x29c)
    3036                            .dwattr $C$DW$207, DW_AT_decl_column(0x10)
    3037                    
    3038                    $C$DW$208       .dwtag  DW_TAG_member
    3039                            .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$27)
    3040                            .dwattr $C$DW$208, DW_AT_name("RESERVED10")
    3041                            .dwattr $C$DW$208, DW_AT_TI_symbol_name("RESERVED10")
    3042                            .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    3043                            .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
    3044                            .dwattr $C$DW$208, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices
    3045                            .dwattr $C$DW$208, DW_AT_decl_line(0x29d)
    3046                            .dwattr $C$DW$208, DW_AT_decl_column(0x0b)
    3047                    
TI ARM Assembler PC v18.12.2 Sat Dec 14 17:40:32 2019

Copyright (c) 1996-2018 Texas Instruments Incorporated
state_machine.asm                                                    PAGE   67

    3048                    $C$DW$209       .dwtag  DW_TAG_member
    3049                            .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$38)
    3050                            .dwattr $C$DW$209, DW_AT_name("IFG")
    3051                            .dwattr $C$DW$209, DW_AT_TI_symbol_name("IFG")
    3052                            .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    3053                            .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
    3054                            .dwattr $C$DW$209, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices
    3055                            .dwattr $C$DW$209, DW_AT_decl_line(0x29e)
    3056                            .dwattr $C$DW$209, DW_AT_decl_column(0x10)
    3057                    
    3058                    $C$DW$210       .dwtag  DW_TAG_member
    3059                            .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$27)
    3060                            .dwattr $C$DW$210, DW_AT_name("RESERVED11")
    3061                            .dwattr $C$DW$210, DW_AT_TI_symbol_name("RESERVED11")
    3062                            .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    3063                            .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
    3064                            .dwattr $C$DW$210, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices
    3065                            .dwattr $C$DW$210, DW_AT_decl_line(0x29f)
    3066                            .dwattr $C$DW$210, DW_AT_decl_column(0x0b)
    3067                    
    3068                            .dwattr $C$DW$T$40, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\device
    3069                            .dwattr $C$DW$T$40, DW_AT_decl_line(0x287)
    3070                            .dwattr $C$DW$T$40, DW_AT_decl_column(0x10)
    3071                            .dwendtag $C$DW$T$40
    3072                    
    3073                    $C$DW$T$202     .dwtag  DW_TAG_typedef
    3074                            .dwattr $C$DW$T$202, DW_AT_name("DIO_PORT_Odd_Interruptable_Type")
    3075                            .dwattr $C$DW$T$202, DW_AT_type(*$C$DW$T$40)
    3076                            .dwattr $C$DW$T$202, DW_AT_language(DW_LANG_C)
    3077                            .dwattr $C$DW$T$202, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devic
    3078                            .dwattr $C$DW$T$202, DW_AT_decl_line(0x2a0)
    3079                            .dwattr $C$DW$T$202, DW_AT_decl_column(0x03)
    3080                    
    3081                    
    3082                    $C$DW$T$41      .dwtag  DW_TAG_structure_type
    3083                            .dwattr $C$DW$T$41, DW_AT_byte_size(0x08)
    3084                    $C$DW$211       .dwtag  DW_TAG_member
    3085                            .dwattr $C$DW$211, DW_AT_type(*$C$DW$T$10)
    3086                            .dwattr $C$DW$211, DW_AT_name("quot")
    3087                            .dwattr $C$DW$211, DW_AT_TI_symbol_name("quot")
    3088                            .dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3089                            .dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
    3090                            .dwattr $C$DW$211, DW_AT_decl_file("C:/ti/ccs910/ccs/tools/compiler/ti-cgt-arm_18.12.2.LTS/inc
    3091                            .dwattr $C$DW$211, DW_AT_decl_line(0x4b)
    3092                            .dwattr $C$DW$211, DW_AT_decl_column(0x16)
    3093                    
    3094                    $C$DW$212       .dwtag  DW_TAG_member
    3095                            .dwattr $C$DW$212, DW_AT_type(*$C$DW$T$10)
    3096                            .dwattr $C$DW$212, DW_AT_name("rem")
    3097                            .dwattr $C$DW$212, DW_AT_TI_symbol_name("rem")
    3098                            .dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3099                            .dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
    3100                            .dwattr $C$DW$212, DW_AT_decl_file("C:/ti/ccs910/ccs/tools/compiler/ti-cgt-arm_18.12.2.LTS/inc
    3101                            .dwattr $C$DW$212, DW_AT_decl_line(0x4b)
    3102                            .dwattr $C$DW$212, DW_AT_decl_column(0x1c)
TI ARM Assembler PC v18.12.2 Sat Dec 14 17:40:32 2019

Copyright (c) 1996-2018 Texas Instruments Incorporated
state_machine.asm                                                    PAGE   68

    3103                    
    3104                            .dwattr $C$DW$T$41, DW_AT_decl_file("C:/ti/ccs910/ccs/tools/compiler/ti-cgt-arm_18.12.2.LTS/in
    3105                            .dwattr $C$DW$T$41, DW_AT_decl_line(0x4b)
    3106                            .dwattr $C$DW$T$41, DW_AT_decl_column(0x10)
    3107                            .dwendtag $C$DW$T$41
    3108                    
    3109                    $C$DW$T$204     .dwtag  DW_TAG_typedef
    3110                            .dwattr $C$DW$T$204, DW_AT_name("div_t")
    3111                            .dwattr $C$DW$T$204, DW_AT_type(*$C$DW$T$41)
    3112                            .dwattr $C$DW$T$204, DW_AT_language(DW_LANG_C)
    3113                            .dwattr $C$DW$T$204, DW_AT_decl_file("C:/ti/ccs910/ccs/tools/compiler/ti-cgt-arm_18.12.2.LTS/i
    3114                            .dwattr $C$DW$T$204, DW_AT_decl_line(0x4b)
    3115                            .dwattr $C$DW$T$204, DW_AT_decl_column(0x23)
    3116                    
    3117                    
    3118                    $C$DW$T$42      .dwtag  DW_TAG_structure_type
    3119                            .dwattr $C$DW$T$42, DW_AT_byte_size(0x08)
    3120                    $C$DW$213       .dwtag  DW_TAG_member
    3121                            .dwattr $C$DW$213, DW_AT_type(*$C$DW$T$10)
    3122                            .dwattr $C$DW$213, DW_AT_name("quot")
    3123                            .dwattr $C$DW$213, DW_AT_TI_symbol_name("quot")
    3124                            .dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3125                            .dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)
    3126                            .dwattr $C$DW$213, DW_AT_decl_file("C:/ti/ccs910/ccs/tools/compiler/ti-cgt-arm_18.12.2.LTS/inc
    3127                            .dwattr $C$DW$213, DW_AT_decl_line(0x50)
    3128                            .dwattr $C$DW$213, DW_AT_decl_column(0x16)
    3129                    
    3130                    $C$DW$214       .dwtag  DW_TAG_member
    3131                            .dwattr $C$DW$214, DW_AT_type(*$C$DW$T$10)
    3132                            .dwattr $C$DW$214, DW_AT_name("rem")
    3133                            .dwattr $C$DW$214, DW_AT_TI_symbol_name("rem")
    3134                            .dwattr $C$DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3135                            .dwattr $C$DW$214, DW_AT_accessibility(DW_ACCESS_public)
    3136                            .dwattr $C$DW$214, DW_AT_decl_file("C:/ti/ccs910/ccs/tools/compiler/ti-cgt-arm_18.12.2.LTS/inc
    3137                            .dwattr $C$DW$214, DW_AT_decl_line(0x50)
    3138                            .dwattr $C$DW$214, DW_AT_decl_column(0x1c)
    3139                    
    3140                            .dwattr $C$DW$T$42, DW_AT_decl_file("C:/ti/ccs910/ccs/tools/compiler/ti-cgt-arm_18.12.2.LTS/in
    3141                            .dwattr $C$DW$T$42, DW_AT_decl_line(0x50)
    3142                            .dwattr $C$DW$T$42, DW_AT_decl_column(0x10)
    3143                            .dwendtag $C$DW$T$42
    3144                    
    3145                    $C$DW$T$205     .dwtag  DW_TAG_typedef
    3146                            .dwattr $C$DW$T$205, DW_AT_name("ldiv_t")
    3147                            .dwattr $C$DW$T$205, DW_AT_type(*$C$DW$T$42)
    3148                            .dwattr $C$DW$T$205, DW_AT_language(DW_LANG_C)
    3149                            .dwattr $C$DW$T$205, DW_AT_decl_file("C:/ti/ccs910/ccs/tools/compiler/ti-cgt-arm_18.12.2.LTS/i
    3150                            .dwattr $C$DW$T$205, DW_AT_decl_line(0x50)
    3151                            .dwattr $C$DW$T$205, DW_AT_decl_column(0x23)
    3152                    
    3153                    
    3154                    $C$DW$T$43      .dwtag  DW_TAG_structure_type
    3155                            .dwattr $C$DW$T$43, DW_AT_byte_size(0x10)
    3156                    $C$DW$215       .dwtag  DW_TAG_member
    3157                            .dwattr $C$DW$215, DW_AT_type(*$C$DW$T$14)
TI ARM Assembler PC v18.12.2 Sat Dec 14 17:40:32 2019

Copyright (c) 1996-2018 Texas Instruments Incorporated
state_machine.asm                                                    PAGE   69

    3158                            .dwattr $C$DW$215, DW_AT_name("quot")
    3159                            .dwattr $C$DW$215, DW_AT_TI_symbol_name("quot")
    3160                            .dwattr $C$DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3161                            .dwattr $C$DW$215, DW_AT_accessibility(DW_ACCESS_public)
    3162                            .dwattr $C$DW$215, DW_AT_decl_file("C:/ti/ccs910/ccs/tools/compiler/ti-cgt-arm_18.12.2.LTS/inc
    3163                            .dwattr $C$DW$215, DW_AT_decl_line(0x58)
    3164                            .dwattr $C$DW$215, DW_AT_decl_column(0x1c)
    3165                    
    3166                    $C$DW$216       .dwtag  DW_TAG_member
    3167                            .dwattr $C$DW$216, DW_AT_type(*$C$DW$T$14)
    3168                            .dwattr $C$DW$216, DW_AT_name("rem")
    3169                            .dwattr $C$DW$216, DW_AT_TI_symbol_name("rem")
    3170                            .dwattr $C$DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3171                            .dwattr $C$DW$216, DW_AT_accessibility(DW_ACCESS_public)
    3172                            .dwattr $C$DW$216, DW_AT_decl_file("C:/ti/ccs910/ccs/tools/compiler/ti-cgt-arm_18.12.2.LTS/inc
    3173                            .dwattr $C$DW$216, DW_AT_decl_line(0x58)
    3174                            .dwattr $C$DW$216, DW_AT_decl_column(0x22)
    3175                    
    3176                            .dwattr $C$DW$T$43, DW_AT_decl_file("C:/ti/ccs910/ccs/tools/compiler/ti-cgt-arm_18.12.2.LTS/in
    3177                            .dwattr $C$DW$T$43, DW_AT_decl_line(0x58)
    3178                            .dwattr $C$DW$T$43, DW_AT_decl_column(0x10)
    3179                            .dwendtag $C$DW$T$43
    3180                    
    3181                    $C$DW$T$206     .dwtag  DW_TAG_typedef
    3182                            .dwattr $C$DW$T$206, DW_AT_name("lldiv_t")
    3183                            .dwattr $C$DW$T$206, DW_AT_type(*$C$DW$T$43)
    3184                            .dwattr $C$DW$T$206, DW_AT_language(DW_LANG_C)
    3185                            .dwattr $C$DW$T$206, DW_AT_decl_file("C:/ti/ccs910/ccs/tools/compiler/ti-cgt-arm_18.12.2.LTS/i
    3186                            .dwattr $C$DW$T$206, DW_AT_decl_line(0x58)
    3187                            .dwattr $C$DW$T$206, DW_AT_decl_column(0x29)
    3188                    
    3189                    
    3190                    $C$DW$T$44      .dwtag  DW_TAG_structure_type
    3191                            .dwattr $C$DW$T$44, DW_AT_byte_size(0x10)
    3192                    $C$DW$217       .dwtag  DW_TAG_member
    3193                            .dwattr $C$DW$217, DW_AT_type(*$C$DW$T$14)
    3194                            .dwattr $C$DW$217, DW_AT_name("__max_align1")
    3195                            .dwattr $C$DW$217, DW_AT_TI_symbol_name("__max_align1")
    3196                            .dwattr $C$DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3197                            .dwattr $C$DW$217, DW_AT_accessibility(DW_ACCESS_public)
    3198                            .dwattr $C$DW$217, DW_AT_decl_file("C:/ti/ccs910/ccs/tools/compiler/ti-cgt-arm_18.12.2.LTS/inc
    3199                            .dwattr $C$DW$217, DW_AT_decl_line(0x7a)
    3200                            .dwattr $C$DW$217, DW_AT_decl_column(0x0c)
    3201                    
    3202                    $C$DW$218       .dwtag  DW_TAG_member
    3203                            .dwattr $C$DW$218, DW_AT_type(*$C$DW$T$18)
    3204                            .dwattr $C$DW$218, DW_AT_name("__max_align2")
    3205                            .dwattr $C$DW$218, DW_AT_TI_symbol_name("__max_align2")
    3206                            .dwattr $C$DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3207                            .dwattr $C$DW$218, DW_AT_accessibility(DW_ACCESS_public)
    3208                            .dwattr $C$DW$218, DW_AT_decl_file("C:/ti/ccs910/ccs/tools/compiler/ti-cgt-arm_18.12.2.LTS/inc
    3209                            .dwattr $C$DW$218, DW_AT_decl_line(0x7b)
    3210                            .dwattr $C$DW$218, DW_AT_decl_column(0x0e)
    3211                    
    3212                            .dwattr $C$DW$T$44, DW_AT_decl_file("C:/ti/ccs910/ccs/tools/compiler/ti-cgt-arm_18.12.2.LTS/in
TI ARM Assembler PC v18.12.2 Sat Dec 14 17:40:32 2019

Copyright (c) 1996-2018 Texas Instruments Incorporated
state_machine.asm                                                    PAGE   70

    3213                            .dwattr $C$DW$T$44, DW_AT_decl_line(0x79)
    3214                            .dwattr $C$DW$T$44, DW_AT_decl_column(0x10)
    3215                            .dwendtag $C$DW$T$44
    3216                    
    3217                    $C$DW$T$207     .dwtag  DW_TAG_typedef
    3218                            .dwattr $C$DW$T$207, DW_AT_name("__max_align_t")
    3219                            .dwattr $C$DW$T$207, DW_AT_type(*$C$DW$T$44)
    3220                            .dwattr $C$DW$T$207, DW_AT_language(DW_LANG_C)
    3221                            .dwattr $C$DW$T$207, DW_AT_decl_file("C:/ti/ccs910/ccs/tools/compiler/ti-cgt-arm_18.12.2.LTS/i
    3222                            .dwattr $C$DW$T$207, DW_AT_decl_line(0x7c)
    3223                            .dwattr $C$DW$T$207, DW_AT_decl_column(0x03)
    3224                    
    3225                    
    3226                    $C$DW$T$47      .dwtag  DW_TAG_structure_type
    3227                            .dwattr $C$DW$T$47, DW_AT_byte_size(0x04)
    3228                    $C$DW$219       .dwtag  DW_TAG_member
    3229                            .dwattr $C$DW$219, DW_AT_type(*$C$DW$T$46)
    3230                            .dwattr $C$DW$219, DW_AT_name("_reserved0")
    3231                            .dwattr $C$DW$219, DW_AT_TI_symbol_name("_reserved0")
    3232                            .dwattr $C$DW$219, DW_AT_bit_offset(0x10)
    3233                            .dwattr $C$DW$219, DW_AT_bit_size(0x10)
    3234                            .dwattr $C$DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3235                            .dwattr $C$DW$219, DW_AT_accessibility(DW_ACCESS_public)
    3236                            .dwattr $C$DW$219, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_part
    3237                            .dwattr $C$DW$219, DW_AT_decl_line(0x107)
    3238                            .dwattr $C$DW$219, DW_AT_decl_column(0x0e)
    3239                    
    3240                    $C$DW$220       .dwtag  DW_TAG_member
    3241                            .dwattr $C$DW$220, DW_AT_type(*$C$DW$T$46)
    3242                            .dwattr $C$DW$220, DW_AT_name("GE")
    3243                            .dwattr $C$DW$220, DW_AT_TI_symbol_name("GE")
    3244                            .dwattr $C$DW$220, DW_AT_bit_offset(0x0c)
    3245                            .dwattr $C$DW$220, DW_AT_bit_size(0x04)
    3246                            .dwattr $C$DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3247                            .dwattr $C$DW$220, DW_AT_accessibility(DW_ACCESS_public)
    3248                            .dwattr $C$DW$220, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_part
    3249                            .dwattr $C$DW$220, DW_AT_decl_line(0x108)
    3250                            .dwattr $C$DW$220, DW_AT_decl_column(0x0e)
    3251                    
    3252                    $C$DW$221       .dwtag  DW_TAG_member
    3253                            .dwattr $C$DW$221, DW_AT_type(*$C$DW$T$46)
    3254                            .dwattr $C$DW$221, DW_AT_name("_reserved1")
    3255                            .dwattr $C$DW$221, DW_AT_TI_symbol_name("_reserved1")
    3256                            .dwattr $C$DW$221, DW_AT_bit_offset(0x05)
    3257                            .dwattr $C$DW$221, DW_AT_bit_size(0x07)
    3258                            .dwattr $C$DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3259                            .dwattr $C$DW$221, DW_AT_accessibility(DW_ACCESS_public)
    3260                            .dwattr $C$DW$221, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_part
    3261                            .dwattr $C$DW$221, DW_AT_decl_line(0x109)
    3262                            .dwattr $C$DW$221, DW_AT_decl_column(0x0e)
    3263                    
    3264                    $C$DW$222       .dwtag  DW_TAG_member
    3265                            .dwattr $C$DW$222, DW_AT_type(*$C$DW$T$46)
    3266                            .dwattr $C$DW$222, DW_AT_name("Q")
    3267                            .dwattr $C$DW$222, DW_AT_TI_symbol_name("Q")
TI ARM Assembler PC v18.12.2 Sat Dec 14 17:40:32 2019

Copyright (c) 1996-2018 Texas Instruments Incorporated
state_machine.asm                                                    PAGE   71

    3268                            .dwattr $C$DW$222, DW_AT_bit_offset(0x04)
    3269                            .dwattr $C$DW$222, DW_AT_bit_size(0x01)
    3270                            .dwattr $C$DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3271                            .dwattr $C$DW$222, DW_AT_accessibility(DW_ACCESS_public)
    3272                            .dwattr $C$DW$222, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_part
    3273                            .dwattr $C$DW$222, DW_AT_decl_line(0x10a)
    3274                            .dwattr $C$DW$222, DW_AT_decl_column(0x0e)
    3275                    
    3276                    $C$DW$223       .dwtag  DW_TAG_member
    3277                            .dwattr $C$DW$223, DW_AT_type(*$C$DW$T$46)
    3278                            .dwattr $C$DW$223, DW_AT_name("V")
    3279                            .dwattr $C$DW$223, DW_AT_TI_symbol_name("V")
    3280                            .dwattr $C$DW$223, DW_AT_bit_offset(0x03)
    3281                            .dwattr $C$DW$223, DW_AT_bit_size(0x01)
    3282                            .dwattr $C$DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3283                            .dwattr $C$DW$223, DW_AT_accessibility(DW_ACCESS_public)
    3284                            .dwattr $C$DW$223, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_part
    3285                            .dwattr $C$DW$223, DW_AT_decl_line(0x10b)
    3286                            .dwattr $C$DW$223, DW_AT_decl_column(0x0e)
    3287                    
    3288                    $C$DW$224       .dwtag  DW_TAG_member
    3289                            .dwattr $C$DW$224, DW_AT_type(*$C$DW$T$46)
    3290                            .dwattr $C$DW$224, DW_AT_name("C")
    3291                            .dwattr $C$DW$224, DW_AT_TI_symbol_name("C")
    3292                            .dwattr $C$DW$224, DW_AT_bit_offset(0x02)
    3293                            .dwattr $C$DW$224, DW_AT_bit_size(0x01)
    3294                            .dwattr $C$DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3295                            .dwattr $C$DW$224, DW_AT_accessibility(DW_ACCESS_public)
    3296                            .dwattr $C$DW$224, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_part
    3297                            .dwattr $C$DW$224, DW_AT_decl_line(0x10c)
    3298                            .dwattr $C$DW$224, DW_AT_decl_column(0x0e)
    3299                    
    3300                    $C$DW$225       .dwtag  DW_TAG_member
    3301                            .dwattr $C$DW$225, DW_AT_type(*$C$DW$T$46)
    3302                            .dwattr $C$DW$225, DW_AT_name("Z")
    3303                            .dwattr $C$DW$225, DW_AT_TI_symbol_name("Z")
    3304                            .dwattr $C$DW$225, DW_AT_bit_offset(0x01)
    3305                            .dwattr $C$DW$225, DW_AT_bit_size(0x01)
    3306                            .dwattr $C$DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3307                            .dwattr $C$DW$225, DW_AT_accessibility(DW_ACCESS_public)
    3308                            .dwattr $C$DW$225, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_part
    3309                            .dwattr $C$DW$225, DW_AT_decl_line(0x10d)
    3310                            .dwattr $C$DW$225, DW_AT_decl_column(0x0e)
    3311                    
    3312                    $C$DW$226       .dwtag  DW_TAG_member
    3313                            .dwattr $C$DW$226, DW_AT_type(*$C$DW$T$46)
    3314                            .dwattr $C$DW$226, DW_AT_name("N")
    3315                            .dwattr $C$DW$226, DW_AT_TI_symbol_name("N")
    3316                            .dwattr $C$DW$226, DW_AT_bit_offset(0x00)
    3317                            .dwattr $C$DW$226, DW_AT_bit_size(0x01)
    3318                            .dwattr $C$DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3319                            .dwattr $C$DW$226, DW_AT_accessibility(DW_ACCESS_public)
    3320                            .dwattr $C$DW$226, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_part
    3321                            .dwattr $C$DW$226, DW_AT_decl_line(0x10e)
    3322                            .dwattr $C$DW$226, DW_AT_decl_column(0x0e)
TI ARM Assembler PC v18.12.2 Sat Dec 14 17:40:32 2019

Copyright (c) 1996-2018 Texas Instruments Incorporated
state_machine.asm                                                    PAGE   72

    3323                    
    3324                            .dwattr $C$DW$T$47, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_par
    3325                            .dwattr $C$DW$T$47, DW_AT_decl_line(0x106)
    3326                            .dwattr $C$DW$T$47, DW_AT_decl_column(0x03)
    3327                            .dwendtag $C$DW$T$47
    3328                    
    3329                    
    3330                    $C$DW$T$48      .dwtag  DW_TAG_structure_type
    3331                            .dwattr $C$DW$T$48, DW_AT_byte_size(0x04)
    3332                    $C$DW$227       .dwtag  DW_TAG_member
    3333                            .dwattr $C$DW$227, DW_AT_type(*$C$DW$T$46)
    3334                            .dwattr $C$DW$227, DW_AT_name("ISR")
    3335                            .dwattr $C$DW$227, DW_AT_TI_symbol_name("ISR")
    3336                            .dwattr $C$DW$227, DW_AT_bit_offset(0x17)
    3337                            .dwattr $C$DW$227, DW_AT_bit_size(0x09)
    3338                            .dwattr $C$DW$227, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3339                            .dwattr $C$DW$227, DW_AT_accessibility(DW_ACCESS_public)
    3340                            .dwattr $C$DW$227, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_part
    3341                            .dwattr $C$DW$227, DW_AT_decl_line(0x12e)
    3342                            .dwattr $C$DW$227, DW_AT_decl_column(0x0e)
    3343                    
    3344                    $C$DW$228       .dwtag  DW_TAG_member
    3345                            .dwattr $C$DW$228, DW_AT_type(*$C$DW$T$46)
    3346                            .dwattr $C$DW$228, DW_AT_name("_reserved0")
    3347                            .dwattr $C$DW$228, DW_AT_TI_symbol_name("_reserved0")
    3348                            .dwattr $C$DW$228, DW_AT_bit_offset(0x00)
    3349                            .dwattr $C$DW$228, DW_AT_bit_size(0x17)
    3350                            .dwattr $C$DW$228, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3351                            .dwattr $C$DW$228, DW_AT_accessibility(DW_ACCESS_public)
    3352                            .dwattr $C$DW$228, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_part
    3353                            .dwattr $C$DW$228, DW_AT_decl_line(0x12f)
    3354                            .dwattr $C$DW$228, DW_AT_decl_column(0x0e)
    3355                    
    3356                            .dwattr $C$DW$T$48, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_par
    3357                            .dwattr $C$DW$T$48, DW_AT_decl_line(0x12d)
    3358                            .dwattr $C$DW$T$48, DW_AT_decl_column(0x03)
    3359                            .dwendtag $C$DW$T$48
    3360                    
    3361                    
    3362                    $C$DW$T$49      .dwtag  DW_TAG_structure_type
    3363                            .dwattr $C$DW$T$49, DW_AT_byte_size(0x04)
    3364                    $C$DW$229       .dwtag  DW_TAG_member
    3365                            .dwattr $C$DW$229, DW_AT_type(*$C$DW$T$46)
    3366                            .dwattr $C$DW$229, DW_AT_name("ISR")
    3367                            .dwattr $C$DW$229, DW_AT_TI_symbol_name("ISR")
    3368                            .dwattr $C$DW$229, DW_AT_bit_offset(0x17)
    3369                            .dwattr $C$DW$229, DW_AT_bit_size(0x09)
    3370                            .dwattr $C$DW$229, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3371                            .dwattr $C$DW$229, DW_AT_accessibility(DW_ACCESS_public)
    3372                            .dwattr $C$DW$229, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_part
    3373                            .dwattr $C$DW$229, DW_AT_decl_line(0x140)
    3374                            .dwattr $C$DW$229, DW_AT_decl_column(0x0e)
    3375                    
    3376                    $C$DW$230       .dwtag  DW_TAG_member
    3377                            .dwattr $C$DW$230, DW_AT_type(*$C$DW$T$46)
TI ARM Assembler PC v18.12.2 Sat Dec 14 17:40:32 2019

Copyright (c) 1996-2018 Texas Instruments Incorporated
state_machine.asm                                                    PAGE   73

    3378                            .dwattr $C$DW$230, DW_AT_name("_reserved0")
    3379                            .dwattr $C$DW$230, DW_AT_TI_symbol_name("_reserved0")
    3380                            .dwattr $C$DW$230, DW_AT_bit_offset(0x16)
    3381                            .dwattr $C$DW$230, DW_AT_bit_size(0x01)
    3382                            .dwattr $C$DW$230, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3383                            .dwattr $C$DW$230, DW_AT_accessibility(DW_ACCESS_public)
    3384                            .dwattr $C$DW$230, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_part
    3385                            .dwattr $C$DW$230, DW_AT_decl_line(0x141)
    3386                            .dwattr $C$DW$230, DW_AT_decl_column(0x0e)
    3387                    
    3388                    $C$DW$231       .dwtag  DW_TAG_member
    3389                            .dwattr $C$DW$231, DW_AT_type(*$C$DW$T$46)
    3390                            .dwattr $C$DW$231, DW_AT_name("ICI_IT_1")
    3391                            .dwattr $C$DW$231, DW_AT_TI_symbol_name("ICI_IT_1")
    3392                            .dwattr $C$DW$231, DW_AT_bit_offset(0x10)
    3393                            .dwattr $C$DW$231, DW_AT_bit_size(0x06)
    3394                            .dwattr $C$DW$231, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3395                            .dwattr $C$DW$231, DW_AT_accessibility(DW_ACCESS_public)
    3396                            .dwattr $C$DW$231, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_part
    3397                            .dwattr $C$DW$231, DW_AT_decl_line(0x142)
    3398                            .dwattr $C$DW$231, DW_AT_decl_column(0x0e)
    3399                    
    3400                    $C$DW$232       .dwtag  DW_TAG_member
    3401                            .dwattr $C$DW$232, DW_AT_type(*$C$DW$T$46)
    3402                            .dwattr $C$DW$232, DW_AT_name("GE")
    3403                            .dwattr $C$DW$232, DW_AT_TI_symbol_name("GE")
    3404                            .dwattr $C$DW$232, DW_AT_bit_offset(0x0c)
    3405                            .dwattr $C$DW$232, DW_AT_bit_size(0x04)
    3406                            .dwattr $C$DW$232, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3407                            .dwattr $C$DW$232, DW_AT_accessibility(DW_ACCESS_public)
    3408                            .dwattr $C$DW$232, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_part
    3409                            .dwattr $C$DW$232, DW_AT_decl_line(0x143)
    3410                            .dwattr $C$DW$232, DW_AT_decl_column(0x0e)
    3411                    
    3412                    $C$DW$233       .dwtag  DW_TAG_member
    3413                            .dwattr $C$DW$233, DW_AT_type(*$C$DW$T$46)
    3414                            .dwattr $C$DW$233, DW_AT_name("_reserved1")
    3415                            .dwattr $C$DW$233, DW_AT_TI_symbol_name("_reserved1")
    3416                            .dwattr $C$DW$233, DW_AT_bit_offset(0x08)
    3417                            .dwattr $C$DW$233, DW_AT_bit_size(0x04)
    3418                            .dwattr $C$DW$233, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3419                            .dwattr $C$DW$233, DW_AT_accessibility(DW_ACCESS_public)
    3420                            .dwattr $C$DW$233, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_part
    3421                            .dwattr $C$DW$233, DW_AT_decl_line(0x144)
    3422                            .dwattr $C$DW$233, DW_AT_decl_column(0x0e)
    3423                    
    3424                    $C$DW$234       .dwtag  DW_TAG_member
    3425                            .dwattr $C$DW$234, DW_AT_type(*$C$DW$T$46)
    3426                            .dwattr $C$DW$234, DW_AT_name("T")
    3427                            .dwattr $C$DW$234, DW_AT_TI_symbol_name("T")
    3428                            .dwattr $C$DW$234, DW_AT_bit_offset(0x07)
    3429                            .dwattr $C$DW$234, DW_AT_bit_size(0x01)
    3430                            .dwattr $C$DW$234, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3431                            .dwattr $C$DW$234, DW_AT_accessibility(DW_ACCESS_public)
    3432                            .dwattr $C$DW$234, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_part
TI ARM Assembler PC v18.12.2 Sat Dec 14 17:40:32 2019

Copyright (c) 1996-2018 Texas Instruments Incorporated
state_machine.asm                                                    PAGE   74

    3433                            .dwattr $C$DW$234, DW_AT_decl_line(0x145)
    3434                            .dwattr $C$DW$234, DW_AT_decl_column(0x0e)
    3435                    
    3436                    $C$DW$235       .dwtag  DW_TAG_member
    3437                            .dwattr $C$DW$235, DW_AT_type(*$C$DW$T$46)
    3438                            .dwattr $C$DW$235, DW_AT_name("ICI_IT_2")
    3439                            .dwattr $C$DW$235, DW_AT_TI_symbol_name("ICI_IT_2")
    3440                            .dwattr $C$DW$235, DW_AT_bit_offset(0x05)
    3441                            .dwattr $C$DW$235, DW_AT_bit_size(0x02)
    3442                            .dwattr $C$DW$235, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3443                            .dwattr $C$DW$235, DW_AT_accessibility(DW_ACCESS_public)
    3444                            .dwattr $C$DW$235, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_part
    3445                            .dwattr $C$DW$235, DW_AT_decl_line(0x146)
    3446                            .dwattr $C$DW$235, DW_AT_decl_column(0x0e)
    3447                    
    3448                    $C$DW$236       .dwtag  DW_TAG_member
    3449                            .dwattr $C$DW$236, DW_AT_type(*$C$DW$T$46)
    3450                            .dwattr $C$DW$236, DW_AT_name("Q")
    3451                            .dwattr $C$DW$236, DW_AT_TI_symbol_name("Q")
    3452                            .dwattr $C$DW$236, DW_AT_bit_offset(0x04)
    3453                            .dwattr $C$DW$236, DW_AT_bit_size(0x01)
    3454                            .dwattr $C$DW$236, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3455                            .dwattr $C$DW$236, DW_AT_accessibility(DW_ACCESS_public)
    3456                            .dwattr $C$DW$236, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_part
    3457                            .dwattr $C$DW$236, DW_AT_decl_line(0x147)
    3458                            .dwattr $C$DW$236, DW_AT_decl_column(0x0e)
    3459                    
    3460                    $C$DW$237       .dwtag  DW_TAG_member
    3461                            .dwattr $C$DW$237, DW_AT_type(*$C$DW$T$46)
    3462                            .dwattr $C$DW$237, DW_AT_name("V")
    3463                            .dwattr $C$DW$237, DW_AT_TI_symbol_name("V")
    3464                            .dwattr $C$DW$237, DW_AT_bit_offset(0x03)
    3465                            .dwattr $C$DW$237, DW_AT_bit_size(0x01)
    3466                            .dwattr $C$DW$237, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3467                            .dwattr $C$DW$237, DW_AT_accessibility(DW_ACCESS_public)
    3468                            .dwattr $C$DW$237, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_part
    3469                            .dwattr $C$DW$237, DW_AT_decl_line(0x148)
    3470                            .dwattr $C$DW$237, DW_AT_decl_column(0x0e)
    3471                    
    3472                    $C$DW$238       .dwtag  DW_TAG_member
    3473                            .dwattr $C$DW$238, DW_AT_type(*$C$DW$T$46)
    3474                            .dwattr $C$DW$238, DW_AT_name("C")
    3475                            .dwattr $C$DW$238, DW_AT_TI_symbol_name("C")
    3476                            .dwattr $C$DW$238, DW_AT_bit_offset(0x02)
    3477                            .dwattr $C$DW$238, DW_AT_bit_size(0x01)
    3478                            .dwattr $C$DW$238, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3479                            .dwattr $C$DW$238, DW_AT_accessibility(DW_ACCESS_public)
    3480                            .dwattr $C$DW$238, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_part
    3481                            .dwattr $C$DW$238, DW_AT_decl_line(0x149)
    3482                            .dwattr $C$DW$238, DW_AT_decl_column(0x0e)
    3483                    
    3484                    $C$DW$239       .dwtag  DW_TAG_member
    3485                            .dwattr $C$DW$239, DW_AT_type(*$C$DW$T$46)
    3486                            .dwattr $C$DW$239, DW_AT_name("Z")
    3487                            .dwattr $C$DW$239, DW_AT_TI_symbol_name("Z")
TI ARM Assembler PC v18.12.2 Sat Dec 14 17:40:32 2019

Copyright (c) 1996-2018 Texas Instruments Incorporated
state_machine.asm                                                    PAGE   75

    3488                            .dwattr $C$DW$239, DW_AT_bit_offset(0x01)
    3489                            .dwattr $C$DW$239, DW_AT_bit_size(0x01)
    3490                            .dwattr $C$DW$239, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3491                            .dwattr $C$DW$239, DW_AT_accessibility(DW_ACCESS_public)
    3492                            .dwattr $C$DW$239, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_part
    3493                            .dwattr $C$DW$239, DW_AT_decl_line(0x14a)
    3494                            .dwattr $C$DW$239, DW_AT_decl_column(0x0e)
    3495                    
    3496                    $C$DW$240       .dwtag  DW_TAG_member
    3497                            .dwattr $C$DW$240, DW_AT_type(*$C$DW$T$46)
    3498                            .dwattr $C$DW$240, DW_AT_name("N")
    3499                            .dwattr $C$DW$240, DW_AT_TI_symbol_name("N")
    3500                            .dwattr $C$DW$240, DW_AT_bit_offset(0x00)
    3501                            .dwattr $C$DW$240, DW_AT_bit_size(0x01)
    3502                            .dwattr $C$DW$240, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3503                            .dwattr $C$DW$240, DW_AT_accessibility(DW_ACCESS_public)
    3504                            .dwattr $C$DW$240, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_part
    3505                            .dwattr $C$DW$240, DW_AT_decl_line(0x14b)
    3506                            .dwattr $C$DW$240, DW_AT_decl_column(0x0e)
    3507                    
    3508                            .dwattr $C$DW$T$49, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_par
    3509                            .dwattr $C$DW$T$49, DW_AT_decl_line(0x13f)
    3510                            .dwattr $C$DW$T$49, DW_AT_decl_column(0x03)
    3511                            .dwendtag $C$DW$T$49
    3512                    
    3513                    
    3514                    $C$DW$T$50      .dwtag  DW_TAG_structure_type
    3515                            .dwattr $C$DW$T$50, DW_AT_byte_size(0x04)
    3516                    $C$DW$241       .dwtag  DW_TAG_member
    3517                            .dwattr $C$DW$241, DW_AT_type(*$C$DW$T$46)
    3518                            .dwattr $C$DW$241, DW_AT_name("nPRIV")
    3519                            .dwattr $C$DW$241, DW_AT_TI_symbol_name("nPRIV")
    3520                            .dwattr $C$DW$241, DW_AT_bit_offset(0x1f)
    3521                            .dwattr $C$DW$241, DW_AT_bit_size(0x01)
    3522                            .dwattr $C$DW$241, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3523                            .dwattr $C$DW$241, DW_AT_accessibility(DW_ACCESS_public)
    3524                            .dwattr $C$DW$241, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_part
    3525                            .dwattr $C$DW$241, DW_AT_decl_line(0x177)
    3526                            .dwattr $C$DW$241, DW_AT_decl_column(0x0e)
    3527                    
    3528                    $C$DW$242       .dwtag  DW_TAG_member
    3529                            .dwattr $C$DW$242, DW_AT_type(*$C$DW$T$46)
    3530                            .dwattr $C$DW$242, DW_AT_name("SPSEL")
    3531                            .dwattr $C$DW$242, DW_AT_TI_symbol_name("SPSEL")
    3532                            .dwattr $C$DW$242, DW_AT_bit_offset(0x1e)
    3533                            .dwattr $C$DW$242, DW_AT_bit_size(0x01)
    3534                            .dwattr $C$DW$242, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3535                            .dwattr $C$DW$242, DW_AT_accessibility(DW_ACCESS_public)
    3536                            .dwattr $C$DW$242, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_part
    3537                            .dwattr $C$DW$242, DW_AT_decl_line(0x178)
    3538                            .dwattr $C$DW$242, DW_AT_decl_column(0x0e)
    3539                    
    3540                    $C$DW$243       .dwtag  DW_TAG_member
    3541                            .dwattr $C$DW$243, DW_AT_type(*$C$DW$T$46)
    3542                            .dwattr $C$DW$243, DW_AT_name("FPCA")
TI ARM Assembler PC v18.12.2 Sat Dec 14 17:40:32 2019

Copyright (c) 1996-2018 Texas Instruments Incorporated
state_machine.asm                                                    PAGE   76

    3543                            .dwattr $C$DW$243, DW_AT_TI_symbol_name("FPCA")
    3544                            .dwattr $C$DW$243, DW_AT_bit_offset(0x1d)
    3545                            .dwattr $C$DW$243, DW_AT_bit_size(0x01)
    3546                            .dwattr $C$DW$243, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3547                            .dwattr $C$DW$243, DW_AT_accessibility(DW_ACCESS_public)
    3548                            .dwattr $C$DW$243, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_part
    3549                            .dwattr $C$DW$243, DW_AT_decl_line(0x179)
    3550                            .dwattr $C$DW$243, DW_AT_decl_column(0x0e)
    3551                    
    3552                    $C$DW$244       .dwtag  DW_TAG_member
    3553                            .dwattr $C$DW$244, DW_AT_type(*$C$DW$T$46)
    3554                            .dwattr $C$DW$244, DW_AT_name("_reserved0")
    3555                            .dwattr $C$DW$244, DW_AT_TI_symbol_name("_reserved0")
    3556                            .dwattr $C$DW$244, DW_AT_bit_offset(0x00)
    3557                            .dwattr $C$DW$244, DW_AT_bit_size(0x1d)
    3558                            .dwattr $C$DW$244, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3559                            .dwattr $C$DW$244, DW_AT_accessibility(DW_ACCESS_public)
    3560                            .dwattr $C$DW$244, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_part
    3561                            .dwattr $C$DW$244, DW_AT_decl_line(0x17a)
    3562                            .dwattr $C$DW$244, DW_AT_decl_column(0x0e)
    3563                    
    3564                            .dwattr $C$DW$T$50, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_par
    3565                            .dwattr $C$DW$T$50, DW_AT_decl_line(0x176)
    3566                            .dwattr $C$DW$T$50, DW_AT_decl_column(0x03)
    3567                            .dwendtag $C$DW$T$50
    3568                    
    3569                    
    3570                    $C$DW$T$57      .dwtag  DW_TAG_structure_type
    3571                            .dwattr $C$DW$T$57, DW_AT_byte_size(0xe04)
    3572                    $C$DW$245       .dwtag  DW_TAG_member
    3573                            .dwattr $C$DW$245, DW_AT_type(*$C$DW$T$52)
    3574                            .dwattr $C$DW$245, DW_AT_name("ISER")
    3575                            .dwattr $C$DW$245, DW_AT_TI_symbol_name("ISER")
    3576                            .dwattr $C$DW$245, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3577                            .dwattr $C$DW$245, DW_AT_accessibility(DW_ACCESS_public)
    3578                            .dwattr $C$DW$245, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_part
    3579                            .dwattr $C$DW$245, DW_AT_decl_line(0x198)
    3580                            .dwattr $C$DW$245, DW_AT_decl_column(0x12)
    3581                    
    3582                    $C$DW$246       .dwtag  DW_TAG_member
    3583                            .dwattr $C$DW$246, DW_AT_type(*$C$DW$T$53)
    3584                            .dwattr $C$DW$246, DW_AT_name("RESERVED0")
    3585                            .dwattr $C$DW$246, DW_AT_TI_symbol_name("RESERVED0")
    3586                            .dwattr $C$DW$246, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    3587                            .dwattr $C$DW$246, DW_AT_accessibility(DW_ACCESS_public)
    3588                            .dwattr $C$DW$246, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_part
    3589                            .dwattr $C$DW$246, DW_AT_decl_line(0x199)
    3590                            .dwattr $C$DW$246, DW_AT_decl_column(0x12)
    3591                    
    3592                    $C$DW$247       .dwtag  DW_TAG_member
    3593                            .dwattr $C$DW$247, DW_AT_type(*$C$DW$T$52)
    3594                            .dwattr $C$DW$247, DW_AT_name("ICER")
    3595                            .dwattr $C$DW$247, DW_AT_TI_symbol_name("ICER")
    3596                            .dwattr $C$DW$247, DW_AT_data_member_location[DW_OP_plus_uconst 0x80]
    3597                            .dwattr $C$DW$247, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v18.12.2 Sat Dec 14 17:40:32 2019

Copyright (c) 1996-2018 Texas Instruments Incorporated
state_machine.asm                                                    PAGE   77

    3598                            .dwattr $C$DW$247, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_part
    3599                            .dwattr $C$DW$247, DW_AT_decl_line(0x19a)
    3600                            .dwattr $C$DW$247, DW_AT_decl_column(0x12)
    3601                    
    3602                    $C$DW$248       .dwtag  DW_TAG_member
    3603                            .dwattr $C$DW$248, DW_AT_type(*$C$DW$T$53)
    3604                            .dwattr $C$DW$248, DW_AT_name("RESERVED1")
    3605                            .dwattr $C$DW$248, DW_AT_TI_symbol_name("RESERVED1")
    3606                            .dwattr $C$DW$248, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    3607                            .dwattr $C$DW$248, DW_AT_accessibility(DW_ACCESS_public)
    3608                            .dwattr $C$DW$248, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_part
    3609                            .dwattr $C$DW$248, DW_AT_decl_line(0x19b)
    3610                            .dwattr $C$DW$248, DW_AT_decl_column(0x12)
    3611                    
    3612                    $C$DW$249       .dwtag  DW_TAG_member
    3613                            .dwattr $C$DW$249, DW_AT_type(*$C$DW$T$52)
    3614                            .dwattr $C$DW$249, DW_AT_name("ISPR")
    3615                            .dwattr $C$DW$249, DW_AT_TI_symbol_name("ISPR")
