TI ARM Assembler PC v18.12.2 Wed Dec 11 15:37:23 2019

Copyright (c) 1996-2018 Texas Instruments Incorporated
system_msp432p401r.asm                                               PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM G3 C/C++ Codegen                                            PC v18.12.2.LTS *
       3                    ;* Date/Time created: Wed Dec 11 15:37:23 2019                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --embed
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../system_msp432p401r.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM G3 C/C++ Codegen PC v18.12.2.LTS Copyright (c) 199
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\Hp\workspace_v9_TIMSP432\BL_MASTER\Debug")
      13                            .global SystemCoreClock
      14 00000000                   .data
      15                            .align  4

     690 00000294 40010404  ||$C$CON7||:    .bits           0x40010404,32
     691                    
     692                            .align  4
     693 00000298 0016E360  ||$C$CON8||:    .bits           0x16e360,32
     694                    
     695                            .align  4
     696 0000029c 002DC6C0  ||$C$CON9||:    .bits           0x2dc6c0,32
     697                    
     698                            .align  4
     699 000002a0 005B8D80  ||$C$CON10||:   .bits           0x5b8d80,32
     700                    
     701                            .align  4
     702 000002a4 00B71B00  ||$C$CON11||:   .bits           0xb71b00,32
     703                    
     704                            .align  4
     705 000002a8 016E3600  ||$C$CON12||:   .bits           0x16e3600,32
     706                    
     707                            .align  4
     708 000002ac 02DC6C00  ||$C$CON13||:   .bits           0x2dc6c00,32
     709                    
     710                            .align  4
     711 000002b0 422080D8  ||$C$CON14||:   .bits           0x422080d8,32
     712                    
     713                            .align  4
     714 000002b4 00201084  ||$C$CON15||:   .bits           0x201084,32
     715                    
TI ARM Assembler PC v18.12.2 Wed Dec 11 15:37:23 2019

Copyright (c) 1996-2018 Texas Instruments Incorporated
system_msp432p401r.asm                                               PAGE   14

     716                            .align  4
     717 000002b8 0020106C  ||$C$CON16||:   .bits           0x20106c,32
     718                    
     719                            .align  4
     720 000002bc 00201064  ||$C$CON17||:   .bits           0x201064,32
     721                    
     722                            .align  4
     723 000002c0 0020104C  ||$C$CON18||:   .bits           0x20104c,32
     724                    
     725                            .align  4
     726 000002c4 42208904  ||$C$CON19||:   .bits           0x42208904,32
     727                    
     728                    ;******************************************************************************
     729                    ;* CONSTANT TABLE                                                             *
     730                    ;******************************************************************************
     731 00000058                   .sect   ".text:SystemInit"
     732                            .align  4
     733 00000058 E000ED88  ||$C$CON20||:   .bits           0xe000ed88,32
     734                    
     735                            .align  4
     736 0000005c 4000480C  ||$C$CON21||:   .bits           0x4000480c,32
     737                    
     738                            .align  4
     739 00000060 E0043014  ||$C$CON22||:   .bits           0xe0043014,32
     740                    
     741                            .align  4
     742 00000064 40010400  ||$C$CON23||:   .bits           0x40010400,32
     743                    
     744                            .align  4
     745 00000068 40010404  ||$C$CON24||:   .bits           0x40010404,32
     746                    
     747                            .align  4
     748 0000006c 40010408  ||$C$CON25||:   .bits           0x40010408,32
     749                    
     750                            .align  4
     751 00000070 40011010  ||$C$CON26||:   .bits           0x40011010,32
     752                    
     753                            .align  4
     754 00000074 40011014  ||$C$CON27||:   .bits           0x40011014,32
     755                    
     756                    
     757                    ;******************************************************************************
     758                    ;* BUILD ATTRIBUTES                                                           *
     759                    ;******************************************************************************
     760                            .battr "aeabi", Tag_File, 1, Tag_ABI_PCS_wchar_t(2)
     761                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_rounding(0)
     762                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_denormal(0)
     763                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_exceptions(0)
     764                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_number_model(1)
     765                            .battr "aeabi", Tag_File, 1, Tag_ABI_enum_size(1)
     766                            .battr "aeabi", Tag_File, 1, Tag_ABI_optimization_goals(5)
     767                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_optimization_goals(0)
     768                            .battr "TI", Tag_File, 1, Tag_Bitfield_layout(0)
     769                            .battr "aeabi", Tag_File, 1, Tag_ABI_VFP_args(3)
     770                            .battr "TI", Tag_File, 1, Tag_FP_interface(1)
TI ARM Assembler PC v18.12.2 Wed Dec 11 15:37:23 2019

Copyright (c) 1996-2018 Texas Instruments Incorporated
system_msp432p401r.asm                                               PAGE   15

     771                    
     772                    ;******************************************************************************
     773                    ;* TYPE INFORMATION                                                           *
     774                    ;******************************************************************************
     775                    
     776                    $C$DW$T$27      .dwtag  DW_TAG_structure_type
     777                            .dwattr $C$DW$T$27, DW_AT_byte_size(0x68)
     778                    $C$DW$13        .dwtag  DW_TAG_member
     779                            .dwattr $C$DW$13, DW_AT_type(*$C$DW$T$23)
     780                            .dwattr $C$DW$13, DW_AT_name("KEY")
     781                            .dwattr $C$DW$13, DW_AT_TI_symbol_name("KEY")
     782                            .dwattr $C$DW$13, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     783                            .dwattr $C$DW$13, DW_AT_accessibility(DW_ACCESS_public)
     784                            .dwattr $C$DW$13, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices\
     785                            .dwattr $C$DW$13, DW_AT_decl_line(0x1d9)
     786                            .dwattr $C$DW$13, DW_AT_decl_column(0x11)
     787                    
     788                    $C$DW$14        .dwtag  DW_TAG_member
     789                            .dwattr $C$DW$14, DW_AT_type(*$C$DW$T$23)
     790                            .dwattr $C$DW$14, DW_AT_name("CTL0")
     791                            .dwattr $C$DW$14, DW_AT_TI_symbol_name("CTL0")
     792                            .dwattr $C$DW$14, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     793                            .dwattr $C$DW$14, DW_AT_accessibility(DW_ACCESS_public)
     794                            .dwattr $C$DW$14, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices\
     795                            .dwattr $C$DW$14, DW_AT_decl_line(0x1da)
     796                            .dwattr $C$DW$14, DW_AT_decl_column(0x11)
     797                    
     798                    $C$DW$15        .dwtag  DW_TAG_member
     799                            .dwattr $C$DW$15, DW_AT_type(*$C$DW$T$23)
     800                            .dwattr $C$DW$15, DW_AT_name("CTL1")
     801                            .dwattr $C$DW$15, DW_AT_TI_symbol_name("CTL1")
     802                            .dwattr $C$DW$15, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     803                            .dwattr $C$DW$15, DW_AT_accessibility(DW_ACCESS_public)
     804                            .dwattr $C$DW$15, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices\
     805                            .dwattr $C$DW$15, DW_AT_decl_line(0x1db)
     806                            .dwattr $C$DW$15, DW_AT_decl_column(0x11)
     807                    
     808                    $C$DW$16        .dwtag  DW_TAG_member
     809                            .dwattr $C$DW$16, DW_AT_type(*$C$DW$T$23)
     810                            .dwattr $C$DW$16, DW_AT_name("CTL2")
     811                            .dwattr $C$DW$16, DW_AT_TI_symbol_name("CTL2")
     812                            .dwattr $C$DW$16, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     813                            .dwattr $C$DW$16, DW_AT_accessibility(DW_ACCESS_public)
     814                            .dwattr $C$DW$16, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices\
     815                            .dwattr $C$DW$16, DW_AT_decl_line(0x1dc)
     816                            .dwattr $C$DW$16, DW_AT_decl_column(0x11)
     817                    
     818                    $C$DW$17        .dwtag  DW_TAG_member
     819                            .dwattr $C$DW$17, DW_AT_type(*$C$DW$T$23)
     820                            .dwattr $C$DW$17, DW_AT_name("CTL3")
     821                            .dwattr $C$DW$17, DW_AT_TI_symbol_name("CTL3")
     822                            .dwattr $C$DW$17, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
     823                            .dwattr $C$DW$17, DW_AT_accessibility(DW_ACCESS_public)
     824                            .dwattr $C$DW$17, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices\
     825                            .dwattr $C$DW$17, DW_AT_decl_line(0x1dd)
TI ARM Assembler PC v18.12.2 Wed Dec 11 15:37:23 2019

Copyright (c) 1996-2018 Texas Instruments Incorporated
system_msp432p401r.asm                                               PAGE   16

     826                            .dwattr $C$DW$17, DW_AT_decl_column(0x11)
     827                    
     828                    $C$DW$18        .dwtag  DW_TAG_member
     829                            .dwattr $C$DW$18, DW_AT_type(*$C$DW$T$24)
     830                            .dwattr $C$DW$18, DW_AT_name("RESERVED0")
     831                            .dwattr $C$DW$18, DW_AT_TI_symbol_name("RESERVED0")
     832                            .dwattr $C$DW$18, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
     833                            .dwattr $C$DW$18, DW_AT_accessibility(DW_ACCESS_public)
     834                            .dwattr $C$DW$18, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices\
     835                            .dwattr $C$DW$18, DW_AT_decl_line(0x1de)
     836                            .dwattr $C$DW$18, DW_AT_decl_column(0x11)
     837                    
     838                    $C$DW$19        .dwtag  DW_TAG_member
     839                            .dwattr $C$DW$19, DW_AT_type(*$C$DW$T$23)
     840                            .dwattr $C$DW$19, DW_AT_name("CLKEN")
     841                            .dwattr $C$DW$19, DW_AT_TI_symbol_name("CLKEN")
     842                            .dwattr $C$DW$19, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
     843                            .dwattr $C$DW$19, DW_AT_accessibility(DW_ACCESS_public)
     844                            .dwattr $C$DW$19, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices\
     845                            .dwattr $C$DW$19, DW_AT_decl_line(0x1df)
     846                            .dwattr $C$DW$19, DW_AT_decl_column(0x11)
     847                    
     848                    $C$DW$20        .dwtag  DW_TAG_member
     849                            .dwattr $C$DW$20, DW_AT_type(*$C$DW$T$25)
     850                            .dwattr $C$DW$20, DW_AT_name("STAT")
     851                            .dwattr $C$DW$20, DW_AT_TI_symbol_name("STAT")
     852                            .dwattr $C$DW$20, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
     853                            .dwattr $C$DW$20, DW_AT_accessibility(DW_ACCESS_public)
     854                            .dwattr $C$DW$20, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices\
     855                            .dwattr $C$DW$20, DW_AT_decl_line(0x1e0)
     856                            .dwattr $C$DW$20, DW_AT_decl_column(0x11)
     857                    
     858                    $C$DW$21        .dwtag  DW_TAG_member
     859                            .dwattr $C$DW$21, DW_AT_type(*$C$DW$T$26)
     860                            .dwattr $C$DW$21, DW_AT_name("RESERVED1")
     861                            .dwattr $C$DW$21, DW_AT_TI_symbol_name("RESERVED1")
     862                            .dwattr $C$DW$21, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
     863                            .dwattr $C$DW$21, DW_AT_accessibility(DW_ACCESS_public)
     864                            .dwattr $C$DW$21, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices\
     865                            .dwattr $C$DW$21, DW_AT_decl_line(0x1e1)
     866                            .dwattr $C$DW$21, DW_AT_decl_column(0x11)
     867                    
     868                    $C$DW$22        .dwtag  DW_TAG_member
     869                            .dwattr $C$DW$22, DW_AT_type(*$C$DW$T$23)
     870                            .dwattr $C$DW$22, DW_AT_name("IE")
     871                            .dwattr $C$DW$22, DW_AT_TI_symbol_name("IE")
     872                            .dwattr $C$DW$22, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
     873                            .dwattr $C$DW$22, DW_AT_accessibility(DW_ACCESS_public)
     874                            .dwattr $C$DW$22, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices\
     875                            .dwattr $C$DW$22, DW_AT_decl_line(0x1e2)
     876                            .dwattr $C$DW$22, DW_AT_decl_column(0x11)
     877                    
     878                    $C$DW$23        .dwtag  DW_TAG_member
     879                            .dwattr $C$DW$23, DW_AT_type(*$C$DW$T$22)
     880                            .dwattr $C$DW$23, DW_AT_name("RESERVED2")
TI ARM Assembler PC v18.12.2 Wed Dec 11 15:37:23 2019

Copyright (c) 1996-2018 Texas Instruments Incorporated
system_msp432p401r.asm                                               PAGE   17

     881                            .dwattr $C$DW$23, DW_AT_TI_symbol_name("RESERVED2")
     882                            .dwattr $C$DW$23, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
     883                            .dwattr $C$DW$23, DW_AT_accessibility(DW_ACCESS_public)
     884                            .dwattr $C$DW$23, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices\
     885                            .dwattr $C$DW$23, DW_AT_decl_line(0x1e3)
     886                            .dwattr $C$DW$23, DW_AT_decl_column(0x11)
     887                    
     888                    $C$DW$24        .dwtag  DW_TAG_member
     889                            .dwattr $C$DW$24, DW_AT_type(*$C$DW$T$25)
     890                            .dwattr $C$DW$24, DW_AT_name("IFG")
     891                            .dwattr $C$DW$24, DW_AT_TI_symbol_name("IFG")
     892                            .dwattr $C$DW$24, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
     893                            .dwattr $C$DW$24, DW_AT_accessibility(DW_ACCESS_public)
     894                            .dwattr $C$DW$24, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices\
     895                            .dwattr $C$DW$24, DW_AT_decl_line(0x1e4)
     896                            .dwattr $C$DW$24, DW_AT_decl_column(0x11)
     897                    
     898                    $C$DW$25        .dwtag  DW_TAG_member
     899                            .dwattr $C$DW$25, DW_AT_type(*$C$DW$T$22)
     900                            .dwattr $C$DW$25, DW_AT_name("RESERVED3")
     901                            .dwattr $C$DW$25, DW_AT_TI_symbol_name("RESERVED3")
     902                            .dwattr $C$DW$25, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
     903                            .dwattr $C$DW$25, DW_AT_accessibility(DW_ACCESS_public)
     904                            .dwattr $C$DW$25, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices\
     905                            .dwattr $C$DW$25, DW_AT_decl_line(0x1e5)
     906                            .dwattr $C$DW$25, DW_AT_decl_column(0x11)
     907                    
     908                    $C$DW$26        .dwtag  DW_TAG_member
     909                            .dwattr $C$DW$26, DW_AT_type(*$C$DW$T$23)
     910                            .dwattr $C$DW$26, DW_AT_name("CLRIFG")
     911                            .dwattr $C$DW$26, DW_AT_TI_symbol_name("CLRIFG")
     912                            .dwattr $C$DW$26, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
     913                            .dwattr $C$DW$26, DW_AT_accessibility(DW_ACCESS_public)
     914                            .dwattr $C$DW$26, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices\
     915                            .dwattr $C$DW$26, DW_AT_decl_line(0x1e6)
     916                            .dwattr $C$DW$26, DW_AT_decl_column(0x11)
     917                    
     918                    $C$DW$27        .dwtag  DW_TAG_member
     919                            .dwattr $C$DW$27, DW_AT_type(*$C$DW$T$22)
     920                            .dwattr $C$DW$27, DW_AT_name("RESERVED4")
     921                            .dwattr $C$DW$27, DW_AT_TI_symbol_name("RESERVED4")
     922                            .dwattr $C$DW$27, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
     923                            .dwattr $C$DW$27, DW_AT_accessibility(DW_ACCESS_public)
     924                            .dwattr $C$DW$27, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices\
     925                            .dwattr $C$DW$27, DW_AT_decl_line(0x1e7)
     926                            .dwattr $C$DW$27, DW_AT_decl_column(0x11)
     927                    
     928                    $C$DW$28        .dwtag  DW_TAG_member
     929                            .dwattr $C$DW$28, DW_AT_type(*$C$DW$T$23)
     930                            .dwattr $C$DW$28, DW_AT_name("SETIFG")
     931                            .dwattr $C$DW$28, DW_AT_TI_symbol_name("SETIFG")
     932                            .dwattr $C$DW$28, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
     933                            .dwattr $C$DW$28, DW_AT_accessibility(DW_ACCESS_public)
     934                            .dwattr $C$DW$28, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices\
     935                            .dwattr $C$DW$28, DW_AT_decl_line(0x1e8)
TI ARM Assembler PC v18.12.2 Wed Dec 11 15:37:23 2019

Copyright (c) 1996-2018 Texas Instruments Incorporated
system_msp432p401r.asm                                               PAGE   18

     936                            .dwattr $C$DW$28, DW_AT_decl_column(0x11)
     937                    
     938                    $C$DW$29        .dwtag  DW_TAG_member
     939                            .dwattr $C$DW$29, DW_AT_type(*$C$DW$T$22)
     940                            .dwattr $C$DW$29, DW_AT_name("RESERVED5")
     941                            .dwattr $C$DW$29, DW_AT_TI_symbol_name("RESERVED5")
     942                            .dwattr $C$DW$29, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
     943                            .dwattr $C$DW$29, DW_AT_accessibility(DW_ACCESS_public)
     944                            .dwattr $C$DW$29, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices\
     945                            .dwattr $C$DW$29, DW_AT_decl_line(0x1e9)
     946                            .dwattr $C$DW$29, DW_AT_decl_column(0x11)
     947                    
     948                    $C$DW$30        .dwtag  DW_TAG_member
     949                            .dwattr $C$DW$30, DW_AT_type(*$C$DW$T$23)
     950                            .dwattr $C$DW$30, DW_AT_name("DCOERCAL0")
     951                            .dwattr $C$DW$30, DW_AT_TI_symbol_name("DCOERCAL0")
     952                            .dwattr $C$DW$30, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
     953                            .dwattr $C$DW$30, DW_AT_accessibility(DW_ACCESS_public)
     954                            .dwattr $C$DW$30, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices\
     955                            .dwattr $C$DW$30, DW_AT_decl_line(0x1ea)
     956                            .dwattr $C$DW$30, DW_AT_decl_column(0x11)
     957                    
     958                    $C$DW$31        .dwtag  DW_TAG_member
     959                            .dwattr $C$DW$31, DW_AT_type(*$C$DW$T$23)
     960                            .dwattr $C$DW$31, DW_AT_name("DCOERCAL1")
     961                            .dwattr $C$DW$31, DW_AT_TI_symbol_name("DCOERCAL1")
     962                            .dwattr $C$DW$31, DW_AT_data_member_location[DW_OP_plus_uconst 0x64]
     963                            .dwattr $C$DW$31, DW_AT_accessibility(DW_ACCESS_public)
     964                            .dwattr $C$DW$31, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices\
     965                            .dwattr $C$DW$31, DW_AT_decl_line(0x1eb)
     966                            .dwattr $C$DW$31, DW_AT_decl_column(0x11)
     967                    
     968                            .dwattr $C$DW$T$27, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\device
     969                            .dwattr $C$DW$T$27, DW_AT_decl_line(0x1d8)
     970                            .dwattr $C$DW$T$27, DW_AT_decl_column(0x10)
     971                            .dwendtag $C$DW$T$27
     972                    
     973                    $C$DW$T$184     .dwtag  DW_TAG_typedef
     974                            .dwattr $C$DW$T$184, DW_AT_name("CS_Type")
     975                            .dwattr $C$DW$T$184, DW_AT_type(*$C$DW$T$27)
     976                            .dwattr $C$DW$T$184, DW_AT_language(DW_LANG_C)
     977                            .dwattr $C$DW$T$184, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devic
     978                            .dwattr $C$DW$T$184, DW_AT_decl_line(0x1ec)
     979                            .dwattr $C$DW$T$184, DW_AT_decl_column(0x03)
     980                    
     981                    
     982                    $C$DW$T$28      .dwtag  DW_TAG_structure_type
     983                            .dwattr $C$DW$T$28, DW_AT_byte_size(0x14c)
     984                    $C$DW$32        .dwtag  DW_TAG_member
     985                            .dwattr $C$DW$32, DW_AT_type(*$C$DW$T$25)
     986                            .dwattr $C$DW$32, DW_AT_name("TLV_CHECKSUM")
     987                            .dwattr $C$DW$32, DW_AT_TI_symbol_name("TLV_CHECKSUM")
     988                            .dwattr $C$DW$32, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     989                            .dwattr $C$DW$32, DW_AT_accessibility(DW_ACCESS_public)
     990                            .dwattr $C$DW$32, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices\
TI ARM Assembler PC v18.12.2 Wed Dec 11 15:37:23 2019

Copyright (c) 1996-2018 Texas Instruments Incorporated
system_msp432p401r.asm                                               PAGE   19

     991                            .dwattr $C$DW$32, DW_AT_decl_line(0x4c4)
     992                            .dwattr $C$DW$32, DW_AT_decl_column(0x11)
     993                    
     994                    $C$DW$33        .dwtag  DW_TAG_member
     995                            .dwattr $C$DW$33, DW_AT_type(*$C$DW$T$25)
     996                            .dwattr $C$DW$33, DW_AT_name("DEVICE_INFO_TAG")
     997                            .dwattr $C$DW$33, DW_AT_TI_symbol_name("DEVICE_INFO_TAG")
     998                            .dwattr $C$DW$33, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     999                            .dwattr $C$DW$33, DW_AT_accessibility(DW_ACCESS_public)
    1000                            .dwattr $C$DW$33, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices\
    1001                            .dwattr $C$DW$33, DW_AT_decl_line(0x4c5)
    1002                            .dwattr $C$DW$33, DW_AT_decl_column(0x11)
    1003                    
    1004                    $C$DW$34        .dwtag  DW_TAG_member
    1005                            .dwattr $C$DW$34, DW_AT_type(*$C$DW$T$25)
    1006                            .dwattr $C$DW$34, DW_AT_name("DEVICE_INFO_LEN")
    1007                            .dwattr $C$DW$34, DW_AT_TI_symbol_name("DEVICE_INFO_LEN")
    1008                            .dwattr $C$DW$34, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1009                            .dwattr $C$DW$34, DW_AT_accessibility(DW_ACCESS_public)
    1010                            .dwattr $C$DW$34, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices\
    1011                            .dwattr $C$DW$34, DW_AT_decl_line(0x4c6)
    1012                            .dwattr $C$DW$34, DW_AT_decl_column(0x11)
    1013                    
    1014                    $C$DW$35        .dwtag  DW_TAG_member
    1015                            .dwattr $C$DW$35, DW_AT_type(*$C$DW$T$25)
    1016                            .dwattr $C$DW$35, DW_AT_name("DEVICE_ID")
    1017                            .dwattr $C$DW$35, DW_AT_TI_symbol_name("DEVICE_ID")
    1018                            .dwattr $C$DW$35, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1019                            .dwattr $C$DW$35, DW_AT_accessibility(DW_ACCESS_public)
    1020                            .dwattr $C$DW$35, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices\
    1021                            .dwattr $C$DW$35, DW_AT_decl_line(0x4c7)
    1022                            .dwattr $C$DW$35, DW_AT_decl_column(0x11)
    1023                    
    1024                    $C$DW$36        .dwtag  DW_TAG_member
    1025                            .dwattr $C$DW$36, DW_AT_type(*$C$DW$T$25)
    1026                            .dwattr $C$DW$36, DW_AT_name("HWREV")
    1027                            .dwattr $C$DW$36, DW_AT_TI_symbol_name("HWREV")
    1028                            .dwattr $C$DW$36, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1029                            .dwattr $C$DW$36, DW_AT_accessibility(DW_ACCESS_public)
    1030                            .dwattr $C$DW$36, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices\
    1031                            .dwattr $C$DW$36, DW_AT_decl_line(0x4c8)
    1032                            .dwattr $C$DW$36, DW_AT_decl_column(0x11)
    1033                    
    1034                    $C$DW$37        .dwtag  DW_TAG_member
    1035                            .dwattr $C$DW$37, DW_AT_type(*$C$DW$T$25)
    1036                            .dwattr $C$DW$37, DW_AT_name("BCREV")
    1037                            .dwattr $C$DW$37, DW_AT_TI_symbol_name("BCREV")
    1038                            .dwattr $C$DW$37, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1039                            .dwattr $C$DW$37, DW_AT_accessibility(DW_ACCESS_public)
    1040                            .dwattr $C$DW$37, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices\
    1041                            .dwattr $C$DW$37, DW_AT_decl_line(0x4c9)
    1042                            .dwattr $C$DW$37, DW_AT_decl_column(0x11)
    1043                    
    1044                    $C$DW$38        .dwtag  DW_TAG_member
    1045                            .dwattr $C$DW$38, DW_AT_type(*$C$DW$T$25)
TI ARM Assembler PC v18.12.2 Wed Dec 11 15:37:23 2019

Copyright (c) 1996-2018 Texas Instruments Incorporated
system_msp432p401r.asm                                               PAGE   20

    1046                            .dwattr $C$DW$38, DW_AT_name("ROM_DRVLIB_REV")
    1047                            .dwattr $C$DW$38, DW_AT_TI_symbol_name("ROM_DRVLIB_REV")
    1048                            .dwattr $C$DW$38, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1049                            .dwattr $C$DW$38, DW_AT_accessibility(DW_ACCESS_public)
    1050                            .dwattr $C$DW$38, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices\
    1051                            .dwattr $C$DW$38, DW_AT_decl_line(0x4ca)
    1052                            .dwattr $C$DW$38, DW_AT_decl_column(0x11)
    1053                    
    1054                    $C$DW$39        .dwtag  DW_TAG_member
    1055                            .dwattr $C$DW$39, DW_AT_type(*$C$DW$T$25)
    1056                            .dwattr $C$DW$39, DW_AT_name("DIE_REC_TAG")
    1057                            .dwattr $C$DW$39, DW_AT_TI_symbol_name("DIE_REC_TAG")
    1058                            .dwattr $C$DW$39, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    1059                            .dwattr $C$DW$39, DW_AT_accessibility(DW_ACCESS_public)
    1060                            .dwattr $C$DW$39, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices\
    1061                            .dwattr $C$DW$39, DW_AT_decl_line(0x4cb)
    1062                            .dwattr $C$DW$39, DW_AT_decl_column(0x11)
    1063                    
    1064                    $C$DW$40        .dwtag  DW_TAG_member
    1065                            .dwattr $C$DW$40, DW_AT_type(*$C$DW$T$25)
    1066                            .dwattr $C$DW$40, DW_AT_name("DIE_REC_LEN")
    1067                            .dwattr $C$DW$40, DW_AT_TI_symbol_name("DIE_REC_LEN")
    1068                            .dwattr $C$DW$40, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    1069                            .dwattr $C$DW$40, DW_AT_accessibility(DW_ACCESS_public)
    1070                            .dwattr $C$DW$40, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices\
    1071                            .dwattr $C$DW$40, DW_AT_decl_line(0x4cc)
    1072                            .dwattr $C$DW$40, DW_AT_decl_column(0x11)
    1073                    
    1074                    $C$DW$41        .dwtag  DW_TAG_member
    1075                            .dwattr $C$DW$41, DW_AT_type(*$C$DW$T$25)
    1076                            .dwattr $C$DW$41, DW_AT_name("DIE_XPOS")
    1077                            .dwattr $C$DW$41, DW_AT_TI_symbol_name("DIE_XPOS")
    1078                            .dwattr $C$DW$41, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    1079                            .dwattr $C$DW$41, DW_AT_accessibility(DW_ACCESS_public)
    1080                            .dwattr $C$DW$41, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices\
    1081                            .dwattr $C$DW$41, DW_AT_decl_line(0x4cd)
    1082                            .dwattr $C$DW$41, DW_AT_decl_column(0x11)
    1083                    
    1084                    $C$DW$42        .dwtag  DW_TAG_member
    1085                            .dwattr $C$DW$42, DW_AT_type(*$C$DW$T$25)
    1086                            .dwattr $C$DW$42, DW_AT_name("DIE_YPOS")
    1087                            .dwattr $C$DW$42, DW_AT_TI_symbol_name("DIE_YPOS")
    1088                            .dwattr $C$DW$42, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    1089                            .dwattr $C$DW$42, DW_AT_accessibility(DW_ACCESS_public)
    1090                            .dwattr $C$DW$42, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices\
    1091                            .dwattr $C$DW$42, DW_AT_decl_line(0x4ce)
    1092                            .dwattr $C$DW$42, DW_AT_decl_column(0x11)
    1093                    
    1094                    $C$DW$43        .dwtag  DW_TAG_member
    1095                            .dwattr $C$DW$43, DW_AT_type(*$C$DW$T$25)
    1096                            .dwattr $C$DW$43, DW_AT_name("WAFER_ID")
    1097                            .dwattr $C$DW$43, DW_AT_TI_symbol_name("WAFER_ID")
    1098                            .dwattr $C$DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    1099                            .dwattr $C$DW$43, DW_AT_accessibility(DW_ACCESS_public)
    1100                            .dwattr $C$DW$43, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices\
TI ARM Assembler PC v18.12.2 Wed Dec 11 15:37:23 2019

Copyright (c) 1996-2018 Texas Instruments Incorporated
system_msp432p401r.asm                                               PAGE   21

    1101                            .dwattr $C$DW$43, DW_AT_decl_line(0x4cf)
    1102                            .dwattr $C$DW$43, DW_AT_decl_column(0x11)
    1103                    
    1104                    $C$DW$44        .dwtag  DW_TAG_member
    1105                            .dwattr $C$DW$44, DW_AT_type(*$C$DW$T$25)
    1106                            .dwattr $C$DW$44, DW_AT_name("LOT_ID")
    1107                            .dwattr $C$DW$44, DW_AT_TI_symbol_name("LOT_ID")
    1108                            .dwattr $C$DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    1109                            .dwattr $C$DW$44, DW_AT_accessibility(DW_ACCESS_public)
    1110                            .dwattr $C$DW$44, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices\
    1111                            .dwattr $C$DW$44, DW_AT_decl_line(0x4d0)
    1112                            .dwattr $C$DW$44, DW_AT_decl_column(0x11)
    1113                    
    1114                    $C$DW$45        .dwtag  DW_TAG_member
    1115                            .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$25)
    1116                            .dwattr $C$DW$45, DW_AT_name("RESERVED0")
    1117                            .dwattr $C$DW$45, DW_AT_TI_symbol_name("RESERVED0")
    1118                            .dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    1119                            .dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)
    1120                            .dwattr $C$DW$45, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices\
    1121                            .dwattr $C$DW$45, DW_AT_decl_line(0x4d1)
    1122                            .dwattr $C$DW$45, DW_AT_decl_column(0x11)
    1123                    
    1124                    $C$DW$46        .dwtag  DW_TAG_member
    1125                            .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$25)
    1126                            .dwattr $C$DW$46, DW_AT_name("RESERVED1")
    1127                            .dwattr $C$DW$46, DW_AT_TI_symbol_name("RESERVED1")
    1128                            .dwattr $C$DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    1129                            .dwattr $C$DW$46, DW_AT_accessibility(DW_ACCESS_public)
    1130                            .dwattr $C$DW$46, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices\
    1131                            .dwattr $C$DW$46, DW_AT_decl_line(0x4d2)
    1132                            .dwattr $C$DW$46, DW_AT_decl_column(0x11)
    1133                    
    1134                    $C$DW$47        .dwtag  DW_TAG_member
    1135                            .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$25)
    1136                            .dwattr $C$DW$47, DW_AT_name("RESERVED2")
    1137                            .dwattr $C$DW$47, DW_AT_TI_symbol_name("RESERVED2")
    1138                            .dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    1139                            .dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
    1140                            .dwattr $C$DW$47, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices\
    1141                            .dwattr $C$DW$47, DW_AT_decl_line(0x4d3)
    1142                            .dwattr $C$DW$47, DW_AT_decl_column(0x11)
    1143                    
    1144                    $C$DW$48        .dwtag  DW_TAG_member
    1145                            .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$25)
    1146                            .dwattr $C$DW$48, DW_AT_name("TEST_RESULTS")
    1147                            .dwattr $C$DW$48, DW_AT_TI_symbol_name("TEST_RESULTS")
    1148                            .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    1149                            .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
    1150                            .dwattr $C$DW$48, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices\
    1151                            .dwattr $C$DW$48, DW_AT_decl_line(0x4d4)
    1152                            .dwattr $C$DW$48, DW_AT_decl_column(0x11)
    1153                    
    1154                    $C$DW$49        .dwtag  DW_TAG_member
    1155                            .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$25)
TI ARM Assembler PC v18.12.2 Wed Dec 11 15:37:23 2019

Copyright (c) 1996-2018 Texas Instruments Incorporated
system_msp432p401r.asm                                               PAGE   22

    1156                            .dwattr $C$DW$49, DW_AT_name("CS_CAL_TAG")
    1157                            .dwattr $C$DW$49, DW_AT_TI_symbol_name("CS_CAL_TAG")
    1158                            .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    1159                            .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
    1160                            .dwattr $C$DW$49, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices\
    1161                            .dwattr $C$DW$49, DW_AT_decl_line(0x4d5)
    1162                            .dwattr $C$DW$49, DW_AT_decl_column(0x11)
    1163                    
    1164                    $C$DW$50        .dwtag  DW_TAG_member
    1165                            .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$25)
    1166                            .dwattr $C$DW$50, DW_AT_name("CS_CAL_LEN")
    1167                            .dwattr $C$DW$50, DW_AT_TI_symbol_name("CS_CAL_LEN")
    1168                            .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    1169                            .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
    1170                            .dwattr $C$DW$50, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices\
    1171                            .dwattr $C$DW$50, DW_AT_decl_line(0x4d6)
    1172                            .dwattr $C$DW$50, DW_AT_decl_column(0x11)
    1173                    
    1174                    $C$DW$51        .dwtag  DW_TAG_member
    1175                            .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$25)
    1176                            .dwattr $C$DW$51, DW_AT_name("DCOIR_FCAL_RSEL04")
    1177                            .dwattr $C$DW$51, DW_AT_TI_symbol_name("DCOIR_FCAL_RSEL04")
    1178                            .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
    1179                            .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
    1180                            .dwattr $C$DW$51, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices\
    1181                            .dwattr $C$DW$51, DW_AT_decl_line(0x4d7)
    1182                            .dwattr $C$DW$51, DW_AT_decl_column(0x11)
    1183                    
    1184                    $C$DW$52        .dwtag  DW_TAG_member
    1185                            .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$25)
    1186                            .dwattr $C$DW$52, DW_AT_name("DCOIR_FCAL_RSEL5")
    1187                            .dwattr $C$DW$52, DW_AT_TI_symbol_name("DCOIR_FCAL_RSEL5")
    1188                            .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    1189                            .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
    1190                            .dwattr $C$DW$52, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices\
    1191                            .dwattr $C$DW$52, DW_AT_decl_line(0x4d8)
    1192                            .dwattr $C$DW$52, DW_AT_decl_column(0x11)
    1193                    
    1194                    $C$DW$53        .dwtag  DW_TAG_member
    1195                            .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$25)
    1196                            .dwattr $C$DW$53, DW_AT_name("RESERVED3")
    1197                            .dwattr $C$DW$53, DW_AT_TI_symbol_name("RESERVED3")
    1198                            .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
    1199                            .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
    1200                            .dwattr $C$DW$53, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices\
    1201                            .dwattr $C$DW$53, DW_AT_decl_line(0x4d9)
    1202                            .dwattr $C$DW$53, DW_AT_decl_column(0x11)
    1203                    
    1204                    $C$DW$54        .dwtag  DW_TAG_member
    1205                            .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$25)
    1206                            .dwattr $C$DW$54, DW_AT_name("RESERVED4")
    1207                            .dwattr $C$DW$54, DW_AT_TI_symbol_name("RESERVED4")
    1208                            .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    1209                            .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
    1210                            .dwattr $C$DW$54, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices\
TI ARM Assembler PC v18.12.2 Wed Dec 11 15:37:23 2019

Copyright (c) 1996-2018 Texas Instruments Incorporated
system_msp432p401r.asm                                               PAGE   23

    1211                            .dwattr $C$DW$54, DW_AT_decl_line(0x4da)
    1212                            .dwattr $C$DW$54, DW_AT_decl_column(0x11)
    1213                    
    1214                    $C$DW$55        .dwtag  DW_TAG_member
    1215                            .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$25)
    1216                            .dwattr $C$DW$55, DW_AT_name("RESERVED5")
    1217                            .dwattr $C$DW$55, DW_AT_TI_symbol_name("RESERVED5")
    1218                            .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    1219                            .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
    1220                            .dwattr $C$DW$55, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices\
    1221                            .dwattr $C$DW$55, DW_AT_decl_line(0x4db)
    1222                            .dwattr $C$DW$55, DW_AT_decl_column(0x11)
    1223                    
    1224                    $C$DW$56        .dwtag  DW_TAG_member
    1225                            .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$25)
    1226                            .dwattr $C$DW$56, DW_AT_name("RESERVED6")
    1227                            .dwattr $C$DW$56, DW_AT_TI_symbol_name("RESERVED6")
    1228                            .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    1229                            .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
    1230                            .dwattr $C$DW$56, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices\
    1231                            .dwattr $C$DW$56, DW_AT_decl_line(0x4dc)
    1232                            .dwattr $C$DW$56, DW_AT_decl_column(0x11)
    1233                    
    1234                    $C$DW$57        .dwtag  DW_TAG_member
    1235                            .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$25)
    1236                            .dwattr $C$DW$57, DW_AT_name("DCOIR_CONSTK_RSEL04")
    1237                            .dwattr $C$DW$57, DW_AT_TI_symbol_name("DCOIR_CONSTK_RSEL04")
    1238                            .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x64]
    1239                            .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
    1240                            .dwattr $C$DW$57, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices\
    1241                            .dwattr $C$DW$57, DW_AT_decl_line(0x4dd)
    1242                            .dwattr $C$DW$57, DW_AT_decl_column(0x11)
    1243                    
    1244                    $C$DW$58        .dwtag  DW_TAG_member
    1245                            .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$25)
    1246                            .dwattr $C$DW$58, DW_AT_name("DCOIR_CONSTK_RSEL5")
    1247                            .dwattr $C$DW$58, DW_AT_TI_symbol_name("DCOIR_CONSTK_RSEL5")
    1248                            .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
    1249                            .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
    1250                            .dwattr $C$DW$58, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices\
    1251                            .dwattr $C$DW$58, DW_AT_decl_line(0x4de)
    1252                            .dwattr $C$DW$58, DW_AT_decl_column(0x11)
    1253                    
    1254                    $C$DW$59        .dwtag  DW_TAG_member
    1255                            .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$25)
    1256                            .dwattr $C$DW$59, DW_AT_name("DCOER_FCAL_RSEL04")
    1257                            .dwattr $C$DW$59, DW_AT_TI_symbol_name("DCOER_FCAL_RSEL04")
    1258                            .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
    1259                            .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
    1260                            .dwattr $C$DW$59, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices\
    1261                            .dwattr $C$DW$59, DW_AT_decl_line(0x4df)
    1262                            .dwattr $C$DW$59, DW_AT_decl_column(0x11)
    1263                    
    1264                    $C$DW$60        .dwtag  DW_TAG_member
    1265                            .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$25)
TI ARM Assembler PC v18.12.2 Wed Dec 11 15:37:23 2019

Copyright (c) 1996-2018 Texas Instruments Incorporated
system_msp432p401r.asm                                               PAGE   24

    1266                            .dwattr $C$DW$60, DW_AT_name("DCOER_FCAL_RSEL5")
    1267                            .dwattr $C$DW$60, DW_AT_TI_symbol_name("DCOER_FCAL_RSEL5")
    1268                            .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x70]
    1269                            .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
    1270                            .dwattr $C$DW$60, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices\
    1271                            .dwattr $C$DW$60, DW_AT_decl_line(0x4e0)
    1272                            .dwattr $C$DW$60, DW_AT_decl_column(0x11)
    1273                    
    1274                    $C$DW$61        .dwtag  DW_TAG_member
    1275                            .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$25)
    1276                            .dwattr $C$DW$61, DW_AT_name("RESERVED7")
    1277                            .dwattr $C$DW$61, DW_AT_TI_symbol_name("RESERVED7")
    1278                            .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x74]
    1279                            .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
    1280                            .dwattr $C$DW$61, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices\
    1281                            .dwattr $C$DW$61, DW_AT_decl_line(0x4e1)
    1282                            .dwattr $C$DW$61, DW_AT_decl_column(0x11)
    1283                    
    1284                    $C$DW$62        .dwtag  DW_TAG_member
    1285                            .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$25)
    1286                            .dwattr $C$DW$62, DW_AT_name("RESERVED8")
    1287                            .dwattr $C$DW$62, DW_AT_TI_symbol_name("RESERVED8")
    1288                            .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    1289                            .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
    1290                            .dwattr $C$DW$62, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices\
    1291                            .dwattr $C$DW$62, DW_AT_decl_line(0x4e2)
    1292                            .dwattr $C$DW$62, DW_AT_decl_column(0x11)
    1293                    
    1294                    $C$DW$63        .dwtag  DW_TAG_member
    1295                            .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$25)
    1296                            .dwattr $C$DW$63, DW_AT_name("RESERVED9")
    1297                            .dwattr $C$DW$63, DW_AT_TI_symbol_name("RESERVED9")
    1298                            .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x7c]
    1299                            .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
    1300                            .dwattr $C$DW$63, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices\
    1301                            .dwattr $C$DW$63, DW_AT_decl_line(0x4e3)
    1302                            .dwattr $C$DW$63, DW_AT_decl_column(0x11)
    1303                    
    1304                    $C$DW$64        .dwtag  DW_TAG_member
    1305                            .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$25)
    1306                            .dwattr $C$DW$64, DW_AT_name("RESERVED10")
    1307                            .dwattr $C$DW$64, DW_AT_TI_symbol_name("RESERVED10")
    1308                            .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x80]
    1309                            .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
    1310                            .dwattr $C$DW$64, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices\
    1311                            .dwattr $C$DW$64, DW_AT_decl_line(0x4e4)
    1312                            .dwattr $C$DW$64, DW_AT_decl_column(0x11)
    1313                    
    1314                    $C$DW$65        .dwtag  DW_TAG_member
    1315                            .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$25)
    1316                            .dwattr $C$DW$65, DW_AT_name("DCOER_CONSTK_RSEL04")
    1317                            .dwattr $C$DW$65, DW_AT_TI_symbol_name("DCOER_CONSTK_RSEL04")
    1318                            .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
    1319                            .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
    1320                            .dwattr $C$DW$65, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices\
TI ARM Assembler PC v18.12.2 Wed Dec 11 15:37:23 2019

Copyright (c) 1996-2018 Texas Instruments Incorporated
system_msp432p401r.asm                                               PAGE   25

    1321                            .dwattr $C$DW$65, DW_AT_decl_line(0x4e5)
    1322                            .dwattr $C$DW$65, DW_AT_decl_column(0x11)
    1323                    
    1324                    $C$DW$66        .dwtag  DW_TAG_member
    1325                            .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$25)
    1326                            .dwattr $C$DW$66, DW_AT_name("DCOER_CONSTK_RSEL5")
    1327                            .dwattr $C$DW$66, DW_AT_TI_symbol_name("DCOER_CONSTK_RSEL5")
    1328                            .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x88]
    1329                            .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
    1330                            .dwattr $C$DW$66, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices\
    1331                            .dwattr $C$DW$66, DW_AT_decl_line(0x4e6)
    1332                            .dwattr $C$DW$66, DW_AT_decl_column(0x11)
    1333                    
    1334                    $C$DW$67        .dwtag  DW_TAG_member
    1335                            .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$25)
    1336                            .dwattr $C$DW$67, DW_AT_name("ADC14_CAL_TAG")
    1337                            .dwattr $C$DW$67, DW_AT_TI_symbol_name("ADC14_CAL_TAG")
    1338                            .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x8c]
    1339                            .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
    1340                            .dwattr $C$DW$67, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices\
    1341                            .dwattr $C$DW$67, DW_AT_decl_line(0x4e7)
    1342                            .dwattr $C$DW$67, DW_AT_decl_column(0x11)
    1343                    
    1344                    $C$DW$68        .dwtag  DW_TAG_member
    1345                            .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$25)
    1346                            .dwattr $C$DW$68, DW_AT_name("ADC14_CAL_LEN")
    1347                            .dwattr $C$DW$68, DW_AT_TI_symbol_name("ADC14_CAL_LEN")
    1348                            .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x90]
    1349                            .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
    1350                            .dwattr $C$DW$68, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices\
    1351                            .dwattr $C$DW$68, DW_AT_decl_line(0x4e8)
    1352                            .dwattr $C$DW$68, DW_AT_decl_column(0x11)
    1353                    
    1354                    $C$DW$69        .dwtag  DW_TAG_member
    1355                            .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$25)
    1356                            .dwattr $C$DW$69, DW_AT_name("ADC_GAIN_FACTOR")
    1357                            .dwattr $C$DW$69, DW_AT_TI_symbol_name("ADC_GAIN_FACTOR")
    1358                            .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x94]
    1359                            .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
    1360                            .dwattr $C$DW$69, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices\
    1361                            .dwattr $C$DW$69, DW_AT_decl_line(0x4e9)
    1362                            .dwattr $C$DW$69, DW_AT_decl_column(0x11)
    1363                    
    1364                    $C$DW$70        .dwtag  DW_TAG_member
    1365                            .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$25)
    1366                            .dwattr $C$DW$70, DW_AT_name("ADC_OFFSET")
    1367                            .dwattr $C$DW$70, DW_AT_TI_symbol_name("ADC_OFFSET")
    1368                            .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x98]
    1369                            .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
    1370                            .dwattr $C$DW$70, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices\
    1371                            .dwattr $C$DW$70, DW_AT_decl_line(0x4ea)
    1372                            .dwattr $C$DW$70, DW_AT_decl_column(0x11)
    1373                    
    1374                    $C$DW$71        .dwtag  DW_TAG_member
    1375                            .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$25)
TI ARM Assembler PC v18.12.2 Wed Dec 11 15:37:23 2019

Copyright (c) 1996-2018 Texas Instruments Incorporated
system_msp432p401r.asm                                               PAGE   26

    1376                            .dwattr $C$DW$71, DW_AT_name("RESERVED11")
    1377                            .dwattr $C$DW$71, DW_AT_TI_symbol_name("RESERVED11")
    1378                            .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x9c]
    1379                            .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
    1380                            .dwattr $C$DW$71, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices\
    1381                            .dwattr $C$DW$71, DW_AT_decl_line(0x4eb)
    1382                            .dwattr $C$DW$71, DW_AT_decl_column(0x11)
    1383                    
    1384                    $C$DW$72        .dwtag  DW_TAG_member
    1385                            .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$25)
    1386                            .dwattr $C$DW$72, DW_AT_name("RESERVED12")
    1387                            .dwattr $C$DW$72, DW_AT_TI_symbol_name("RESERVED12")
    1388                            .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    1389                            .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
    1390                            .dwattr $C$DW$72, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices\
    1391                            .dwattr $C$DW$72, DW_AT_decl_line(0x4ec)
    1392                            .dwattr $C$DW$72, DW_AT_decl_column(0x11)
    1393                    
    1394                    $C$DW$73        .dwtag  DW_TAG_member
    1395                            .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$25)
    1396                            .dwattr $C$DW$73, DW_AT_name("RESERVED13")
    1397                            .dwattr $C$DW$73, DW_AT_TI_symbol_name("RESERVED13")
    1398                            .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
    1399                            .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
    1400                            .dwattr $C$DW$73, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices\
    1401                            .dwattr $C$DW$73, DW_AT_decl_line(0x4ed)
    1402                            .dwattr $C$DW$73, DW_AT_decl_column(0x11)
    1403                    
    1404                    $C$DW$74        .dwtag  DW_TAG_member
    1405                            .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$25)
    1406                            .dwattr $C$DW$74, DW_AT_name("RESERVED14")
    1407                            .dwattr $C$DW$74, DW_AT_TI_symbol_name("RESERVED14")
    1408                            .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
    1409                            .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
    1410                            .dwattr $C$DW$74, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices\
    1411                            .dwattr $C$DW$74, DW_AT_decl_line(0x4ee)
    1412                            .dwattr $C$DW$74, DW_AT_decl_column(0x11)
    1413                    
    1414                    $C$DW$75        .dwtag  DW_TAG_member
    1415                            .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$25)
    1416                            .dwattr $C$DW$75, DW_AT_name("RESERVED15")
    1417                            .dwattr $C$DW$75, DW_AT_TI_symbol_name("RESERVED15")
    1418                            .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0xac]
    1419                            .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
    1420                            .dwattr $C$DW$75, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices\
    1421                            .dwattr $C$DW$75, DW_AT_decl_line(0x4ef)
    1422                            .dwattr $C$DW$75, DW_AT_decl_column(0x11)
    1423                    
    1424                    $C$DW$76        .dwtag  DW_TAG_member
    1425                            .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$25)
    1426                            .dwattr $C$DW$76, DW_AT_name("RESERVED16")
    1427                            .dwattr $C$DW$76, DW_AT_TI_symbol_name("RESERVED16")
    1428                            .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0xb0]
    1429                            .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
    1430                            .dwattr $C$DW$76, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices\
TI ARM Assembler PC v18.12.2 Wed Dec 11 15:37:23 2019

Copyright (c) 1996-2018 Texas Instruments Incorporated
system_msp432p401r.asm                                               PAGE   27

    1431                            .dwattr $C$DW$76, DW_AT_decl_line(0x4f0)
    1432                            .dwattr $C$DW$76, DW_AT_decl_column(0x11)
    1433                    
    1434                    $C$DW$77        .dwtag  DW_TAG_member
    1435                            .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$25)
    1436                            .dwattr $C$DW$77, DW_AT_name("RESERVED17")
    1437                            .dwattr $C$DW$77, DW_AT_TI_symbol_name("RESERVED17")
    1438                            .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0xb4]
    1439                            .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
    1440                            .dwattr $C$DW$77, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices\
    1441                            .dwattr $C$DW$77, DW_AT_decl_line(0x4f1)
    1442                            .dwattr $C$DW$77, DW_AT_decl_column(0x11)
    1443                    
    1444                    $C$DW$78        .dwtag  DW_TAG_member
    1445                            .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$25)
    1446                            .dwattr $C$DW$78, DW_AT_name("RESERVED18")
    1447                            .dwattr $C$DW$78, DW_AT_TI_symbol_name("RESERVED18")
    1448                            .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0xb8]
    1449                            .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
    1450                            .dwattr $C$DW$78, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices\
    1451                            .dwattr $C$DW$78, DW_AT_decl_line(0x4f2)
    1452                            .dwattr $C$DW$78, DW_AT_decl_column(0x11)
    1453                    
    1454                    $C$DW$79        .dwtag  DW_TAG_member
    1455                            .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$25)
    1456                            .dwattr $C$DW$79, DW_AT_name("RESERVED19")
    1457                            .dwattr $C$DW$79, DW_AT_TI_symbol_name("RESERVED19")
    1458                            .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0xbc]
    1459                            .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
    1460                            .dwattr $C$DW$79, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices\
    1461                            .dwattr $C$DW$79, DW_AT_decl_line(0x4f3)
    1462                            .dwattr $C$DW$79, DW_AT_decl_column(0x11)
    1463                    
    1464                    $C$DW$80        .dwtag  DW_TAG_member
    1465                            .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$25)
    1466                            .dwattr $C$DW$80, DW_AT_name("RESERVED20")
    1467                            .dwattr $C$DW$80, DW_AT_TI_symbol_name("RESERVED20")
    1468                            .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0xc0]
    1469                            .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
    1470                            .dwattr $C$DW$80, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices\
    1471                            .dwattr $C$DW$80, DW_AT_decl_line(0x4f4)
    1472                            .dwattr $C$DW$80, DW_AT_decl_column(0x11)
    1473                    
    1474                    $C$DW$81        .dwtag  DW_TAG_member
    1475                            .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$25)
    1476                            .dwattr $C$DW$81, DW_AT_name("RESERVED21")
    1477                            .dwattr $C$DW$81, DW_AT_TI_symbol_name("RESERVED21")
    1478                            .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
    1479                            .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
    1480                            .dwattr $C$DW$81, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices\
    1481                            .dwattr $C$DW$81, DW_AT_decl_line(0x4f5)
    1482                            .dwattr $C$DW$81, DW_AT_decl_column(0x11)
    1483                    
    1484                    $C$DW$82        .dwtag  DW_TAG_member
    1485                            .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$25)
TI ARM Assembler PC v18.12.2 Wed Dec 11 15:37:23 2019

Copyright (c) 1996-2018 Texas Instruments Incorporated
system_msp432p401r.asm                                               PAGE   28

    1486                            .dwattr $C$DW$82, DW_AT_name("RESERVED22")
    1487                            .dwattr $C$DW$82, DW_AT_TI_symbol_name("RESERVED22")
    1488                            .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0xc8]
    1489                            .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
    1490                            .dwattr $C$DW$82, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices\
    1491                            .dwattr $C$DW$82, DW_AT_decl_line(0x4f6)
    1492                            .dwattr $C$DW$82, DW_AT_decl_column(0x11)
    1493                    
    1494                    $C$DW$83        .dwtag  DW_TAG_member
    1495                            .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$25)
    1496                            .dwattr $C$DW$83, DW_AT_name("RESERVED23")
    1497                            .dwattr $C$DW$83, DW_AT_TI_symbol_name("RESERVED23")
    1498                            .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0xcc]
    1499                            .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    1500                            .dwattr $C$DW$83, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices\
    1501                            .dwattr $C$DW$83, DW_AT_decl_line(0x4f7)
    1502                            .dwattr $C$DW$83, DW_AT_decl_column(0x11)
    1503                    
    1504                    $C$DW$84        .dwtag  DW_TAG_member
    1505                            .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$25)
    1506                            .dwattr $C$DW$84, DW_AT_name("RESERVED24")
    1507                            .dwattr $C$DW$84, DW_AT_TI_symbol_name("RESERVED24")
    1508                            .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
    1509                            .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    1510                            .dwattr $C$DW$84, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices\
    1511                            .dwattr $C$DW$84, DW_AT_decl_line(0x4f8)
    1512                            .dwattr $C$DW$84, DW_AT_decl_column(0x11)
    1513                    
    1514                    $C$DW$85        .dwtag  DW_TAG_member
    1515                            .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$25)
    1516                            .dwattr $C$DW$85, DW_AT_name("RESERVED25")
    1517                            .dwattr $C$DW$85, DW_AT_TI_symbol_name("RESERVED25")
    1518                            .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0xd4]
    1519                            .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    1520                            .dwattr $C$DW$85, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices\
    1521                            .dwattr $C$DW$85, DW_AT_decl_line(0x4f9)
    1522                            .dwattr $C$DW$85, DW_AT_decl_column(0x11)
    1523                    
    1524                    $C$DW$86        .dwtag  DW_TAG_member
    1525                            .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$25)
    1526                            .dwattr $C$DW$86, DW_AT_name("RESERVED26")
    1527                            .dwattr $C$DW$86, DW_AT_TI_symbol_name("RESERVED26")
    1528                            .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0xd8]
    1529                            .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1530                            .dwattr $C$DW$86, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices\
    1531                            .dwattr $C$DW$86, DW_AT_decl_line(0x4fa)
    1532                            .dwattr $C$DW$86, DW_AT_decl_column(0x11)
    1533                    
    1534                    $C$DW$87        .dwtag  DW_TAG_member
    1535                            .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$25)
    1536                            .dwattr $C$DW$87, DW_AT_name("ADC14_REF1P2V_TS30C")
    1537                            .dwattr $C$DW$87, DW_AT_TI_symbol_name("ADC14_REF1P2V_TS30C")
    1538                            .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0xdc]
    1539                            .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1540                            .dwattr $C$DW$87, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices\
TI ARM Assembler PC v18.12.2 Wed Dec 11 15:37:23 2019

Copyright (c) 1996-2018 Texas Instruments Incorporated
system_msp432p401r.asm                                               PAGE   29

    1541                            .dwattr $C$DW$87, DW_AT_decl_line(0x4fb)
    1542                            .dwattr $C$DW$87, DW_AT_decl_column(0x11)
    1543                    
    1544                    $C$DW$88        .dwtag  DW_TAG_member
    1545                            .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$25)
    1546                            .dwattr $C$DW$88, DW_AT_name("ADC14_REF1P2V_TS85C")
    1547                            .dwattr $C$DW$88, DW_AT_TI_symbol_name("ADC14_REF1P2V_TS85C")
    1548                            .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0xe0]
    1549                            .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1550                            .dwattr $C$DW$88, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices\
    1551                            .dwattr $C$DW$88, DW_AT_decl_line(0x4fc)
    1552                            .dwattr $C$DW$88, DW_AT_decl_column(0x11)
    1553                    
    1554                    $C$DW$89        .dwtag  DW_TAG_member
    1555                            .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$25)
    1556                            .dwattr $C$DW$89, DW_AT_name("ADC14_REF1P45V_TS30C")
    1557                            .dwattr $C$DW$89, DW_AT_TI_symbol_name("ADC14_REF1P45V_TS30C")
    1558                            .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0xe4]
    1559                            .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1560                            .dwattr $C$DW$89, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices\
    1561                            .dwattr $C$DW$89, DW_AT_decl_line(0x4fd)
    1562                            .dwattr $C$DW$89, DW_AT_decl_column(0x11)
    1563                    
    1564                    $C$DW$90        .dwtag  DW_TAG_member
    1565                            .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$25)
    1566                            .dwattr $C$DW$90, DW_AT_name("ADC14_REF1P45V_TS85C")
    1567                            .dwattr $C$DW$90, DW_AT_TI_symbol_name("ADC14_REF1P45V_TS85C")
    1568                            .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0xe8]
    1569                            .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1570                            .dwattr $C$DW$90, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices\
    1571                            .dwattr $C$DW$90, DW_AT_decl_line(0x4fe)
    1572                            .dwattr $C$DW$90, DW_AT_decl_column(0x11)
    1573                    
    1574                    $C$DW$91        .dwtag  DW_TAG_member
    1575                            .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$25)
    1576                            .dwattr $C$DW$91, DW_AT_name("ADC14_REF2P5V_TS30C")
    1577                            .dwattr $C$DW$91, DW_AT_TI_symbol_name("ADC14_REF2P5V_TS30C")
    1578                            .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0xec]
    1579                            .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1580                            .dwattr $C$DW$91, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices\
    1581                            .dwattr $C$DW$91, DW_AT_decl_line(0x4ff)
    1582                            .dwattr $C$DW$91, DW_AT_decl_column(0x11)
    1583                    
    1584                    $C$DW$92        .dwtag  DW_TAG_member
    1585                            .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$25)
    1586                            .dwattr $C$DW$92, DW_AT_name("ADC14_REF2P5V_TS85C")
    1587                            .dwattr $C$DW$92, DW_AT_TI_symbol_name("ADC14_REF2P5V_TS85C")
    1588                            .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0xf0]
    1589                            .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1590                            .dwattr $C$DW$92, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices\
    1591                            .dwattr $C$DW$92, DW_AT_decl_line(0x500)
    1592                            .dwattr $C$DW$92, DW_AT_decl_column(0x11)
    1593                    
    1594                    $C$DW$93        .dwtag  DW_TAG_member
    1595                            .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$25)
TI ARM Assembler PC v18.12.2 Wed Dec 11 15:37:23 2019

Copyright (c) 1996-2018 Texas Instruments Incorporated
system_msp432p401r.asm                                               PAGE   30

    1596                            .dwattr $C$DW$93, DW_AT_name("REF_CAL_TAG")
    1597                            .dwattr $C$DW$93, DW_AT_TI_symbol_name("REF_CAL_TAG")
    1598                            .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0xf4]
    1599                            .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1600                            .dwattr $C$DW$93, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices\
    1601                            .dwattr $C$DW$93, DW_AT_decl_line(0x501)
    1602                            .dwattr $C$DW$93, DW_AT_decl_column(0x11)
    1603                    
    1604                    $C$DW$94        .dwtag  DW_TAG_member
    1605                            .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$25)
    1606                            .dwattr $C$DW$94, DW_AT_name("REF_CAL_LEN")
    1607                            .dwattr $C$DW$94, DW_AT_TI_symbol_name("REF_CAL_LEN")
    1608                            .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0xf8]
    1609                            .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1610                            .dwattr $C$DW$94, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices\
    1611                            .dwattr $C$DW$94, DW_AT_decl_line(0x502)
    1612                            .dwattr $C$DW$94, DW_AT_decl_column(0x11)
    1613                    
    1614                    $C$DW$95        .dwtag  DW_TAG_member
    1615                            .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$25)
    1616                            .dwattr $C$DW$95, DW_AT_name("REF_1P2V")
    1617                            .dwattr $C$DW$95, DW_AT_TI_symbol_name("REF_1P2V")
    1618                            .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0xfc]
    1619                            .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1620                            .dwattr $C$DW$95, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices\
    1621                            .dwattr $C$DW$95, DW_AT_decl_line(0x503)
    1622                            .dwattr $C$DW$95, DW_AT_decl_column(0x11)
    1623                    
    1624                    $C$DW$96        .dwtag  DW_TAG_member
    1625                            .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$25)
    1626                            .dwattr $C$DW$96, DW_AT_name("REF_1P45V")
    1627                            .dwattr $C$DW$96, DW_AT_TI_symbol_name("REF_1P45V")
    1628                            .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x100]
    1629                            .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1630                            .dwattr $C$DW$96, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices\
    1631                            .dwattr $C$DW$96, DW_AT_decl_line(0x504)
    1632                            .dwattr $C$DW$96, DW_AT_decl_column(0x11)
    1633                    
    1634                    $C$DW$97        .dwtag  DW_TAG_member
    1635                            .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$25)
    1636                            .dwattr $C$DW$97, DW_AT_name("REF_2P5V")
    1637                            .dwattr $C$DW$97, DW_AT_TI_symbol_name("REF_2P5V")
    1638                            .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x104]
    1639                            .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1640                            .dwattr $C$DW$97, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices\
    1641                            .dwattr $C$DW$97, DW_AT_decl_line(0x505)
    1642                            .dwattr $C$DW$97, DW_AT_decl_column(0x11)
    1643                    
    1644                    $C$DW$98        .dwtag  DW_TAG_member
    1645                            .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$25)
    1646                            .dwattr $C$DW$98, DW_AT_name("FLASH_INFO_TAG")
    1647                            .dwattr $C$DW$98, DW_AT_TI_symbol_name("FLASH_INFO_TAG")
    1648                            .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x108]
    1649                            .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1650                            .dwattr $C$DW$98, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices\
TI ARM Assembler PC v18.12.2 Wed Dec 11 15:37:23 2019

Copyright (c) 1996-2018 Texas Instruments Incorporated
system_msp432p401r.asm                                               PAGE   31

    1651                            .dwattr $C$DW$98, DW_AT_decl_line(0x506)
    1652                            .dwattr $C$DW$98, DW_AT_decl_column(0x11)
    1653                    
    1654                    $C$DW$99        .dwtag  DW_TAG_member
    1655                            .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$25)
    1656                            .dwattr $C$DW$99, DW_AT_name("FLASH_INFO_LEN")
    1657                            .dwattr $C$DW$99, DW_AT_TI_symbol_name("FLASH_INFO_LEN")
    1658                            .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x10c]
    1659                            .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1660                            .dwattr $C$DW$99, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices\
    1661                            .dwattr $C$DW$99, DW_AT_decl_line(0x507)
    1662                            .dwattr $C$DW$99, DW_AT_decl_column(0x11)
    1663                    
    1664                    $C$DW$100       .dwtag  DW_TAG_member
    1665                            .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$25)
    1666                            .dwattr $C$DW$100, DW_AT_name("FLASH_MAX_PROG_PULSES")
    1667                            .dwattr $C$DW$100, DW_AT_TI_symbol_name("FLASH_MAX_PROG_PULSES")
    1668                            .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x110]
    1669                            .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1670                            .dwattr $C$DW$100, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices
    1671                            .dwattr $C$DW$100, DW_AT_decl_line(0x508)
    1672                            .dwattr $C$DW$100, DW_AT_decl_column(0x11)
    1673                    
    1674                    $C$DW$101       .dwtag  DW_TAG_member
    1675                            .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$25)
    1676                            .dwattr $C$DW$101, DW_AT_name("FLASH_MAX_ERASE_PULSES")
    1677                            .dwattr $C$DW$101, DW_AT_TI_symbol_name("FLASH_MAX_ERASE_PULSES")
    1678                            .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x114]
    1679                            .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1680                            .dwattr $C$DW$101, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices
    1681                            .dwattr $C$DW$101, DW_AT_decl_line(0x509)
    1682                            .dwattr $C$DW$101, DW_AT_decl_column(0x11)
    1683                    
    1684                    $C$DW$102       .dwtag  DW_TAG_member
    1685                            .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$25)
    1686                            .dwattr $C$DW$102, DW_AT_name("RANDOM_NUM_TAG")
    1687                            .dwattr $C$DW$102, DW_AT_TI_symbol_name("RANDOM_NUM_TAG")
    1688                            .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x118]
    1689                            .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1690                            .dwattr $C$DW$102, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices
    1691                            .dwattr $C$DW$102, DW_AT_decl_line(0x50a)
    1692                            .dwattr $C$DW$102, DW_AT_decl_column(0x11)
    1693                    
    1694                    $C$DW$103       .dwtag  DW_TAG_member
    1695                            .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$25)
    1696                            .dwattr $C$DW$103, DW_AT_name("RANDOM_NUM_LEN")
    1697                            .dwattr $C$DW$103, DW_AT_TI_symbol_name("RANDOM_NUM_LEN")
    1698                            .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x11c]
    1699                            .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1700                            .dwattr $C$DW$103, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices
    1701                            .dwattr $C$DW$103, DW_AT_decl_line(0x50b)
    1702                            .dwattr $C$DW$103, DW_AT_decl_column(0x11)
    1703                    
    1704                    $C$DW$104       .dwtag  DW_TAG_member
    1705                            .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$25)
TI ARM Assembler PC v18.12.2 Wed Dec 11 15:37:23 2019

Copyright (c) 1996-2018 Texas Instruments Incorporated
system_msp432p401r.asm                                               PAGE   32

    1706                            .dwattr $C$DW$104, DW_AT_name("RANDOM_NUM_1")
    1707                            .dwattr $C$DW$104, DW_AT_TI_symbol_name("RANDOM_NUM_1")
    1708                            .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x120]
    1709                            .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1710                            .dwattr $C$DW$104, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices
    1711                            .dwattr $C$DW$104, DW_AT_decl_line(0x50c)
    1712                            .dwattr $C$DW$104, DW_AT_decl_column(0x11)
    1713                    
    1714                    $C$DW$105       .dwtag  DW_TAG_member
    1715                            .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$25)
    1716                            .dwattr $C$DW$105, DW_AT_name("RANDOM_NUM_2")
    1717                            .dwattr $C$DW$105, DW_AT_TI_symbol_name("RANDOM_NUM_2")
    1718                            .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x124]
    1719                            .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1720                            .dwattr $C$DW$105, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices
    1721                            .dwattr $C$DW$105, DW_AT_decl_line(0x50d)
    1722                            .dwattr $C$DW$105, DW_AT_decl_column(0x11)
    1723                    
    1724                    $C$DW$106       .dwtag  DW_TAG_member
    1725                            .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$25)
    1726                            .dwattr $C$DW$106, DW_AT_name("RANDOM_NUM_3")
    1727                            .dwattr $C$DW$106, DW_AT_TI_symbol_name("RANDOM_NUM_3")
    1728                            .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x128]
    1729                            .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1730                            .dwattr $C$DW$106, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices
    1731                            .dwattr $C$DW$106, DW_AT_decl_line(0x50e)
    1732                            .dwattr $C$DW$106, DW_AT_decl_column(0x11)
    1733                    
    1734                    $C$DW$107       .dwtag  DW_TAG_member
    1735                            .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$25)
    1736                            .dwattr $C$DW$107, DW_AT_name("RANDOM_NUM_4")
    1737                            .dwattr $C$DW$107, DW_AT_TI_symbol_name("RANDOM_NUM_4")
    1738                            .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x12c]
    1739                            .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1740                            .dwattr $C$DW$107, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices
    1741                            .dwattr $C$DW$107, DW_AT_decl_line(0x50f)
    1742                            .dwattr $C$DW$107, DW_AT_decl_column(0x11)
    1743                    
    1744                    $C$DW$108       .dwtag  DW_TAG_member
    1745                            .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$25)
    1746                            .dwattr $C$DW$108, DW_AT_name("BSL_CFG_TAG")
    1747                            .dwattr $C$DW$108, DW_AT_TI_symbol_name("BSL_CFG_TAG")
    1748                            .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x130]
    1749                            .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1750                            .dwattr $C$DW$108, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices
    1751                            .dwattr $C$DW$108, DW_AT_decl_line(0x510)
    1752                            .dwattr $C$DW$108, DW_AT_decl_column(0x11)
    1753                    
    1754                    $C$DW$109       .dwtag  DW_TAG_member
    1755                            .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$25)
    1756                            .dwattr $C$DW$109, DW_AT_name("BSL_CFG_LEN")
    1757                            .dwattr $C$DW$109, DW_AT_TI_symbol_name("BSL_CFG_LEN")
    1758                            .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x134]
    1759                            .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1760                            .dwattr $C$DW$109, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices
TI ARM Assembler PC v18.12.2 Wed Dec 11 15:37:23 2019

Copyright (c) 1996-2018 Texas Instruments Incorporated
system_msp432p401r.asm                                               PAGE   33

    1761                            .dwattr $C$DW$109, DW_AT_decl_line(0x511)
    1762                            .dwattr $C$DW$109, DW_AT_decl_column(0x11)
    1763                    
    1764                    $C$DW$110       .dwtag  DW_TAG_member
    1765                            .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$25)
    1766                            .dwattr $C$DW$110, DW_AT_name("BSL_PERIPHIF_SEL")
    1767                            .dwattr $C$DW$110, DW_AT_TI_symbol_name("BSL_PERIPHIF_SEL")
    1768                            .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x138]
    1769                            .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1770                            .dwattr $C$DW$110, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices
    1771                            .dwattr $C$DW$110, DW_AT_decl_line(0x512)
    1772                            .dwattr $C$DW$110, DW_AT_decl_column(0x11)
    1773                    
    1774                    $C$DW$111       .dwtag  DW_TAG_member
    1775                            .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$25)
    1776                            .dwattr $C$DW$111, DW_AT_name("BSL_PORTIF_CFG_UART")
    1777                            .dwattr $C$DW$111, DW_AT_TI_symbol_name("BSL_PORTIF_CFG_UART")
    1778                            .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x13c]
    1779                            .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1780                            .dwattr $C$DW$111, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices
    1781                            .dwattr $C$DW$111, DW_AT_decl_line(0x513)
    1782                            .dwattr $C$DW$111, DW_AT_decl_column(0x11)
    1783                    
    1784                    $C$DW$112       .dwtag  DW_TAG_member
    1785                            .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$25)
    1786                            .dwattr $C$DW$112, DW_AT_name("BSL_PORTIF_CFG_SPI")
    1787                            .dwattr $C$DW$112, DW_AT_TI_symbol_name("BSL_PORTIF_CFG_SPI")
    1788                            .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x140]
    1789                            .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1790                            .dwattr $C$DW$112, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices
    1791                            .dwattr $C$DW$112, DW_AT_decl_line(0x514)
    1792                            .dwattr $C$DW$112, DW_AT_decl_column(0x11)
    1793                    
    1794                    $C$DW$113       .dwtag  DW_TAG_member
    1795                            .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$25)
    1796                            .dwattr $C$DW$113, DW_AT_name("BSL_PORTIF_CFG_I2C")
    1797                            .dwattr $C$DW$113, DW_AT_TI_symbol_name("BSL_PORTIF_CFG_I2C")
    1798                            .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x144]
    1799                            .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1800                            .dwattr $C$DW$113, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices
    1801                            .dwattr $C$DW$113, DW_AT_decl_line(0x515)
    1802                            .dwattr $C$DW$113, DW_AT_decl_column(0x11)
    1803                    
    1804                    $C$DW$114       .dwtag  DW_TAG_member
    1805                            .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$25)
    1806                            .dwattr $C$DW$114, DW_AT_name("TLV_END")
    1807                            .dwattr $C$DW$114, DW_AT_TI_symbol_name("TLV_END")
    1808                            .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x148]
    1809                            .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1810                            .dwattr $C$DW$114, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices
    1811                            .dwattr $C$DW$114, DW_AT_decl_line(0x516)
    1812                            .dwattr $C$DW$114, DW_AT_decl_column(0x11)
    1813                    
    1814                            .dwattr $C$DW$T$28, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\device
    1815                            .dwattr $C$DW$T$28, DW_AT_decl_line(0x4c3)
TI ARM Assembler PC v18.12.2 Wed Dec 11 15:37:23 2019

Copyright (c) 1996-2018 Texas Instruments Incorporated
system_msp432p401r.asm                                               PAGE   34

    1816                            .dwattr $C$DW$T$28, DW_AT_decl_column(0x10)
    1817                            .dwendtag $C$DW$T$28
    1818                    
    1819                    $C$DW$T$186     .dwtag  DW_TAG_typedef
    1820                            .dwattr $C$DW$T$186, DW_AT_name("TLV_Type")
    1821                            .dwattr $C$DW$T$186, DW_AT_type(*$C$DW$T$28)
    1822                            .dwattr $C$DW$T$186, DW_AT_language(DW_LANG_C)
    1823                            .dwattr $C$DW$T$186, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devic
    1824                            .dwattr $C$DW$T$186, DW_AT_decl_line(0x517)
    1825                            .dwattr $C$DW$T$186, DW_AT_decl_column(0x03)
    1826                    
    1827                    
    1828                    $C$DW$T$37      .dwtag  DW_TAG_structure_type
    1829                            .dwattr $C$DW$T$37, DW_AT_byte_size(0x8c)
    1830                    $C$DW$115       .dwtag  DW_TAG_member
    1831                            .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$25)
    1832                            .dwattr $C$DW$115, DW_AT_name("CPUID")
    1833                            .dwattr $C$DW$115, DW_AT_TI_symbol_name("CPUID")
    1834                            .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1835                            .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1836                            .dwattr $C$DW$115, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_part
    1837                            .dwattr $C$DW$115, DW_AT_decl_line(0x1ba)
    1838                            .dwattr $C$DW$115, DW_AT_decl_column(0x12)
    1839                    
    1840                    $C$DW$116       .dwtag  DW_TAG_member
    1841                            .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$23)
    1842                            .dwattr $C$DW$116, DW_AT_name("ICSR")
    1843                            .dwattr $C$DW$116, DW_AT_TI_symbol_name("ICSR")
    1844                            .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1845                            .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1846                            .dwattr $C$DW$116, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_part
    1847                            .dwattr $C$DW$116, DW_AT_decl_line(0x1bb)
    1848                            .dwattr $C$DW$116, DW_AT_decl_column(0x12)
    1849                    
    1850                    $C$DW$117       .dwtag  DW_TAG_member
    1851                            .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$23)
    1852                            .dwattr $C$DW$117, DW_AT_name("VTOR")
    1853                            .dwattr $C$DW$117, DW_AT_TI_symbol_name("VTOR")
    1854                            .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1855                            .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1856                            .dwattr $C$DW$117, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_part
    1857                            .dwattr $C$DW$117, DW_AT_decl_line(0x1bc)
