TI ARM Assembler PC v18.12.2 Sat Dec 14 17:40:32 2019

Copyright (c) 1996-2018 Texas Instruments Incorporated
UART.asm                                                             PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM G3 C/C++ Codegen                                            PC v18.12.2.LTS *
       3                    ;* Date/Time created: Sat Dec 14 17:40:31 2019                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --embed
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../UART.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM G3 C/C++ Codegen PC v18.12.2.LTS Copyright (c) 199
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\Hp\workspace_v9_TIMSP432\BL_MASTER\Debug")
      13                    ;       C:\ti\ccs910\ccs\tools\compiler\ti-cgt-arm_18.12.2.LTS\bin\armacpia.exe -@C:\\Users\\Hp\\AppDa

     558                    ;******************************************************************************
     559                    ;* CONSTANT TABLE                                                             *
     560                    ;******************************************************************************
     561 00000046                   .sect   ".text:UART2_Init"
     562                            .align  4
     563 00000046 4C2A46C0  ||$C$CON5||:    .bits           0x40004c2a,32
         0000004a 00004000 
     564                    
     565                            .align  4
     566 0000004a 18004000  ||$C$CON6||:    .bits           0x40001800,32
         0000004e 00004000 
     567                    
     568                            .align  4
     569 0000004e 18064000  ||$C$CON7||:    .bits           0x40001806,32
         00000052 00004000 
     570                    
     571                            .align  4
     572 00000052 18084000  ||$C$CON8||:    .bits           0x40001808,32
         00000056 00004000 
     573                    
     574                            .align  4
     575 00000056 181C4000  ||$C$CON9||:    .bits           0x4000181c,32
         0000005a 00004000 
     576                    
     577                            .align  4
     578 0000005a 181A4000  ||$C$CON10||:   .bits           0x4000181a,32
         0000005e 00004000 
     579                    
     580                    ;******************************************************************************
     581                    ;* CONSTANT TABLE                                                             *
     582                    ;******************************************************************************
     583 00000046                   .sect   ".text:UART0_Init"
     584                            .align  4
     585 00000046 4C0A46C0  ||$C$CON11||:   .bits           0x40004c0a,32
         0000004a 00004000 
     586                    
     587                            .align  4
     588 0000004a 10004000  ||$C$CON12||:   .bits           0x40001000,32
         0000004e 00004000 
     589                    
     590                            .align  4
     591 0000004e 10064000  ||$C$CON13||:   .bits           0x40001006,32
         00000052 00004000 
     592                    
     593                            .align  4
     594 00000052 10084000  ||$C$CON14||:   .bits           0x40001008,32
         00000056 00004000 
     595                    
TI ARM Assembler PC v18.12.2 Sat Dec 14 17:40:32 2019

Copyright (c) 1996-2018 Texas Instruments Incorporated
UART.asm                                                             PAGE   12

     596                            .align  4
     597 00000056 101C4000  ||$C$CON15||:   .bits           0x4000101c,32
         0000005a 00004000 
     598                    
     599                            .align  4
     600 0000005a 101A4000  ||$C$CON16||:   .bits           0x4000101a,32
         0000005e 00004000 
     601                    
     602                    ;******************************************************************************
     603                    ;* CONSTANT TABLE                                                             *
     604                    ;******************************************************************************
     605 0000005a                   .sect   ".text:SD_Transmission"
     606                            .align  4
     607 0000005a 181C46C0  ||$C$CON17||:   .bits           0x4000181c,32
         0000005e 00004000 
     608                    
     609                            .align  4
     610 0000005e 180E4000  ||$C$CON18||:   .bits           0x4000180e,32
         00000062 00004000 
     611                    
     612                    
     613                    ;******************************************************************************
     614                    ;* BUILD ATTRIBUTES                                                           *
     615                    ;******************************************************************************
     616                            .battr "aeabi", Tag_File, 1, Tag_ABI_PCS_wchar_t(2)
     617                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_rounding(0)
     618                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_denormal(0)
     619                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_exceptions(0)
     620                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_number_model(1)
     621                            .battr "aeabi", Tag_File, 1, Tag_ABI_enum_size(1)
     622                            .battr "aeabi", Tag_File, 1, Tag_ABI_optimization_goals(5)
     623                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_optimization_goals(0)
     624                            .battr "TI", Tag_File, 1, Tag_Bitfield_layout(0)
     625                            .battr "aeabi", Tag_File, 1, Tag_ABI_VFP_args(3)
     626                            .battr "TI", Tag_File, 1, Tag_FP_interface(1)
     627                    
     628                    ;******************************************************************************
     629                    ;* TYPE INFORMATION                                                           *
     630                    ;******************************************************************************
     631                    
     632                    $C$DW$T$26      .dwtag  DW_TAG_structure_type
     633                            .dwattr $C$DW$T$26, DW_AT_byte_size(0x20)
     634                    $C$DW$20        .dwtag  DW_TAG_member
     635                            .dwattr $C$DW$20, DW_AT_type(*$C$DW$T$23)
     636                            .dwattr $C$DW$20, DW_AT_name("CTLW0")
     637                            .dwattr $C$DW$20, DW_AT_TI_symbol_name("CTLW0")
     638                            .dwattr $C$DW$20, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     639                            .dwattr $C$DW$20, DW_AT_accessibility(DW_ACCESS_public)
     640                            .dwattr $C$DW$20, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices\
     641                            .dwattr $C$DW$20, DW_AT_decl_line(0x2f2)
     642                            .dwattr $C$DW$20, DW_AT_decl_column(0x11)
     643                    
     644                    $C$DW$21        .dwtag  DW_TAG_member
     645                            .dwattr $C$DW$21, DW_AT_type(*$C$DW$T$23)
     646                            .dwattr $C$DW$21, DW_AT_name("CTLW1")
TI ARM Assembler PC v18.12.2 Sat Dec 14 17:40:32 2019

Copyright (c) 1996-2018 Texas Instruments Incorporated
UART.asm                                                             PAGE   13

     647                            .dwattr $C$DW$21, DW_AT_TI_symbol_name("CTLW1")
     648                            .dwattr $C$DW$21, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     649                            .dwattr $C$DW$21, DW_AT_accessibility(DW_ACCESS_public)
     650                            .dwattr $C$DW$21, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices\
     651                            .dwattr $C$DW$21, DW_AT_decl_line(0x2f3)
     652                            .dwattr $C$DW$21, DW_AT_decl_column(0x11)
     653                    
     654                    $C$DW$22        .dwtag  DW_TAG_member
     655                            .dwattr $C$DW$22, DW_AT_type(*$C$DW$T$22)
     656                            .dwattr $C$DW$22, DW_AT_name("RESERVED0")
     657                            .dwattr $C$DW$22, DW_AT_TI_symbol_name("RESERVED0")
     658                            .dwattr $C$DW$22, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     659                            .dwattr $C$DW$22, DW_AT_accessibility(DW_ACCESS_public)
     660                            .dwattr $C$DW$22, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices\
     661                            .dwattr $C$DW$22, DW_AT_decl_line(0x2f4)
     662                            .dwattr $C$DW$22, DW_AT_decl_column(0x11)
     663                    
     664                    $C$DW$23        .dwtag  DW_TAG_member
     665                            .dwattr $C$DW$23, DW_AT_type(*$C$DW$T$23)
     666                            .dwattr $C$DW$23, DW_AT_name("BRW")
     667                            .dwattr $C$DW$23, DW_AT_TI_symbol_name("BRW")
     668                            .dwattr $C$DW$23, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     669                            .dwattr $C$DW$23, DW_AT_accessibility(DW_ACCESS_public)
     670                            .dwattr $C$DW$23, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices\
     671                            .dwattr $C$DW$23, DW_AT_decl_line(0x2f5)
     672                            .dwattr $C$DW$23, DW_AT_decl_column(0x11)
     673                    
     674                    $C$DW$24        .dwtag  DW_TAG_member
     675                            .dwattr $C$DW$24, DW_AT_type(*$C$DW$T$23)
     676                            .dwattr $C$DW$24, DW_AT_name("MCTLW")
     677                            .dwattr $C$DW$24, DW_AT_TI_symbol_name("MCTLW")
     678                            .dwattr $C$DW$24, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     679                            .dwattr $C$DW$24, DW_AT_accessibility(DW_ACCESS_public)
     680                            .dwattr $C$DW$24, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices\
     681                            .dwattr $C$DW$24, DW_AT_decl_line(0x2f6)
     682                            .dwattr $C$DW$24, DW_AT_decl_column(0x11)
     683                    
     684                    $C$DW$25        .dwtag  DW_TAG_member
     685                            .dwattr $C$DW$25, DW_AT_type(*$C$DW$T$23)
     686                            .dwattr $C$DW$25, DW_AT_name("STATW")
     687                            .dwattr $C$DW$25, DW_AT_TI_symbol_name("STATW")
     688                            .dwattr $C$DW$25, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     689                            .dwattr $C$DW$25, DW_AT_accessibility(DW_ACCESS_public)
     690                            .dwattr $C$DW$25, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices\
     691                            .dwattr $C$DW$25, DW_AT_decl_line(0x2f7)
     692                            .dwattr $C$DW$25, DW_AT_decl_column(0x11)
     693                    
     694                    $C$DW$26        .dwtag  DW_TAG_member
     695                            .dwattr $C$DW$26, DW_AT_type(*$C$DW$T$24)
     696                            .dwattr $C$DW$26, DW_AT_name("RXBUF")
     697                            .dwattr $C$DW$26, DW_AT_TI_symbol_name("RXBUF")
     698                            .dwattr $C$DW$26, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     699                            .dwattr $C$DW$26, DW_AT_accessibility(DW_ACCESS_public)
     700                            .dwattr $C$DW$26, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices\
     701                            .dwattr $C$DW$26, DW_AT_decl_line(0x2f8)
TI ARM Assembler PC v18.12.2 Sat Dec 14 17:40:32 2019

Copyright (c) 1996-2018 Texas Instruments Incorporated
UART.asm                                                             PAGE   14

     702                            .dwattr $C$DW$26, DW_AT_decl_column(0x11)
     703                    
     704                    $C$DW$27        .dwtag  DW_TAG_member
     705                            .dwattr $C$DW$27, DW_AT_type(*$C$DW$T$23)
     706                            .dwattr $C$DW$27, DW_AT_name("TXBUF")
     707                            .dwattr $C$DW$27, DW_AT_TI_symbol_name("TXBUF")
     708                            .dwattr $C$DW$27, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
     709                            .dwattr $C$DW$27, DW_AT_accessibility(DW_ACCESS_public)
     710                            .dwattr $C$DW$27, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices\
     711                            .dwattr $C$DW$27, DW_AT_decl_line(0x2f9)
     712                            .dwattr $C$DW$27, DW_AT_decl_column(0x11)
     713                    
     714                    $C$DW$28        .dwtag  DW_TAG_member
     715                            .dwattr $C$DW$28, DW_AT_type(*$C$DW$T$23)
     716                            .dwattr $C$DW$28, DW_AT_name("ABCTL")
     717                            .dwattr $C$DW$28, DW_AT_TI_symbol_name("ABCTL")
     718                            .dwattr $C$DW$28, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
     719                            .dwattr $C$DW$28, DW_AT_accessibility(DW_ACCESS_public)
     720                            .dwattr $C$DW$28, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices\
     721                            .dwattr $C$DW$28, DW_AT_decl_line(0x2fa)
     722                            .dwattr $C$DW$28, DW_AT_decl_column(0x11)
     723                    
     724                    $C$DW$29        .dwtag  DW_TAG_member
     725                            .dwattr $C$DW$29, DW_AT_type(*$C$DW$T$23)
     726                            .dwattr $C$DW$29, DW_AT_name("IRCTL")
     727                            .dwattr $C$DW$29, DW_AT_TI_symbol_name("IRCTL")
     728                            .dwattr $C$DW$29, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
     729                            .dwattr $C$DW$29, DW_AT_accessibility(DW_ACCESS_public)
     730                            .dwattr $C$DW$29, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices\
     731                            .dwattr $C$DW$29, DW_AT_decl_line(0x2fb)
     732                            .dwattr $C$DW$29, DW_AT_decl_column(0x11)
     733                    
     734                    $C$DW$30        .dwtag  DW_TAG_member
     735                            .dwattr $C$DW$30, DW_AT_type(*$C$DW$T$25)
     736                            .dwattr $C$DW$30, DW_AT_name("RESERVED1")
     737                            .dwattr $C$DW$30, DW_AT_TI_symbol_name("RESERVED1")
     738                            .dwattr $C$DW$30, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
     739                            .dwattr $C$DW$30, DW_AT_accessibility(DW_ACCESS_public)
     740                            .dwattr $C$DW$30, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices\
     741                            .dwattr $C$DW$30, DW_AT_decl_line(0x2fc)
     742                            .dwattr $C$DW$30, DW_AT_decl_column(0x11)
     743                    
     744                    $C$DW$31        .dwtag  DW_TAG_member
     745                            .dwattr $C$DW$31, DW_AT_type(*$C$DW$T$23)
     746                            .dwattr $C$DW$31, DW_AT_name("IE")
     747                            .dwattr $C$DW$31, DW_AT_TI_symbol_name("IE")
     748                            .dwattr $C$DW$31, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
     749                            .dwattr $C$DW$31, DW_AT_accessibility(DW_ACCESS_public)
     750                            .dwattr $C$DW$31, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices\
     751                            .dwattr $C$DW$31, DW_AT_decl_line(0x2fd)
     752                            .dwattr $C$DW$31, DW_AT_decl_column(0x11)
     753                    
     754                    $C$DW$32        .dwtag  DW_TAG_member
     755                            .dwattr $C$DW$32, DW_AT_type(*$C$DW$T$23)
     756                            .dwattr $C$DW$32, DW_AT_name("IFG")
TI ARM Assembler PC v18.12.2 Sat Dec 14 17:40:32 2019

Copyright (c) 1996-2018 Texas Instruments Incorporated
UART.asm                                                             PAGE   15

     757                            .dwattr $C$DW$32, DW_AT_TI_symbol_name("IFG")
     758                            .dwattr $C$DW$32, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
     759                            .dwattr $C$DW$32, DW_AT_accessibility(DW_ACCESS_public)
     760                            .dwattr $C$DW$32, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices\
     761                            .dwattr $C$DW$32, DW_AT_decl_line(0x2fe)
     762                            .dwattr $C$DW$32, DW_AT_decl_column(0x11)
     763                    
     764                    $C$DW$33        .dwtag  DW_TAG_member
     765                            .dwattr $C$DW$33, DW_AT_type(*$C$DW$T$24)
     766                            .dwattr $C$DW$33, DW_AT_name("IV")
     767                            .dwattr $C$DW$33, DW_AT_TI_symbol_name("IV")
     768                            .dwattr $C$DW$33, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
     769                            .dwattr $C$DW$33, DW_AT_accessibility(DW_ACCESS_public)
     770                            .dwattr $C$DW$33, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices\
     771                            .dwattr $C$DW$33, DW_AT_decl_line(0x2ff)
     772                            .dwattr $C$DW$33, DW_AT_decl_column(0x11)
     773                    
     774                            .dwattr $C$DW$T$26, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\device
     775                            .dwattr $C$DW$T$26, DW_AT_decl_line(0x2f1)
     776                            .dwattr $C$DW$T$26, DW_AT_decl_column(0x10)
     777                            .dwendtag $C$DW$T$26
     778                    
     779                    $C$DW$T$184     .dwtag  DW_TAG_typedef
     780                            .dwattr $C$DW$T$184, DW_AT_name("EUSCI_A_Type")
     781                            .dwattr $C$DW$T$184, DW_AT_type(*$C$DW$T$26)
     782                            .dwattr $C$DW$T$184, DW_AT_language(DW_LANG_C)
     783                            .dwattr $C$DW$T$184, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devic
     784                            .dwattr $C$DW$T$184, DW_AT_decl_line(0x300)
     785                            .dwattr $C$DW$T$184, DW_AT_decl_column(0x03)
     786                    
     787                    
     788                    $C$DW$T$32      .dwtag  DW_TAG_structure_type
     789                            .dwattr $C$DW$T$32, DW_AT_byte_size(0x1e)
     790                    $C$DW$34        .dwtag  DW_TAG_member
     791                            .dwattr $C$DW$34, DW_AT_type(*$C$DW$T$29)
     792                            .dwattr $C$DW$34, DW_AT_name("IN")
     793                            .dwattr $C$DW$34, DW_AT_TI_symbol_name("IN")
     794                            .dwattr $C$DW$34, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     795                            .dwattr $C$DW$34, DW_AT_accessibility(DW_ACCESS_public)
     796                            .dwattr $C$DW$34, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices\
     797                            .dwattr $C$DW$34, DW_AT_decl_line(0x288)
     798                            .dwattr $C$DW$34, DW_AT_decl_column(0x0f)
     799                    
     800                    $C$DW$35        .dwtag  DW_TAG_member
     801                            .dwattr $C$DW$35, DW_AT_type(*$C$DW$T$28)
     802                            .dwattr $C$DW$35, DW_AT_name("RESERVED0")
     803                            .dwattr $C$DW$35, DW_AT_TI_symbol_name("RESERVED0")
     804                            .dwattr $C$DW$35, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     805                            .dwattr $C$DW$35, DW_AT_accessibility(DW_ACCESS_public)
     806                            .dwattr $C$DW$35, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices\
     807                            .dwattr $C$DW$35, DW_AT_decl_line(0x289)
     808                            .dwattr $C$DW$35, DW_AT_decl_column(0x0b)
     809                    
     810                    $C$DW$36        .dwtag  DW_TAG_member
     811                            .dwattr $C$DW$36, DW_AT_type(*$C$DW$T$30)
TI ARM Assembler PC v18.12.2 Sat Dec 14 17:40:32 2019

Copyright (c) 1996-2018 Texas Instruments Incorporated
UART.asm                                                             PAGE   16

     812                            .dwattr $C$DW$36, DW_AT_name("OUT")
     813                            .dwattr $C$DW$36, DW_AT_TI_symbol_name("OUT")
     814                            .dwattr $C$DW$36, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     815                            .dwattr $C$DW$36, DW_AT_accessibility(DW_ACCESS_public)
     816                            .dwattr $C$DW$36, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices\
     817                            .dwattr $C$DW$36, DW_AT_decl_line(0x28a)
     818                            .dwattr $C$DW$36, DW_AT_decl_column(0x10)
     819                    
     820                    $C$DW$37        .dwtag  DW_TAG_member
     821                            .dwattr $C$DW$37, DW_AT_type(*$C$DW$T$28)
     822                            .dwattr $C$DW$37, DW_AT_name("RESERVED1")
     823                            .dwattr $C$DW$37, DW_AT_TI_symbol_name("RESERVED1")
     824                            .dwattr $C$DW$37, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
     825                            .dwattr $C$DW$37, DW_AT_accessibility(DW_ACCESS_public)
     826                            .dwattr $C$DW$37, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices\
     827                            .dwattr $C$DW$37, DW_AT_decl_line(0x28b)
     828                            .dwattr $C$DW$37, DW_AT_decl_column(0x0b)
     829                    
     830                    $C$DW$38        .dwtag  DW_TAG_member
     831                            .dwattr $C$DW$38, DW_AT_type(*$C$DW$T$30)
     832                            .dwattr $C$DW$38, DW_AT_name("DIR")
     833                            .dwattr $C$DW$38, DW_AT_TI_symbol_name("DIR")
     834                            .dwattr $C$DW$38, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     835                            .dwattr $C$DW$38, DW_AT_accessibility(DW_ACCESS_public)
     836                            .dwattr $C$DW$38, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices\
     837                            .dwattr $C$DW$38, DW_AT_decl_line(0x28c)
     838                            .dwattr $C$DW$38, DW_AT_decl_column(0x10)
     839                    
     840                    $C$DW$39        .dwtag  DW_TAG_member
     841                            .dwattr $C$DW$39, DW_AT_type(*$C$DW$T$28)
     842                            .dwattr $C$DW$39, DW_AT_name("RESERVED2")
     843                            .dwattr $C$DW$39, DW_AT_TI_symbol_name("RESERVED2")
     844                            .dwattr $C$DW$39, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
     845                            .dwattr $C$DW$39, DW_AT_accessibility(DW_ACCESS_public)
     846                            .dwattr $C$DW$39, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices\
     847                            .dwattr $C$DW$39, DW_AT_decl_line(0x28d)
     848                            .dwattr $C$DW$39, DW_AT_decl_column(0x0b)
     849                    
     850                    $C$DW$40        .dwtag  DW_TAG_member
     851                            .dwattr $C$DW$40, DW_AT_type(*$C$DW$T$30)
     852                            .dwattr $C$DW$40, DW_AT_name("REN")
     853                            .dwattr $C$DW$40, DW_AT_TI_symbol_name("REN")
     854                            .dwattr $C$DW$40, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     855                            .dwattr $C$DW$40, DW_AT_accessibility(DW_ACCESS_public)
     856                            .dwattr $C$DW$40, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices\
     857                            .dwattr $C$DW$40, DW_AT_decl_line(0x28e)
     858                            .dwattr $C$DW$40, DW_AT_decl_column(0x10)
     859                    
     860                    $C$DW$41        .dwtag  DW_TAG_member
     861                            .dwattr $C$DW$41, DW_AT_type(*$C$DW$T$28)
     862                            .dwattr $C$DW$41, DW_AT_name("RESERVED3")
     863                            .dwattr $C$DW$41, DW_AT_TI_symbol_name("RESERVED3")
     864                            .dwattr $C$DW$41, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
     865                            .dwattr $C$DW$41, DW_AT_accessibility(DW_ACCESS_public)
     866                            .dwattr $C$DW$41, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices\
TI ARM Assembler PC v18.12.2 Sat Dec 14 17:40:32 2019

Copyright (c) 1996-2018 Texas Instruments Incorporated
UART.asm                                                             PAGE   17

     867                            .dwattr $C$DW$41, DW_AT_decl_line(0x28f)
     868                            .dwattr $C$DW$41, DW_AT_decl_column(0x0b)
     869                    
     870                    $C$DW$42        .dwtag  DW_TAG_member
     871                            .dwattr $C$DW$42, DW_AT_type(*$C$DW$T$30)
     872                            .dwattr $C$DW$42, DW_AT_name("DS")
     873                            .dwattr $C$DW$42, DW_AT_TI_symbol_name("DS")
     874                            .dwattr $C$DW$42, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     875                            .dwattr $C$DW$42, DW_AT_accessibility(DW_ACCESS_public)
     876                            .dwattr $C$DW$42, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices\
     877                            .dwattr $C$DW$42, DW_AT_decl_line(0x290)
     878                            .dwattr $C$DW$42, DW_AT_decl_column(0x10)
     879                    
     880                    $C$DW$43        .dwtag  DW_TAG_member
     881                            .dwattr $C$DW$43, DW_AT_type(*$C$DW$T$28)
     882                            .dwattr $C$DW$43, DW_AT_name("RESERVED4")
     883                            .dwattr $C$DW$43, DW_AT_TI_symbol_name("RESERVED4")
     884                            .dwattr $C$DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
     885                            .dwattr $C$DW$43, DW_AT_accessibility(DW_ACCESS_public)
     886                            .dwattr $C$DW$43, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices\
     887                            .dwattr $C$DW$43, DW_AT_decl_line(0x291)
     888                            .dwattr $C$DW$43, DW_AT_decl_column(0x0b)
     889                    
     890                    $C$DW$44        .dwtag  DW_TAG_member
     891                            .dwattr $C$DW$44, DW_AT_type(*$C$DW$T$30)
     892                            .dwattr $C$DW$44, DW_AT_name("SEL0")
     893                            .dwattr $C$DW$44, DW_AT_TI_symbol_name("SEL0")
     894                            .dwattr $C$DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     895                            .dwattr $C$DW$44, DW_AT_accessibility(DW_ACCESS_public)
     896                            .dwattr $C$DW$44, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices\
     897                            .dwattr $C$DW$44, DW_AT_decl_line(0x292)
     898                            .dwattr $C$DW$44, DW_AT_decl_column(0x10)
     899                    
     900                    $C$DW$45        .dwtag  DW_TAG_member
     901                            .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$28)
     902                            .dwattr $C$DW$45, DW_AT_name("RESERVED5")
     903                            .dwattr $C$DW$45, DW_AT_TI_symbol_name("RESERVED5")
     904                            .dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
     905                            .dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)
     906                            .dwattr $C$DW$45, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices\
     907                            .dwattr $C$DW$45, DW_AT_decl_line(0x293)
     908                            .dwattr $C$DW$45, DW_AT_decl_column(0x0b)
     909                    
     910                    $C$DW$46        .dwtag  DW_TAG_member
     911                            .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$30)
     912                            .dwattr $C$DW$46, DW_AT_name("SEL1")
     913                            .dwattr $C$DW$46, DW_AT_TI_symbol_name("SEL1")
     914                            .dwattr $C$DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     915                            .dwattr $C$DW$46, DW_AT_accessibility(DW_ACCESS_public)
     916                            .dwattr $C$DW$46, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices\
     917                            .dwattr $C$DW$46, DW_AT_decl_line(0x294)
     918                            .dwattr $C$DW$46, DW_AT_decl_column(0x10)
     919                    
     920                    $C$DW$47        .dwtag  DW_TAG_member
     921                            .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$28)
TI ARM Assembler PC v18.12.2 Sat Dec 14 17:40:32 2019

Copyright (c) 1996-2018 Texas Instruments Incorporated
UART.asm                                                             PAGE   18

     922                            .dwattr $C$DW$47, DW_AT_name("RESERVED6")
     923                            .dwattr $C$DW$47, DW_AT_TI_symbol_name("RESERVED6")
     924                            .dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
     925                            .dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
     926                            .dwattr $C$DW$47, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices\
     927                            .dwattr $C$DW$47, DW_AT_decl_line(0x295)
     928                            .dwattr $C$DW$47, DW_AT_decl_column(0x0b)
     929                    
     930                    $C$DW$48        .dwtag  DW_TAG_member
     931                            .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$24)
     932                            .dwattr $C$DW$48, DW_AT_name("IV")
     933                            .dwattr $C$DW$48, DW_AT_TI_symbol_name("IV")
     934                            .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
     935                            .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
     936                            .dwattr $C$DW$48, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices\
     937                            .dwattr $C$DW$48, DW_AT_decl_line(0x296)
     938                            .dwattr $C$DW$48, DW_AT_decl_column(0x11)
     939                    
     940                    $C$DW$49        .dwtag  DW_TAG_member
     941                            .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$31)
     942                            .dwattr $C$DW$49, DW_AT_name("RESERVED7")
     943                            .dwattr $C$DW$49, DW_AT_TI_symbol_name("RESERVED7")
     944                            .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
     945                            .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
     946                            .dwattr $C$DW$49, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices\
     947                            .dwattr $C$DW$49, DW_AT_decl_line(0x297)
     948                            .dwattr $C$DW$49, DW_AT_decl_column(0x0b)
     949                    
     950                    $C$DW$50        .dwtag  DW_TAG_member
     951                            .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$30)
     952                            .dwattr $C$DW$50, DW_AT_name("SELC")
     953                            .dwattr $C$DW$50, DW_AT_TI_symbol_name("SELC")
     954                            .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
     955                            .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
     956                            .dwattr $C$DW$50, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices\
     957                            .dwattr $C$DW$50, DW_AT_decl_line(0x298)
     958                            .dwattr $C$DW$50, DW_AT_decl_column(0x10)
     959                    
     960                    $C$DW$51        .dwtag  DW_TAG_member
     961                            .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$28)
     962                            .dwattr $C$DW$51, DW_AT_name("RESERVED8")
     963                            .dwattr $C$DW$51, DW_AT_TI_symbol_name("RESERVED8")
     964                            .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
     965                            .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
     966                            .dwattr $C$DW$51, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices\
     967                            .dwattr $C$DW$51, DW_AT_decl_line(0x299)
     968                            .dwattr $C$DW$51, DW_AT_decl_column(0x0b)
     969                    
     970                    $C$DW$52        .dwtag  DW_TAG_member
     971                            .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$30)
     972                            .dwattr $C$DW$52, DW_AT_name("IES")
     973                            .dwattr $C$DW$52, DW_AT_TI_symbol_name("IES")
     974                            .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
     975                            .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
     976                            .dwattr $C$DW$52, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices\
TI ARM Assembler PC v18.12.2 Sat Dec 14 17:40:32 2019

Copyright (c) 1996-2018 Texas Instruments Incorporated
UART.asm                                                             PAGE   19

     977                            .dwattr $C$DW$52, DW_AT_decl_line(0x29a)
     978                            .dwattr $C$DW$52, DW_AT_decl_column(0x10)
     979                    
     980                    $C$DW$53        .dwtag  DW_TAG_member
     981                            .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$28)
     982                            .dwattr $C$DW$53, DW_AT_name("RESERVED9")
     983                            .dwattr $C$DW$53, DW_AT_TI_symbol_name("RESERVED9")
     984                            .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
     985                            .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
     986                            .dwattr $C$DW$53, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices\
     987                            .dwattr $C$DW$53, DW_AT_decl_line(0x29b)
     988                            .dwattr $C$DW$53, DW_AT_decl_column(0x0b)
     989                    
     990                    $C$DW$54        .dwtag  DW_TAG_member
     991                            .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$30)
     992                            .dwattr $C$DW$54, DW_AT_name("IE")
     993                            .dwattr $C$DW$54, DW_AT_TI_symbol_name("IE")
     994                            .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
     995                            .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
     996                            .dwattr $C$DW$54, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices\
     997                            .dwattr $C$DW$54, DW_AT_decl_line(0x29c)
     998                            .dwattr $C$DW$54, DW_AT_decl_column(0x10)
     999                    
    1000                    $C$DW$55        .dwtag  DW_TAG_member
    1001                            .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$28)
    1002                            .dwattr $C$DW$55, DW_AT_name("RESERVED10")
    1003                            .dwattr $C$DW$55, DW_AT_TI_symbol_name("RESERVED10")
    1004                            .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    1005                            .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
    1006                            .dwattr $C$DW$55, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices\
    1007                            .dwattr $C$DW$55, DW_AT_decl_line(0x29d)
    1008                            .dwattr $C$DW$55, DW_AT_decl_column(0x0b)
    1009                    
    1010                    $C$DW$56        .dwtag  DW_TAG_member
    1011                            .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$30)
    1012                            .dwattr $C$DW$56, DW_AT_name("IFG")
    1013                            .dwattr $C$DW$56, DW_AT_TI_symbol_name("IFG")
    1014                            .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    1015                            .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
    1016                            .dwattr $C$DW$56, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices\
    1017                            .dwattr $C$DW$56, DW_AT_decl_line(0x29e)
    1018                            .dwattr $C$DW$56, DW_AT_decl_column(0x10)
    1019                    
    1020                    $C$DW$57        .dwtag  DW_TAG_member
    1021                            .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$28)
    1022                            .dwattr $C$DW$57, DW_AT_name("RESERVED11")
    1023                            .dwattr $C$DW$57, DW_AT_TI_symbol_name("RESERVED11")
    1024                            .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    1025                            .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
    1026                            .dwattr $C$DW$57, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devices\
    1027                            .dwattr $C$DW$57, DW_AT_decl_line(0x29f)
    1028                            .dwattr $C$DW$57, DW_AT_decl_column(0x0b)
    1029                    
    1030                            .dwattr $C$DW$T$32, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\device
    1031                            .dwattr $C$DW$T$32, DW_AT_decl_line(0x287)
TI ARM Assembler PC v18.12.2 Sat Dec 14 17:40:32 2019

Copyright (c) 1996-2018 Texas Instruments Incorporated
UART.asm                                                             PAGE   20

    1032                            .dwattr $C$DW$T$32, DW_AT_decl_column(0x10)
    1033                            .dwendtag $C$DW$T$32
    1034                    
    1035                    $C$DW$T$186     .dwtag  DW_TAG_typedef
    1036                            .dwattr $C$DW$T$186, DW_AT_name("DIO_PORT_Odd_Interruptable_Type")
    1037                            .dwattr $C$DW$T$186, DW_AT_type(*$C$DW$T$32)
    1038                            .dwattr $C$DW$T$186, DW_AT_language(DW_LANG_C)
    1039                            .dwattr $C$DW$T$186, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_30_00_13\source\ti\devic
    1040                            .dwattr $C$DW$T$186, DW_AT_decl_line(0x2a0)
    1041                            .dwattr $C$DW$T$186, DW_AT_decl_column(0x03)
    1042                    
    1043                    
    1044                    $C$DW$T$33      .dwtag  DW_TAG_structure_type
    1045                            .dwattr $C$DW$T$33, DW_AT_byte_size(0x10)
    1046                    $C$DW$58        .dwtag  DW_TAG_member
    1047                            .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$14)
    1048                            .dwattr $C$DW$58, DW_AT_name("__max_align1")
    1049                            .dwattr $C$DW$58, DW_AT_TI_symbol_name("__max_align1")
    1050                            .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1051                            .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
    1052                            .dwattr $C$DW$58, DW_AT_decl_file("C:/ti/ccs910/ccs/tools/compiler/ti-cgt-arm_18.12.2.LTS/incl
    1053                            .dwattr $C$DW$58, DW_AT_decl_line(0x7a)
    1054                            .dwattr $C$DW$58, DW_AT_decl_column(0x0c)
    1055                    
    1056                    $C$DW$59        .dwtag  DW_TAG_member
    1057                            .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$18)
    1058                            .dwattr $C$DW$59, DW_AT_name("__max_align2")
    1059                            .dwattr $C$DW$59, DW_AT_TI_symbol_name("__max_align2")
    1060                            .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1061                            .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
    1062                            .dwattr $C$DW$59, DW_AT_decl_file("C:/ti/ccs910/ccs/tools/compiler/ti-cgt-arm_18.12.2.LTS/incl
    1063                            .dwattr $C$DW$59, DW_AT_decl_line(0x7b)
    1064                            .dwattr $C$DW$59, DW_AT_decl_column(0x0e)
    1065                    
    1066                            .dwattr $C$DW$T$33, DW_AT_decl_file("C:/ti/ccs910/ccs/tools/compiler/ti-cgt-arm_18.12.2.LTS/in
    1067                            .dwattr $C$DW$T$33, DW_AT_decl_line(0x79)
    1068                            .dwattr $C$DW$T$33, DW_AT_decl_column(0x10)
    1069                            .dwendtag $C$DW$T$33
    1070                    
    1071                    $C$DW$T$188     .dwtag  DW_TAG_typedef
    1072                            .dwattr $C$DW$T$188, DW_AT_name("__max_align_t")
    1073                            .dwattr $C$DW$T$188, DW_AT_type(*$C$DW$T$33)
    1074                            .dwattr $C$DW$T$188, DW_AT_language(DW_LANG_C)
    1075                            .dwattr $C$DW$T$188, DW_AT_decl_file("C:/ti/ccs910/ccs/tools/compiler/ti-cgt-arm_18.12.2.LTS/i
    1076                            .dwattr $C$DW$T$188, DW_AT_decl_line(0x7c)
    1077                            .dwattr $C$DW$T$188, DW_AT_decl_column(0x03)
    1078                    
    1079                    
    1080                    $C$DW$T$36      .dwtag  DW_TAG_structure_type
    1081                            .dwattr $C$DW$T$36, DW_AT_byte_size(0x04)
    1082                    $C$DW$60        .dwtag  DW_TAG_member
    1083                            .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$35)
    1084                            .dwattr $C$DW$60, DW_AT_name("_reserved0")
    1085                            .dwattr $C$DW$60, DW_AT_TI_symbol_name("_reserved0")
    1086                            .dwattr $C$DW$60, DW_AT_bit_offset(0x10)
TI ARM Assembler PC v18.12.2 Sat Dec 14 17:40:32 2019

Copyright (c) 1996-2018 Texas Instruments Incorporated
UART.asm                                                             PAGE   21

    1087                            .dwattr $C$DW$60, DW_AT_bit_size(0x10)
    1088                            .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1089                            .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
    1090                            .dwattr $C$DW$60, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_party
    1091                            .dwattr $C$DW$60, DW_AT_decl_line(0x107)
    1092                            .dwattr $C$DW$60, DW_AT_decl_column(0x0e)
    1093                    
    1094                    $C$DW$61        .dwtag  DW_TAG_member
    1095                            .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$35)
    1096                            .dwattr $C$DW$61, DW_AT_name("GE")
    1097                            .dwattr $C$DW$61, DW_AT_TI_symbol_name("GE")
    1098                            .dwattr $C$DW$61, DW_AT_bit_offset(0x0c)
    1099                            .dwattr $C$DW$61, DW_AT_bit_size(0x04)
    1100                            .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1101                            .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
    1102                            .dwattr $C$DW$61, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_party
    1103                            .dwattr $C$DW$61, DW_AT_decl_line(0x108)
    1104                            .dwattr $C$DW$61, DW_AT_decl_column(0x0e)
    1105                    
    1106                    $C$DW$62        .dwtag  DW_TAG_member
    1107                            .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$35)
    1108                            .dwattr $C$DW$62, DW_AT_name("_reserved1")
    1109                            .dwattr $C$DW$62, DW_AT_TI_symbol_name("_reserved1")
    1110                            .dwattr $C$DW$62, DW_AT_bit_offset(0x05)
    1111                            .dwattr $C$DW$62, DW_AT_bit_size(0x07)
    1112                            .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1113                            .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
    1114                            .dwattr $C$DW$62, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_party
    1115                            .dwattr $C$DW$62, DW_AT_decl_line(0x109)
    1116                            .dwattr $C$DW$62, DW_AT_decl_column(0x0e)
    1117                    
    1118                    $C$DW$63        .dwtag  DW_TAG_member
    1119                            .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$35)
    1120                            .dwattr $C$DW$63, DW_AT_name("Q")
    1121                            .dwattr $C$DW$63, DW_AT_TI_symbol_name("Q")
    1122                            .dwattr $C$DW$63, DW_AT_bit_offset(0x04)
    1123                            .dwattr $C$DW$63, DW_AT_bit_size(0x01)
    1124                            .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1125                            .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
    1126                            .dwattr $C$DW$63, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_party
    1127                            .dwattr $C$DW$63, DW_AT_decl_line(0x10a)
    1128                            .dwattr $C$DW$63, DW_AT_decl_column(0x0e)
    1129                    
    1130                    $C$DW$64        .dwtag  DW_TAG_member
    1131                            .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$35)
    1132                            .dwattr $C$DW$64, DW_AT_name("V")
    1133                            .dwattr $C$DW$64, DW_AT_TI_symbol_name("V")
    1134                            .dwattr $C$DW$64, DW_AT_bit_offset(0x03)
    1135                            .dwattr $C$DW$64, DW_AT_bit_size(0x01)
    1136                            .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1137                            .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
    1138                            .dwattr $C$DW$64, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_party
    1139                            .dwattr $C$DW$64, DW_AT_decl_line(0x10b)
    1140                            .dwattr $C$DW$64, DW_AT_decl_column(0x0e)
    1141                    
TI ARM Assembler PC v18.12.2 Sat Dec 14 17:40:32 2019

Copyright (c) 1996-2018 Texas Instruments Incorporated
UART.asm                                                             PAGE   22

    1142                    $C$DW$65        .dwtag  DW_TAG_member
    1143                            .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$35)
    1144                            .dwattr $C$DW$65, DW_AT_name("C")
    1145                            .dwattr $C$DW$65, DW_AT_TI_symbol_name("C")
    1146                            .dwattr $C$DW$65, DW_AT_bit_offset(0x02)
    1147                            .dwattr $C$DW$65, DW_AT_bit_size(0x01)
    1148                            .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1149                            .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
    1150                            .dwattr $C$DW$65, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_party
    1151                            .dwattr $C$DW$65, DW_AT_decl_line(0x10c)
    1152                            .dwattr $C$DW$65, DW_AT_decl_column(0x0e)
    1153                    
    1154                    $C$DW$66        .dwtag  DW_TAG_member
    1155                            .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$35)
    1156                            .dwattr $C$DW$66, DW_AT_name("Z")
    1157                            .dwattr $C$DW$66, DW_AT_TI_symbol_name("Z")
    1158                            .dwattr $C$DW$66, DW_AT_bit_offset(0x01)
    1159                            .dwattr $C$DW$66, DW_AT_bit_size(0x01)
    1160                            .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1161                            .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
    1162                            .dwattr $C$DW$66, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_party
    1163                            .dwattr $C$DW$66, DW_AT_decl_line(0x10d)
    1164                            .dwattr $C$DW$66, DW_AT_decl_column(0x0e)
    1165                    
    1166                    $C$DW$67        .dwtag  DW_TAG_member
    1167                            .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$35)
    1168                            .dwattr $C$DW$67, DW_AT_name("N")
    1169                            .dwattr $C$DW$67, DW_AT_TI_symbol_name("N")
    1170                            .dwattr $C$DW$67, DW_AT_bit_offset(0x00)
    1171                            .dwattr $C$DW$67, DW_AT_bit_size(0x01)
    1172                            .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1173                            .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
    1174                            .dwattr $C$DW$67, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_party
    1175                            .dwattr $C$DW$67, DW_AT_decl_line(0x10e)
    1176                            .dwattr $C$DW$67, DW_AT_decl_column(0x0e)
    1177                    
    1178                            .dwattr $C$DW$T$36, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_par
    1179                            .dwattr $C$DW$T$36, DW_AT_decl_line(0x106)
    1180                            .dwattr $C$DW$T$36, DW_AT_decl_column(0x03)
    1181                            .dwendtag $C$DW$T$36
    1182                    
    1183                    
    1184                    $C$DW$T$37      .dwtag  DW_TAG_structure_type
    1185                            .dwattr $C$DW$T$37, DW_AT_byte_size(0x04)
    1186                    $C$DW$68        .dwtag  DW_TAG_member
    1187                            .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$35)
    1188                            .dwattr $C$DW$68, DW_AT_name("ISR")
    1189                            .dwattr $C$DW$68, DW_AT_TI_symbol_name("ISR")
    1190                            .dwattr $C$DW$68, DW_AT_bit_offset(0x17)
    1191                            .dwattr $C$DW$68, DW_AT_bit_size(0x09)
    1192                            .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1193                            .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
    1194                            .dwattr $C$DW$68, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_party
    1195                            .dwattr $C$DW$68, DW_AT_decl_line(0x12e)
    1196                            .dwattr $C$DW$68, DW_AT_decl_column(0x0e)
TI ARM Assembler PC v18.12.2 Sat Dec 14 17:40:32 2019

Copyright (c) 1996-2018 Texas Instruments Incorporated
UART.asm                                                             PAGE   23

    1197                    
    1198                    $C$DW$69        .dwtag  DW_TAG_member
    1199                            .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$35)
    1200                            .dwattr $C$DW$69, DW_AT_name("_reserved0")
    1201                            .dwattr $C$DW$69, DW_AT_TI_symbol_name("_reserved0")
    1202                            .dwattr $C$DW$69, DW_AT_bit_offset(0x00)
    1203                            .dwattr $C$DW$69, DW_AT_bit_size(0x17)
    1204                            .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1205                            .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
    1206                            .dwattr $C$DW$69, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_party
    1207                            .dwattr $C$DW$69, DW_AT_decl_line(0x12f)
    1208                            .dwattr $C$DW$69, DW_AT_decl_column(0x0e)
    1209                    
    1210                            .dwattr $C$DW$T$37, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_par
    1211                            .dwattr $C$DW$T$37, DW_AT_decl_line(0x12d)
    1212                            .dwattr $C$DW$T$37, DW_AT_decl_column(0x03)
    1213                            .dwendtag $C$DW$T$37
    1214                    
    1215                    
    1216                    $C$DW$T$38      .dwtag  DW_TAG_structure_type
    1217                            .dwattr $C$DW$T$38, DW_AT_byte_size(0x04)
    1218                    $C$DW$70        .dwtag  DW_TAG_member
    1219                            .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$35)
    1220                            .dwattr $C$DW$70, DW_AT_name("ISR")
    1221                            .dwattr $C$DW$70, DW_AT_TI_symbol_name("ISR")
    1222                            .dwattr $C$DW$70, DW_AT_bit_offset(0x17)
    1223                            .dwattr $C$DW$70, DW_AT_bit_size(0x09)
    1224                            .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1225                            .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
    1226                            .dwattr $C$DW$70, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_party
    1227                            .dwattr $C$DW$70, DW_AT_decl_line(0x140)
    1228                            .dwattr $C$DW$70, DW_AT_decl_column(0x0e)
    1229                    
    1230                    $C$DW$71        .dwtag  DW_TAG_member
    1231                            .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$35)
    1232                            .dwattr $C$DW$71, DW_AT_name("_reserved0")
    1233                            .dwattr $C$DW$71, DW_AT_TI_symbol_name("_reserved0")
    1234                            .dwattr $C$DW$71, DW_AT_bit_offset(0x16)
    1235                            .dwattr $C$DW$71, DW_AT_bit_size(0x01)
    1236                            .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1237                            .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
    1238                            .dwattr $C$DW$71, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_party
    1239                            .dwattr $C$DW$71, DW_AT_decl_line(0x141)
    1240                            .dwattr $C$DW$71, DW_AT_decl_column(0x0e)
    1241                    
    1242                    $C$DW$72        .dwtag  DW_TAG_member
    1243                            .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$35)
    1244                            .dwattr $C$DW$72, DW_AT_name("ICI_IT_1")
    1245                            .dwattr $C$DW$72, DW_AT_TI_symbol_name("ICI_IT_1")
    1246                            .dwattr $C$DW$72, DW_AT_bit_offset(0x10)
    1247                            .dwattr $C$DW$72, DW_AT_bit_size(0x06)
    1248                            .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1249                            .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
    1250                            .dwattr $C$DW$72, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_party
    1251                            .dwattr $C$DW$72, DW_AT_decl_line(0x142)
TI ARM Assembler PC v18.12.2 Sat Dec 14 17:40:32 2019

Copyright (c) 1996-2018 Texas Instruments Incorporated
UART.asm                                                             PAGE   24

    1252                            .dwattr $C$DW$72, DW_AT_decl_column(0x0e)
    1253                    
    1254                    $C$DW$73        .dwtag  DW_TAG_member
    1255                            .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$35)
    1256                            .dwattr $C$DW$73, DW_AT_name("GE")
    1257                            .dwattr $C$DW$73, DW_AT_TI_symbol_name("GE")
    1258                            .dwattr $C$DW$73, DW_AT_bit_offset(0x0c)
    1259                            .dwattr $C$DW$73, DW_AT_bit_size(0x04)
    1260                            .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1261                            .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
    1262                            .dwattr $C$DW$73, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_party
    1263                            .dwattr $C$DW$73, DW_AT_decl_line(0x143)
    1264                            .dwattr $C$DW$73, DW_AT_decl_column(0x0e)
    1265                    
    1266                    $C$DW$74        .dwtag  DW_TAG_member
    1267                            .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$35)
    1268                            .dwattr $C$DW$74, DW_AT_name("_reserved1")
    1269                            .dwattr $C$DW$74, DW_AT_TI_symbol_name("_reserved1")
    1270                            .dwattr $C$DW$74, DW_AT_bit_offset(0x08)
    1271                            .dwattr $C$DW$74, DW_AT_bit_size(0x04)
    1272                            .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1273                            .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
    1274                            .dwattr $C$DW$74, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_party
    1275                            .dwattr $C$DW$74, DW_AT_decl_line(0x144)
    1276                            .dwattr $C$DW$74, DW_AT_decl_column(0x0e)
    1277                    
    1278                    $C$DW$75        .dwtag  DW_TAG_member
    1279                            .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$35)
    1280                            .dwattr $C$DW$75, DW_AT_name("T")
    1281                            .dwattr $C$DW$75, DW_AT_TI_symbol_name("T")
    1282                            .dwattr $C$DW$75, DW_AT_bit_offset(0x07)
    1283                            .dwattr $C$DW$75, DW_AT_bit_size(0x01)
    1284                            .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1285                            .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
    1286                            .dwattr $C$DW$75, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_party
    1287                            .dwattr $C$DW$75, DW_AT_decl_line(0x145)
    1288                            .dwattr $C$DW$75, DW_AT_decl_column(0x0e)
    1289                    
    1290                    $C$DW$76        .dwtag  DW_TAG_member
    1291                            .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$35)
    1292                            .dwattr $C$DW$76, DW_AT_name("ICI_IT_2")
    1293                            .dwattr $C$DW$76, DW_AT_TI_symbol_name("ICI_IT_2")
    1294                            .dwattr $C$DW$76, DW_AT_bit_offset(0x05)
    1295                            .dwattr $C$DW$76, DW_AT_bit_size(0x02)
    1296                            .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1297                            .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
    1298                            .dwattr $C$DW$76, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_party
    1299                            .dwattr $C$DW$76, DW_AT_decl_line(0x146)
    1300                            .dwattr $C$DW$76, DW_AT_decl_column(0x0e)
    1301                    
    1302                    $C$DW$77        .dwtag  DW_TAG_member
    1303                            .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$35)
    1304                            .dwattr $C$DW$77, DW_AT_name("Q")
    1305                            .dwattr $C$DW$77, DW_AT_TI_symbol_name("Q")
    1306                            .dwattr $C$DW$77, DW_AT_bit_offset(0x04)
TI ARM Assembler PC v18.12.2 Sat Dec 14 17:40:32 2019

Copyright (c) 1996-2018 Texas Instruments Incorporated
UART.asm                                                             PAGE   25

    1307                            .dwattr $C$DW$77, DW_AT_bit_size(0x01)
    1308                            .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1309                            .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
    1310                            .dwattr $C$DW$77, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_party
    1311                            .dwattr $C$DW$77, DW_AT_decl_line(0x147)
    1312                            .dwattr $C$DW$77, DW_AT_decl_column(0x0e)
    1313                    
    1314                    $C$DW$78        .dwtag  DW_TAG_member
    1315                            .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$35)
    1316                            .dwattr $C$DW$78, DW_AT_name("V")
    1317                            .dwattr $C$DW$78, DW_AT_TI_symbol_name("V")
    1318                            .dwattr $C$DW$78, DW_AT_bit_offset(0x03)
    1319                            .dwattr $C$DW$78, DW_AT_bit_size(0x01)
    1320                            .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1321                            .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
    1322                            .dwattr $C$DW$78, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_party
    1323                            .dwattr $C$DW$78, DW_AT_decl_line(0x148)
    1324                            .dwattr $C$DW$78, DW_AT_decl_column(0x0e)
    1325                    
    1326                    $C$DW$79        .dwtag  DW_TAG_member
    1327                            .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$35)
    1328                            .dwattr $C$DW$79, DW_AT_name("C")
    1329                            .dwattr $C$DW$79, DW_AT_TI_symbol_name("C")
    1330                            .dwattr $C$DW$79, DW_AT_bit_offset(0x02)
    1331                            .dwattr $C$DW$79, DW_AT_bit_size(0x01)
    1332                            .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1333                            .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
    1334                            .dwattr $C$DW$79, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_party
    1335                            .dwattr $C$DW$79, DW_AT_decl_line(0x149)
    1336                            .dwattr $C$DW$79, DW_AT_decl_column(0x0e)
    1337                    
    1338                    $C$DW$80        .dwtag  DW_TAG_member
    1339                            .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$35)
    1340                            .dwattr $C$DW$80, DW_AT_name("Z")
    1341                            .dwattr $C$DW$80, DW_AT_TI_symbol_name("Z")
    1342                            .dwattr $C$DW$80, DW_AT_bit_offset(0x01)
    1343                            .dwattr $C$DW$80, DW_AT_bit_size(0x01)
    1344                            .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1345                            .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
    1346                            .dwattr $C$DW$80, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_party
    1347                            .dwattr $C$DW$80, DW_AT_decl_line(0x14a)
    1348                            .dwattr $C$DW$80, DW_AT_decl_column(0x0e)
    1349                    
    1350                    $C$DW$81        .dwtag  DW_TAG_member
    1351                            .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$35)
    1352                            .dwattr $C$DW$81, DW_AT_name("N")
    1353                            .dwattr $C$DW$81, DW_AT_TI_symbol_name("N")
    1354                            .dwattr $C$DW$81, DW_AT_bit_offset(0x00)
    1355                            .dwattr $C$DW$81, DW_AT_bit_size(0x01)
    1356                            .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1357                            .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
    1358                            .dwattr $C$DW$81, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_party
    1359                            .dwattr $C$DW$81, DW_AT_decl_line(0x14b)
    1360                            .dwattr $C$DW$81, DW_AT_decl_column(0x0e)
    1361                    
TI ARM Assembler PC v18.12.2 Sat Dec 14 17:40:32 2019

Copyright (c) 1996-2018 Texas Instruments Incorporated
UART.asm                                                             PAGE   26

    1362                            .dwattr $C$DW$T$38, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_par
    1363                            .dwattr $C$DW$T$38, DW_AT_decl_line(0x13f)
    1364                            .dwattr $C$DW$T$38, DW_AT_decl_column(0x03)
    1365                            .dwendtag $C$DW$T$38
    1366                    
    1367                    
    1368                    $C$DW$T$39      .dwtag  DW_TAG_structure_type
    1369                            .dwattr $C$DW$T$39, DW_AT_byte_size(0x04)
    1370                    $C$DW$82        .dwtag  DW_TAG_member
    1371                            .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$35)
    1372                            .dwattr $C$DW$82, DW_AT_name("nPRIV")
    1373                            .dwattr $C$DW$82, DW_AT_TI_symbol_name("nPRIV")
    1374                            .dwattr $C$DW$82, DW_AT_bit_offset(0x1f)
    1375                            .dwattr $C$DW$82, DW_AT_bit_size(0x01)
    1376                            .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1377                            .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
    1378                            .dwattr $C$DW$82, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_party
    1379                            .dwattr $C$DW$82, DW_AT_decl_line(0x177)
    1380                            .dwattr $C$DW$82, DW_AT_decl_column(0x0e)
    1381                    
    1382                    $C$DW$83        .dwtag  DW_TAG_member
    1383                            .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$35)
    1384                            .dwattr $C$DW$83, DW_AT_name("SPSEL")
    1385                            .dwattr $C$DW$83, DW_AT_TI_symbol_name("SPSEL")
    1386                            .dwattr $C$DW$83, DW_AT_bit_offset(0x1e)
    1387                            .dwattr $C$DW$83, DW_AT_bit_size(0x01)
    1388                            .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1389                            .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    1390                            .dwattr $C$DW$83, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_party
    1391                            .dwattr $C$DW$83, DW_AT_decl_line(0x178)
    1392                            .dwattr $C$DW$83, DW_AT_decl_column(0x0e)
    1393                    
    1394                    $C$DW$84        .dwtag  DW_TAG_member
    1395                            .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$35)
    1396                            .dwattr $C$DW$84, DW_AT_name("FPCA")
    1397                            .dwattr $C$DW$84, DW_AT_TI_symbol_name("FPCA")
    1398                            .dwattr $C$DW$84, DW_AT_bit_offset(0x1d)
    1399                            .dwattr $C$DW$84, DW_AT_bit_size(0x01)
    1400                            .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1401                            .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    1402                            .dwattr $C$DW$84, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_party
    1403                            .dwattr $C$DW$84, DW_AT_decl_line(0x179)
    1404                            .dwattr $C$DW$84, DW_AT_decl_column(0x0e)
    1405                    
    1406                    $C$DW$85        .dwtag  DW_TAG_member
    1407                            .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$35)
    1408                            .dwattr $C$DW$85, DW_AT_name("_reserved0")
    1409                            .dwattr $C$DW$85, DW_AT_TI_symbol_name("_reserved0")
    1410                            .dwattr $C$DW$85, DW_AT_bit_offset(0x00)
    1411                            .dwattr $C$DW$85, DW_AT_bit_size(0x1d)
    1412                            .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1413                            .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    1414                            .dwattr $C$DW$85, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_party
    1415                            .dwattr $C$DW$85, DW_AT_decl_line(0x17a)
    1416                            .dwattr $C$DW$85, DW_AT_decl_column(0x0e)
TI ARM Assembler PC v18.12.2 Sat Dec 14 17:40:32 2019

Copyright (c) 1996-2018 Texas Instruments Incorporated
UART.asm                                                             PAGE   27

    1417                    
    1418                            .dwattr $C$DW$T$39, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_par
    1419                            .dwattr $C$DW$T$39, DW_AT_decl_line(0x176)
    1420                            .dwattr $C$DW$T$39, DW_AT_decl_column(0x03)
    1421                            .dwendtag $C$DW$T$39
    1422                    
    1423                    
    1424                    $C$DW$T$46      .dwtag  DW_TAG_structure_type
    1425                            .dwattr $C$DW$T$46, DW_AT_byte_size(0xe04)
    1426                    $C$DW$86        .dwtag  DW_TAG_member
    1427                            .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$41)
    1428                            .dwattr $C$DW$86, DW_AT_name("ISER")
    1429                            .dwattr $C$DW$86, DW_AT_TI_symbol_name("ISER")
    1430                            .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1431                            .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1432                            .dwattr $C$DW$86, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_party
    1433                            .dwattr $C$DW$86, DW_AT_decl_line(0x198)
    1434                            .dwattr $C$DW$86, DW_AT_decl_column(0x12)
    1435                    
    1436                    $C$DW$87        .dwtag  DW_TAG_member
    1437                            .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$42)
    1438                            .dwattr $C$DW$87, DW_AT_name("RESERVED0")
    1439                            .dwattr $C$DW$87, DW_AT_TI_symbol_name("RESERVED0")
    1440                            .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    1441                            .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1442                            .dwattr $C$DW$87, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_party
    1443                            .dwattr $C$DW$87, DW_AT_decl_line(0x199)
    1444                            .dwattr $C$DW$87, DW_AT_decl_column(0x12)
    1445                    
    1446                    $C$DW$88        .dwtag  DW_TAG_member
    1447                            .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$41)
    1448                            .dwattr $C$DW$88, DW_AT_name("ICER")
    1449                            .dwattr $C$DW$88, DW_AT_TI_symbol_name("ICER")
    1450                            .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x80]
    1451                            .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1452                            .dwattr $C$DW$88, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_party
    1453                            .dwattr $C$DW$88, DW_AT_decl_line(0x19a)
    1454                            .dwattr $C$DW$88, DW_AT_decl_column(0x12)
    1455                    
    1456                    $C$DW$89        .dwtag  DW_TAG_member
    1457                            .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$42)
    1458                            .dwattr $C$DW$89, DW_AT_name("RESERVED1")
    1459                            .dwattr $C$DW$89, DW_AT_TI_symbol_name("RESERVED1")
    1460                            .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    1461                            .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1462                            .dwattr $C$DW$89, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_party
    1463                            .dwattr $C$DW$89, DW_AT_decl_line(0x19b)
    1464                            .dwattr $C$DW$89, DW_AT_decl_column(0x12)
    1465                    
    1466                    $C$DW$90        .dwtag  DW_TAG_member
    1467                            .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$41)
    1468                            .dwattr $C$DW$90, DW_AT_name("ISPR")
    1469                            .dwattr $C$DW$90, DW_AT_TI_symbol_name("ISPR")
    1470                            .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x100]
    1471                            .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v18.12.2 Sat Dec 14 17:40:32 2019

Copyright (c) 1996-2018 Texas Instruments Incorporated
UART.asm                                                             PAGE   28

    1472                            .dwattr $C$DW$90, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_party
    1473                            .dwattr $C$DW$90, DW_AT_decl_line(0x19c)
    1474                            .dwattr $C$DW$90, DW_AT_decl_column(0x12)
    1475                    
    1476                    $C$DW$91        .dwtag  DW_TAG_member
    1477                            .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$42)
    1478                            .dwattr $C$DW$91, DW_AT_name("RESERVED2")
    1479                            .dwattr $C$DW$91, DW_AT_TI_symbol_name("RESERVED2")
    1480                            .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x120]
    1481                            .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1482                            .dwattr $C$DW$91, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_party
    1483                            .dwattr $C$DW$91, DW_AT_decl_line(0x19d)
    1484                            .dwattr $C$DW$91, DW_AT_decl_column(0x12)
    1485                    
    1486                    $C$DW$92        .dwtag  DW_TAG_member
    1487                            .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$41)
    1488                            .dwattr $C$DW$92, DW_AT_name("ICPR")
    1489                            .dwattr $C$DW$92, DW_AT_TI_symbol_name("ICPR")
    1490                            .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x180]
    1491                            .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1492                            .dwattr $C$DW$92, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_party
    1493                            .dwattr $C$DW$92, DW_AT_decl_line(0x19e)
    1494                            .dwattr $C$DW$92, DW_AT_decl_column(0x12)
    1495                    
    1496                    $C$DW$93        .dwtag  DW_TAG_member
    1497                            .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$42)
    1498                            .dwattr $C$DW$93, DW_AT_name("RESERVED3")
    1499                            .dwattr $C$DW$93, DW_AT_TI_symbol_name("RESERVED3")
    1500                            .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a0]
    1501                            .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1502                            .dwattr $C$DW$93, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_party
    1503                            .dwattr $C$DW$93, DW_AT_decl_line(0x19f)
    1504                            .dwattr $C$DW$93, DW_AT_decl_column(0x12)
    1505                    
    1506                    $C$DW$94        .dwtag  DW_TAG_member
    1507                            .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$41)
    1508                            .dwattr $C$DW$94, DW_AT_name("IABR")
    1509                            .dwattr $C$DW$94, DW_AT_TI_symbol_name("IABR")
    1510                            .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x200]
    1511                            .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1512                            .dwattr $C$DW$94, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_party
    1513                            .dwattr $C$DW$94, DW_AT_decl_line(0x1a0)
    1514                            .dwattr $C$DW$94, DW_AT_decl_column(0x12)
    1515                    
    1516                    $C$DW$95        .dwtag  DW_TAG_member
    1517                            .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$43)
    1518                            .dwattr $C$DW$95, DW_AT_name("RESERVED4")
    1519                            .dwattr $C$DW$95, DW_AT_TI_symbol_name("RESERVED4")
    1520                            .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x220]
    1521                            .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1522                            .dwattr $C$DW$95, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_party
    1523                            .dwattr $C$DW$95, DW_AT_decl_line(0x1a1)
    1524                            .dwattr $C$DW$95, DW_AT_decl_column(0x12)
    1525                    
    1526                    $C$DW$96        .dwtag  DW_TAG_member
TI ARM Assembler PC v18.12.2 Sat Dec 14 17:40:32 2019

Copyright (c) 1996-2018 Texas Instruments Incorporated
UART.asm                                                             PAGE   29

    1527                            .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$44)
    1528                            .dwattr $C$DW$96, DW_AT_name("IP")
    1529                            .dwattr $C$DW$96, DW_AT_TI_symbol_name("IP")
    1530                            .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x300]
    1531                            .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1532                            .dwattr $C$DW$96, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_party
    1533                            .dwattr $C$DW$96, DW_AT_decl_line(0x1a2)
    1534                            .dwattr $C$DW$96, DW_AT_decl_column(0x12)
    1535                    
    1536                    $C$DW$97        .dwtag  DW_TAG_member
    1537                            .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$45)
    1538                            .dwattr $C$DW$97, DW_AT_name("RESERVED5")
    1539                            .dwattr $C$DW$97, DW_AT_TI_symbol_name("RESERVED5")
    1540                            .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x3f0]
    1541                            .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1542                            .dwattr $C$DW$97, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_party
    1543                            .dwattr $C$DW$97, DW_AT_decl_line(0x1a3)
    1544                            .dwattr $C$DW$97, DW_AT_decl_column(0x12)
    1545                    
    1546                    $C$DW$98        .dwtag  DW_TAG_member
    1547                            .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$40)
    1548                            .dwattr $C$DW$98, DW_AT_name("STIR")
    1549                            .dwattr $C$DW$98, DW_AT_TI_symbol_name("STIR")
    1550                            .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0xe00]
    1551                            .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1552                            .dwattr $C$DW$98, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_party
    1553                            .dwattr $C$DW$98, DW_AT_decl_line(0x1a4)
    1554                            .dwattr $C$DW$98, DW_AT_decl_column(0x12)
    1555                    
    1556                            .dwattr $C$DW$T$46, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_par
    1557                            .dwattr $C$DW$T$46, DW_AT_decl_line(0x197)
    1558                            .dwattr $C$DW$T$46, DW_AT_decl_column(0x01)
    1559                            .dwendtag $C$DW$T$46
    1560                    
    1561                    $C$DW$T$189     .dwtag  DW_TAG_typedef
    1562                            .dwattr $C$DW$T$189, DW_AT_name("NVIC_Type")
    1563                            .dwattr $C$DW$T$189, DW_AT_type(*$C$DW$T$46)
    1564                            .dwattr $C$DW$T$189, DW_AT_language(DW_LANG_C)
    1565                            .dwattr $C$DW$T$189, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_pa
    1566                            .dwattr $C$DW$T$189, DW_AT_decl_line(0x1a5)
    1567                            .dwattr $C$DW$T$189, DW_AT_decl_column(0x04)
    1568                    
    1569                    
    1570                    $C$DW$T$53      .dwtag  DW_TAG_structure_type
    1571                            .dwattr $C$DW$T$53, DW_AT_byte_size(0x8c)
    1572                    $C$DW$99        .dwtag  DW_TAG_member
    1573                            .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$47)
    1574                            .dwattr $C$DW$99, DW_AT_name("CPUID")
    1575                            .dwattr $C$DW$99, DW_AT_TI_symbol_name("CPUID")
    1576                            .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1577                            .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1578                            .dwattr $C$DW$99, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_party
    1579                            .dwattr $C$DW$99, DW_AT_decl_line(0x1ba)
    1580                            .dwattr $C$DW$99, DW_AT_decl_column(0x12)
    1581                    
TI ARM Assembler PC v18.12.2 Sat Dec 14 17:40:32 2019

Copyright (c) 1996-2018 Texas Instruments Incorporated
UART.asm                                                             PAGE   30

    1582                    $C$DW$100       .dwtag  DW_TAG_member
    1583                            .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$40)
    1584                            .dwattr $C$DW$100, DW_AT_name("ICSR")
    1585                            .dwattr $C$DW$100, DW_AT_TI_symbol_name("ICSR")
    1586                            .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1587                            .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1588                            .dwattr $C$DW$100, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_part
    1589                            .dwattr $C$DW$100, DW_AT_decl_line(0x1bb)
    1590                            .dwattr $C$DW$100, DW_AT_decl_column(0x12)
    1591                    
    1592                    $C$DW$101       .dwtag  DW_TAG_member
    1593                            .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$40)
    1594                            .dwattr $C$DW$101, DW_AT_name("VTOR")
    1595                            .dwattr $C$DW$101, DW_AT_TI_symbol_name("VTOR")
    1596                            .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1597                            .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1598                            .dwattr $C$DW$101, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_part
    1599                            .dwattr $C$DW$101, DW_AT_decl_line(0x1bc)
    1600                            .dwattr $C$DW$101, DW_AT_decl_column(0x12)
    1601                    
    1602                    $C$DW$102       .dwtag  DW_TAG_member
    1603                            .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$40)
    1604                            .dwattr $C$DW$102, DW_AT_name("AIRCR")
    1605                            .dwattr $C$DW$102, DW_AT_TI_symbol_name("AIRCR")
    1606                            .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1607                            .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1608                            .dwattr $C$DW$102, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_part
    1609                            .dwattr $C$DW$102, DW_AT_decl_line(0x1bd)
    1610                            .dwattr $C$DW$102, DW_AT_decl_column(0x12)
    1611                    
    1612                    $C$DW$103       .dwtag  DW_TAG_member
    1613                            .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$40)
    1614                            .dwattr $C$DW$103, DW_AT_name("SCR")
    1615                            .dwattr $C$DW$103, DW_AT_TI_symbol_name("SCR")
    1616                            .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1617                            .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1618                            .dwattr $C$DW$103, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_part
    1619                            .dwattr $C$DW$103, DW_AT_decl_line(0x1be)
    1620                            .dwattr $C$DW$103, DW_AT_decl_column(0x12)
    1621                    
    1622                    $C$DW$104       .dwtag  DW_TAG_member
    1623                            .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$40)
    1624                            .dwattr $C$DW$104, DW_AT_name("CCR")
    1625                            .dwattr $C$DW$104, DW_AT_TI_symbol_name("CCR")
    1626                            .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1627                            .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1628                            .dwattr $C$DW$104, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_part
    1629                            .dwattr $C$DW$104, DW_AT_decl_line(0x1bf)
    1630                            .dwattr $C$DW$104, DW_AT_decl_column(0x12)
    1631                    
    1632                    $C$DW$105       .dwtag  DW_TAG_member
    1633                            .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$48)
    1634                            .dwattr $C$DW$105, DW_AT_name("SHP")
    1635                            .dwattr $C$DW$105, DW_AT_TI_symbol_name("SHP")
    1636                            .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
TI ARM Assembler PC v18.12.2 Sat Dec 14 17:40:32 2019

Copyright (c) 1996-2018 Texas Instruments Incorporated
UART.asm                                                             PAGE   31

    1637                            .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1638                            .dwattr $C$DW$105, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_part
    1639                            .dwattr $C$DW$105, DW_AT_decl_line(0x1c0)
    1640                            .dwattr $C$DW$105, DW_AT_decl_column(0x12)
    1641                    
    1642                    $C$DW$106       .dwtag  DW_TAG_member
    1643                            .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$40)
    1644                            .dwattr $C$DW$106, DW_AT_name("SHCSR")
    1645                            .dwattr $C$DW$106, DW_AT_TI_symbol_name("SHCSR")
    1646                            .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    1647                            .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1648                            .dwattr $C$DW$106, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_part
    1649                            .dwattr $C$DW$106, DW_AT_decl_line(0x1c1)
    1650                            .dwattr $C$DW$106, DW_AT_decl_column(0x12)
    1651                    
    1652                    $C$DW$107       .dwtag  DW_TAG_member
    1653                            .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$40)
    1654                            .dwattr $C$DW$107, DW_AT_name("CFSR")
    1655                            .dwattr $C$DW$107, DW_AT_TI_symbol_name("CFSR")
    1656                            .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    1657                            .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1658                            .dwattr $C$DW$107, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_part
    1659                            .dwattr $C$DW$107, DW_AT_decl_line(0x1c2)
    1660                            .dwattr $C$DW$107, DW_AT_decl_column(0x12)
    1661                    
    1662                    $C$DW$108       .dwtag  DW_TAG_member
    1663                            .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$40)
    1664                            .dwattr $C$DW$108, DW_AT_name("HFSR")
    1665                            .dwattr $C$DW$108, DW_AT_TI_symbol_name("HFSR")
    1666                            .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    1667                            .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1668                            .dwattr $C$DW$108, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_part
    1669                            .dwattr $C$DW$108, DW_AT_decl_line(0x1c3)
    1670                            .dwattr $C$DW$108, DW_AT_decl_column(0x12)
    1671                    
    1672                    $C$DW$109       .dwtag  DW_TAG_member
    1673                            .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$40)
    1674                            .dwattr $C$DW$109, DW_AT_name("DFSR")
    1675                            .dwattr $C$DW$109, DW_AT_TI_symbol_name("DFSR")
    1676                            .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    1677                            .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1678                            .dwattr $C$DW$109, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_part
    1679                            .dwattr $C$DW$109, DW_AT_decl_line(0x1c4)
    1680                            .dwattr $C$DW$109, DW_AT_decl_column(0x12)
    1681                    
    1682                    $C$DW$110       .dwtag  DW_TAG_member
    1683                            .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$40)
    1684                            .dwattr $C$DW$110, DW_AT_name("MMFAR")
    1685                            .dwattr $C$DW$110, DW_AT_TI_symbol_name("MMFAR")
    1686                            .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    1687                            .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1688                            .dwattr $C$DW$110, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_part
    1689                            .dwattr $C$DW$110, DW_AT_decl_line(0x1c5)
    1690                            .dwattr $C$DW$110, DW_AT_decl_column(0x12)
    1691                    
TI ARM Assembler PC v18.12.2 Sat Dec 14 17:40:32 2019

Copyright (c) 1996-2018 Texas Instruments Incorporated
UART.asm                                                             PAGE   32

    1692                    $C$DW$111       .dwtag  DW_TAG_member
    1693                            .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$40)
    1694                            .dwattr $C$DW$111, DW_AT_name("BFAR")
    1695                            .dwattr $C$DW$111, DW_AT_TI_symbol_name("BFAR")
    1696                            .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    1697                            .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1698                            .dwattr $C$DW$111, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_part
    1699                            .dwattr $C$DW$111, DW_AT_decl_line(0x1c6)
    1700                            .dwattr $C$DW$111, DW_AT_decl_column(0x12)
    1701                    
    1702                    $C$DW$112       .dwtag  DW_TAG_member
    1703                            .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$40)
    1704                            .dwattr $C$DW$112, DW_AT_name("AFSR")
    1705                            .dwattr $C$DW$112, DW_AT_TI_symbol_name("AFSR")
    1706                            .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    1707                            .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1708                            .dwattr $C$DW$112, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_part
    1709                            .dwattr $C$DW$112, DW_AT_decl_line(0x1c7)
    1710                            .dwattr $C$DW$112, DW_AT_decl_column(0x12)
    1711                    
    1712                    $C$DW$113       .dwtag  DW_TAG_member
    1713                            .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$49)
    1714                            .dwattr $C$DW$113, DW_AT_name("PFR")
    1715                            .dwattr $C$DW$113, DW_AT_TI_symbol_name("PFR")
    1716                            .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    1717                            .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1718                            .dwattr $C$DW$113, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_part
    1719                            .dwattr $C$DW$113, DW_AT_decl_line(0x1c8)
    1720                            .dwattr $C$DW$113, DW_AT_decl_column(0x12)
    1721                    
    1722                    $C$DW$114       .dwtag  DW_TAG_member
    1723                            .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$47)
    1724                            .dwattr $C$DW$114, DW_AT_name("DFR")
    1725                            .dwattr $C$DW$114, DW_AT_TI_symbol_name("DFR")
    1726                            .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    1727                            .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1728                            .dwattr $C$DW$114, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_part
    1729                            .dwattr $C$DW$114, DW_AT_decl_line(0x1c9)
    1730                            .dwattr $C$DW$114, DW_AT_decl_column(0x12)
    1731                    
    1732                    $C$DW$115       .dwtag  DW_TAG_member
    1733                            .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$47)
    1734                            .dwattr $C$DW$115, DW_AT_name("ADR")
    1735                            .dwattr $C$DW$115, DW_AT_TI_symbol_name("ADR")
    1736                            .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
    1737                            .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1738                            .dwattr $C$DW$115, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_30_00_13/source/third_part
